{
	"url": "https://medium.com/@Zyler9985/a-concise-overview-of-zenon-aa72ba4dfffd",
	"title": "A concise overview of Zenon",
	"description": "People are busier than ever these days — we get it, you need just a quick summary of the essentials. Or maybe you’re not that busy, but as a person well-versed in philosophy you recognise that your time is...",
	"links": [
	  "https://medium.com/@Zyler9985/a-concise-overview-of-zenon-aa72ba4dfffd"
	],
	"image": "https://miro.medium.com/v2/resize:fit:1117/1*s7-LuBCrq4g2UKfwDB23tw.png",
	"content": "<article><div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----aa72ba4dfffd--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>People are busier than ever these days — we get it, you need just a quick summary of the essentials. Or maybe you’re not that busy, but as a person well-versed in philosophy you recognise that your time is valuable (and time is what life is made up of, grasshopper). So without further ado, here is a concise overview of Zenon Network.</p><p>Disclaimer: This article is not financial advice and may contain speculation.</p><figure></figure><h2 id="387e">In 1 Minute …</h2><ul><li>Zenon is a new <strong>layer 1</strong> crypto with <strong>&lt; 500M</strong> market cap (other layer 1s are Ethereum, Solana, Polkadot, Avax etc. which are all <strong>&gt; 10B</strong> market cap)</li><li>Zenon’s <strong>architecture</strong> has never been done before in crypto. The above mentioned cryptos all have a single-coin, 1 ledger system. Zenon has a dual-coin, 2 ledger system called the Network of Momentum. Its innovative design is a <strong>block-lattice + meta-DAG.</strong> It is PoW + PoS</li><li>Its <strong>main goal</strong> is to complement and strengthen Bitcoin by endeavouring to be the global standard for <strong>defi with BTC</strong>; possible since the taproot upgrade in Nov 2021. Zenon mirrors the Bitcoin Ethos and there are rumours that heavyweight Bitcoin devs are involved</li><li>It <strong>also aims</strong> to be a leading developer platform for <strong>apps</strong> with a vast variety of use cases from defi, gamefi, IoT, storage, AI, NFTs etc. These apps will benefit from Zenon being a completely <strong>fee-less </strong>platform</li></ul><h2 id="2f0e">In 5 Minutes …</h2><ul><li>Zenon offers a <strong>unique approach</strong> to solving the <strong>blockchain trilemma</strong>. The issue of balancing security, scalability and decentralisation has plagued the legacy blockchains (which are all 1 ledger systems). Zenon delivers next-gen technology in the form of a <strong>2 ledger system. </strong>The coins are Zenon ($ZNN) and Quasar ($QSR) which are the two utility tokens which power the Network of Momentum (NoM). They are stored in the Syrius wallet where you can earn APY from staking or setting up nodes</li><li>The apps built on Zenon (zApps) will have ZTS tokens, analogous to erc-20 tokens built on Ethereum. They will <strong>benefit from</strong> its rock-solid security, ultra-scalability and true decentralisation. They will also enjoy a competitive advantage from Zenon’s design which <strong>eliminates fees</strong>. Users can send transactions via their computer doing a proof of work calculation or for more throughput/complexity they can utilise a novel mechanism which requires $QSR (but does not spend it)</li><li>Zenon mirrors the Bitcoin ethos in many ways. Zenon is built on a foundation of <strong>true decentralisation</strong>. It was fairly launched with <strong>no pre-sale, pre-mine or VC backing</strong>. This is important for many reasons. Zenon is a gem amongst a sea of centralised, VC-owned, single point of failure entities that have a limited lifespan</li><li>Given the scope and ambition of the project, and its particular focus on Bitcoin, it’s natural to wonder who is involved? What is their end game? To answer the first question, given all of the signs and hints, it’s probably <strong>OG Bitcoiners</strong>. That means deep pockets, burning passion and giga-brains wrapped in a lethal package for smashing the status quo. To answer the second question, keep in mind that the syrius wallet is fully open-source, non-custodial and enables fee-less transactions. For the newcomers, here’s a tweet from the testnet days. If it’s one day minted as an NFT, I envision it being titled:<strong> “A promise made.”</strong></li></ul><figure></figure><h2 id="a918">In 30+ Minutes …</h2><p>Ready to do a deep-dive on Zenon? You would do well to check out the following resources which will explain more about the project and answer any questions you may have. Below are descriptions with links at the end.</p><ul><li><strong>An ape’s guide to the galaxy redux</strong> (the mother of all articles; this is perfect reading for those wishing to do a deeper dive on the project)</li><li><strong>How Zenon Mirrors the Bitcoin Ethos</strong> (a comparison over inception, trustless nature, culture, governance and innovation)</li><li><strong>Putting the ‘Z’ in Decentralisation</strong> (covers Zenon’s fair launch and its many facets of decentralisation; breaks down the problem with ETH)</li><li><strong>Zenon.Network, their official website</strong> (definitely check out the links to their official twitter, discord and telegram as well)</li><li><strong>How to buy $ZNN using pancakeswap</strong> (a tutorial for how to use pancakeswap to buy wZNN and bridge it to native ZNN in syrius wallet)</li><li><strong>Zenon Network Forum</strong> (the discussions, info, guides, community-made articles, news etc. is all excellently organised and easy to find here)</li><li><strong>Zenon Community Wiki</strong> (this will be an invaluable resource to expand and deepen your Zenon knowledge; currently under construction)</li><li><strong>Hyperspace x Accelerator-Z: towards a DAO of DAOs</strong> (there is currently a grant program running where anyone can apply to access funding)</li></ul><p><strong>Take care and WAGMI!</strong></p><p>– Zyler</p></div></article>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2022-05-26T14:41:10.760Z",
	"ttr": 148,
	"type": "article"
  }