{
	"url": "https://medium.com/@Zyler9985/forget-web3-its-time-for-zenon-b7fedbf2ae2f",
	"title": "Forget web3, it’s time for Zenon",
	"description": "Layer 1s all seem to come off a conveyor belt these days. They’re all proof of stake, had a massive pre-sale, have high fees, are not interoperable with native Bitcoin etc. They’re all just subpar clones of...",
	"links": [
	  "https://medium.com/@Zyler9985/forget-web3-its-time-for-zenon-b7fedbf2ae2f"
	],
	"image": "https://miro.medium.com/v2/resize:fit:602/1*rBsQhramUsDveBOebUIGbQ.png",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----b7fedbf2ae2f--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>Layer 1s all seem to come off a conveyor belt these days. They’re all proof of stake, had a massive pre-sale, have high fees, are not interoperable with native Bitcoin etc. They’re all just subpar clones of each other, all pushing the web3 narrative when really they’re centralised entities in sheep’s clothing.</p><p>I’d encourage you to visit crypto twitter, there was quite a storm recently where Jack Dorsey put on his Superman cape and decided to call out these villainous venture capital funds. Did he rustle some feathers? Get under some skin? Karate-kick the hornet’s nest? Sure. But he also stoked a lot of healthy debate. The <em>idea</em> of web3 is beautiful, but currently bad actors are exploiting this and claiming to be decentralised when they’re not. Elon Musk even chimed in and called the current version of web3 marketing smoke and mirrors. Super Jack did a noble thing that day, he did what the regulators have been slack on doing: He made an effort to protect investors.</p><p>I’d like to continue this conversation by suggesting a new layer 1 which is as principled as it is innovative. For this article we are going to refer to the centralised Ethereum, Solana, Hedera and co. as “web3”. We will discuss why centralisation is bad, why Zenon does not fall under this umbrella and finally we will briefly touch on other ways Zenon distinguishes itself from the field with its multiple innovations.</p><p>Disclaimer: This article contains speculative elements and in no way constitutes financial advice.</p><figure></figure><p><strong>3 Reasons Why Centralisation is Bad:</strong></p><p><strong>a)</strong> When only a few people control the entire entity, they are going to make governing decisions which serve their own interests, even when it would be to the detriment of everyone else.</p><p><strong>16)</strong> Having all the power concentrated into one place severely undermines the security of the network. People can be bribed, coerced, and yes, they can even act badly of their own accord. Computers can be hacked, sabotaged, damaged. Elon Musk recently spoke to Bitcoin’s strengths, one of which included that it was decentralised and therefore had “no throat to choke”. (Check out “the B word” conference which also featured Jack Dorsey).</p><p><strong>z)</strong> Investors are vulnerable to underhanded market practices. A classic one plays out like this. Venture capital fund AXZ owns 90% of the supply of a coin which does nothing. AXZ claims the coin does do something, but this is only so that it can be classified as a utility token and avoid being classed as a security (they’re exploiting an SEC loophole to avoid regulators coming down on them). They orchestrate pumps to generate FOMO (fear of missing out) and then sell the top, dumping their useless vapourware coins and using new investors as exit liquidity.</p><p><strong>4 Reasons Why Zenon is Decentralised</strong></p><p><strong>1. Voting System;</strong> web3 is proof of stake (also called proof of sh*tcoin), so whoever owns the most gets the most voting power. With this system, the interests of a few wealthy holders reigns supreme. Zenon on the other hand uses a delegation system. Pillar holders vote on decisions, where the pillar with the most weight has the most voting power. However, the people can choose which pillar to delegate their weight to, such that their interests are represented. Therefore, in the Zenon ecosystem the people get a say in decision-making even without owning a pillar. Zenocracy at its finest.</p><p><strong>2. Launching Method;</strong> web3 is launched via an initial coin offering/pre-sale to venture capitals and whales who will buy up the majority of the supply, centralising it. Zenon was launched via X-Stakes, a novel mechanism where investors bought 5000 ZNN for 1 BTC and as long as they ran a node reliably for 2 years, their BTC was returned in full. Furthermore, the developers were selling ZNN before it was ready in an effort to distribute it even more amongst the people. Investors could buy legacy ZNN which is made from a PIVX fork, and since late Nov 2021 can swap it for alphanet ZNN.</p><p><strong>3. Marketing;</strong> web3 has heavy marketing from as early as possible in an effort to maximise revenue, they don’t care that this also attracts all the big players to buy up controlling portions early on. Zenon on the other hand has had zero marketing for the last 3 years. Awareness has only spread by word of mouth and occasional social media campaigns, keeping it well under the radar such that when the big institutional money arrives, much of it has already been distributed far and wide.</p><p><strong>4. By Design;</strong> it is still early days with Zenon, so a couple of these things are still on their way, but the Syrius wallet will be entirely open-source and non-custodial, making it trust-less and permission-less. It will have the in-built capacity to run your own node so you don’t have to trust anybody, you can verify everything for yourself. The anonymous team, while a drawback for some, is also required for maximum decentralisation. We are all Satoshi, as they say.</p><p>From all aspects, Zenon appears to be closely adhering to Bitcoin ethos … which is fitting as it is also one of the only layer 1s aiming for BTC interoperability and subsequently defi with BTC (now possible thanks to the recent taproot upgrade). It’s no wonder that speculation is bubbling with excitement in certain circles. Are any bitcoin dev heavyweights collaborating with Zenon? Time will tell …</p><p><strong>Other Ways Zenon Distinguishes Itself</strong></p><p>I’m not usually a fan of beating a dead horse, and at any rate these things have already been covered well elsewhere. But to touch on it briefly, here we will present two infographics:</p><p>1) Comparison to other layer 1s (credit to Layiid)</p><p>Of significant note is Zenon’s fair launch, the fee-less paradigm and interoperability with Bitcoin (coming soon). Its scalability is currently theoretical, but testing is coming soon and by using a 2-ledger system whereby a generic dag is combined with a block-lattice, we could see some incredible scalability. At the very least, Zenon’s 2-ledger system (called the Network of Momentum) is something different from all of the competitors in the infographic below which run on a 1-ledger system.</p><figure></figure><figure></figure><p>2) A presentation of speculative price targets</p><p>This one is just for fun. You will notice that the prices are generally very high; this is a mathematical consequence of Zenon’s incredibly scarce supply. Note that the values are approximate for the sake of clean maths, and we don’t know the exact supply after the first year as there are inflationary and deflationary forces at work.</p><figure></figure><p><strong>Conclusion</strong></p><p>While hard to define, the vision for web3 is something that is owned and controlled by the people. Everybody gets a share of the profits, everybody gets a say in the decision-making. Such an attractive ideal has unfortunately been noticed by opportunistic bad actors. But web3 is greater than any temporary setback. It is early days, but all indications point to Zenon as one of the only projects that is principled enough and disciplined enough to actualise the vision in a significant way. My invitation to all of you would be to do a deep dive on Zenon — links at the end.</p><p>Thanks for reading everybody!</p><p>– Zyler</p><p><strong>Challenge</strong></p><p>Think you’re Zenonized? Try your luck at this pop-quiz:</p><p>z) The greatest poets are Shakespeare, Edgar Allen Poe and ____?</p><p>m) Who do the ladies go crazy for out of our admin, chadmin or fatmin?</p><p>n) Which hair colour is the least attractive to women?</p><p>p) Where is a good place to onramp 100X engineering talent?</p><p>x) If a paper cube were dancing in the wind, would it be mesmerising?</p><p>g) Taproot block 709632 is to 694207 as semi-stellar radio sauce is to?</p><p><strong>Further Reading:</strong></p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2022-04-22T12:14:35.614Z",
	"ttr": 252,
	"type": "article"
  }