{
	"url": "https://medium.com/@Zyler9985/hello-this-is-zenon-9adbdb39ef6c",
	"title": "Hello, this is Zenon",
	"description": "The tech-savvy IT guy at your work, the girl who makes your coffee, your grandma in Romania — it seems everyone has dabbled in crypto at this point. First they try Bitcoin, the gateway drug. Then it’s a layer...",
	"links": [
	  "https://medium.com/@Zyler9985/hello-this-is-zenon-9adbdb39ef6c"
	],
	"image": "https://miro.medium.com/v2/resize:fit:1004/1*BajMv-S3MtBjjy8NW8KEbw.png",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----9adbdb39ef6c--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>The tech-savvy IT guy at your work, the girl who makes your coffee, your grandma in Romania — it seems everyone has dabbled in crypto at this point. First they try Bitcoin, the gateway drug. Then it’s a layer 1 as shiny as it is arbitrary. Before they know it, they’re trading their life savings for a bag of dog coins. But you don’t have to be a crypto veteran to have noticed that many layer 1 projects have recently enjoyed tremendous growth. Ethereum holders now drive a Lamborghini to work, Avax holders skip the traffic with a private helicopter, and Solana holders? Well, they’re drunk on a beach somewhere.</p><p>Throwing your hands up in despair, you may be wondering, what hope is there for those that missed the boat? To that I say: There is always hope. And in this case, hope begins with a Z.</p><p>Let me introduce you to Zenon. A layer 1 that is … unlike any other, to put it mildly. It’s a young project that not many are aware of, but its potential is mind-blowing. Its technology is unique, because unlike other projects which just put lipstick on a pig and try to sell it to you, Zenon is actually bold and innovative.</p><p>Let’s discuss the 6 reasons why you should consider researching this crypto further — links for further reading will be provided at the end. (Disclaimer: this article contains speculative elements and in no way constitutes financial advice).</p><p><strong>1. Zenon Won the Unizen Tournament</strong></p><p>In December 2021, Unizen (ZCX) ran a tournament of alts to decide which layer 1 had the strongest community support. The winner would receive Unizen and ZenX lab support for fast-tracking the incubation and listing of a project built on-top the winning platform. The Unizen CEX module (a world-first cedefi exchange launching Jan 14th 2022) will also include customised pairs for the winner (ZNN/ZCX). As it so happened, Zenon won the tournament, on its way beating Ethereum, Polkadot, Hedera and Alpeh Zero. On the website, you may notice that Unizen is advised by the CEO of Quant, Gilbert Verdian.</p><p>Unizen later announced a Supernode program, with Zenon being one of the four chosen projects. The other three were Constellation (the previous year’s winner for their tournament of alts), Kadena and Sifchain. Unizen will support these projects by running validator nodes and providing liquidity, a welcome early catalyst for ecosystem growth. Unizen is a big partnership for Zenon and for this to happen so early on is a promising sign.</p><p><strong>2. The Technology is Incredible</strong></p><p>Zenon uses its own special architecture which is entirely novel, veering far away from traditional Blockchains and DAGs. As fantastic as they are, they have serious disadvantages inherent to their design. These flaws make many projects totally unrealistic in their ambitions for mass-adoption. Hypothetically speaking, if during the peak of a Blockchain’s congestion you tried to send someone $20, and were hit with a $200 transaction fee and a 20 minute wait, how optimistic would you be for that project’s future? Okay, so you look at using a DAG. Wow! It scales so well, this speed is incredible even with mass-usage! Sure, but unfortunately a DAG ledger has an increased attack surface, and we live in a world where bad actors run amok in droves. And while very attractive, a block-lattice by itself has decentralisation trade-offs</p><p>Let’s briefly discuss Zenon’s novel architecture, followed by the practical (and stunning) implications of their innovative design.</p><p>Zenon entirely eschews a single ledger, rather opting for a 2-ledger system which it calls the Network of Momentum. To be more specific, it is a leaderless BFT dual-ledger system. It combines a generic DAG, called the meta-DAG, for the consensus layer with a block-lattice for storing the transactional data. Zenon (ZNN) and Quasar (QSR) are the two utility tokens which power the Network of Momentum.</p><p>Some of the incredible features of this innovative design:</p><p>– Fee-less transactions via the “plasma” mechanism (more on this below)</p><p>– Addresses the blockchain trilemma in a radically different way to other existing solutions with its dual-ledger (the thesis is that the block-lattice will grant ultra-scalability and blazing speed while the meta-DAG grants rock-solid security and stability)</p><p>– Offers a platform which unlocks new possibilities for apps (called zApps) that will benefit from Zenon’s general properties of scalability, security, fee-less</p><p>– Uses PoW + PoS</p><p>– Is interoperable with native Bitcoin, unlike most other layer 1s, allowing for smart contracts + Bitcoin ie. defi with BTC*</p><p>*(see next section)</p><p>Just in case you missed it, I’d like to reiterate one of the more incredible features of Zenon’s Network of Momentum: Fee-less transactions. The participant uses the syrius wallet to “fuse” a small amount of QSR, thus generating “plasma” for transaction throughput. More complex operations require more QSR fused, and note this QSR is not spent or burned, it is returned if you choose to un-fuse it. And in the case of a participant with no QSR, plasma can also be generated by proof of work, which takes more time but importantly is still fee-less. Why does this matter? Considering most apps built on layer 1s are generally defi, or at least have a defi element such as gamefi, zero transaction fees will improve profit margins and make the protocol more competitive than others which do require fees. It also makes it ready for mass-adoption with no fear of crazy fees the more people participate in the protocol. Millions of participants, zero fees? Yes please!</p><p><strong>3. Zenon’s Love Affair with Bitcoin</strong></p><p>On the 14th of November, 2021, Bitcoin was changed forever with the taproot upgrade activated at block 709 632. You may find some interesting ASCII coding art on this block. Some say if you squint really hard, you can just make out a Z and an N.</p><figure></figure><p>By virtue of the taproot upgrade, there are now new use-cases for Bitcoin that were never before possible. Some of these use cases are very exciting to a number of people, such as the potential to do defi with bitcoin. Unlike ETH, SOL, DOT etc. Zenon is promised to be interoperable with native Bitcoin via its Syrius wallet. It is still on its way, but the team have hit every milestone so far and when smart contracts + BTC arrives … there may be some fireworks.</p><p>The Network of Momentum will support a vast number of use cases with apps built on Zenon, called zApps, covering everything from defi, gamefi, internet of things, decentralised storage, decentralised exchanges, decentralised social networks, payment integrations, Web 3 solutions etc. There will be ZTS tokens built on-top of Zenon, analogous to erc-20 tokens built on-top of Ethereum. This is fantastic, but also limiting if you say this is all Zenon is working on.</p><p>As you can see below, their love affair with bitcoin continues. Zenon’s fee-less transactions, their non-custodial, open-source syrius wallet — all the elements are present. Zenon may be the chosen one. Zenon may fulfil the prophecy and realise Satoshi Nakamoto’s vision. Read the below post and tell me you don’t have chills.</p><figure></figure><p><strong>4. Zenon Has Decentralisation In its Bones</strong></p><p>Zenon massively distinguishes itself by being one of the few projects to be truly decentralised, unlike some coins which have a massive pre-mine. Being decentralised is important for the security and general robustness of the network, and also enables a more democratic environment as a centralised entity has concentrated power and power corrupts over time, compromising the integrity of the project.</p><p>Zenon was fairly launched via a mechanism known as Project X-stakes. After a post online, briefly outlining some details, an opportunity was presented. Participants sent 1 BTC in exchange for 5 000 ZNN, and as long as they ran a Zenon node over 2 years their Bitcoin was gradually returned to them, and returned in full (verifiable on-chain, it is a public ledger after all). Essentially by being loyal, committed and reliable, the participants were given 5 000 ZNN for free. (Note that this was legacy ZNN, not alphanet ZNN; see below).</p><p>While the team was developing the Network of Momentum, they realised they could further maximise decentralisation by selling it to people before it was ready. They created a simple PIVX fork and sold it as legacy ZNN, such that when the mainnet is ready the legacy ZNN can be swapped to alphanet ZNN at a 1:1 ratio. Note there is a decay mechanism for this swap; to penalise apathy, if the participant takes longer than 3 months, the 1:1 ratio gradually degrades such that the late participant will receive less alphanet ZNN and eventually none if they take longer than 1 year.</p><p>Awareness of the project has spread through word of mouth, through rumours, the occasional social media awareness campaigns, and of course seasoned gem hunters will have stumbled across it … but generally the advertising efforts have been close to zero. The team in their AMAs have always given guarded, level-headed responses, avoiding hyping anything. The result of this approach is that Zenon has kept a very low profile, being discovered more often by small investors than by whales, thus mitigating the tendency for big money to buy up a ridiculous majority of the supply.</p><p>Whilst decentralisation is extremely important for the longterm health of a project, it is often very hard to find in a project. Often times venture capital funds just want to dump on small investors, glad to take their money in exchange for the illusion of a vibrant ecosystem. This is why investors can’t only look at the partnerships, the team or the use-case — their tokenomics is of vital importance. When you realise how rare an actual fair launch is, it makes you wonder. It also makes you realise that Zenon is all the more special.</p><p><strong>5. Upcoming Milestones</strong></p><p>There are a lot of upcoming milestones that are very exciting for those involved with the project. Currently, the website presents a timeline which may be a tad confusing to new-comers. No hard dates are posted, just “coming soon”. (Don’t worry, their twitter posts give better time approximations, and so far they have hit every milestone). And on the website, the milestones are written in Zenonian, which is a term I just made up. It refers to their tendency to speak in a language consistent with their brand image. For example, rather than say “Strategic Partnerships” they say “Vested Pillars”. And instead of apps built on Zenon, they say “zApps”. It becomes endearing after a while, and in some cases it does make sense to call it a different name. To clarify why I say that, soon pillar holders are going to vote on which partners would bring the most value to our ecosystem. The winners will be granted their own pillars (a type of node) as a joining present to mark the start of the strategic partnership, and owning their own pillar also gives them a vested interest in the growth and prosperity of Zenon. Thus they went with “Vested Pillars” which not only makes sense, but the whole process is a sufficiently unique mechanism to warrant its own name.</p><p>But to keep things simple, I’ll avoid Zenonian while I list the upcoming milestones. NGL, shaking with excitement as I write some of these:</p><p>– listing on Unizen exchange and 2-way BSC bridge coming live</p><p>– the capacity to make and sell NFTs</p><p>– fulfilling the prophecy (peer to peer payments of electronic cash without a third party financial institution)</p><p>– smart contracts with Bitcoin (can you imagine how big this could be? If BTC has a market cap of over 1 trillion, what about the layer 1 which becomes the standard for defi with BTC?)</p><p>– apps built on Zenon and their ZTS tokens available for purchase</p><p>– strategic partnerships! They will be chosen and given pillars to run</p><p><strong>6. Intriguing Speculation</strong></p><p>There exists a special mystery with regards to Zenon’s origins. Any hobbyist detectives may have a lot of fun searching around online. Or maybe it is just a bunch of coincidences? But if OG Bitcoin money is backing it, that bodes well for its future success and adoption, to say the least.</p><p>Regardless of its origins though, the project devs have a stated aim of passing the torch to the community, and despite how early the project is, they have already demonstrated their sincerity for this goal (warpdrive awards which allowed anyone to propose an idea for a project, offering for the community to audit the code for the 2-way BSC bridge before it was activated, asking the community what to do with the treasure quest QSR etc.). In my opinion, this has all the fingerprints of hardcore Bitcoiner ethos which desire above all else one thing: Power to the people. Therefore, as intriguing as its beginnings may be, even more important is what it is becoming. It can be likened to an independent and autonomous super-organism which is always evolving, that adaptability being the key to its resilience and prosperity in the longterm.</p><p>To sum it up, Zenon is a layer 1 with red-hot potential. Its innovation is a requirement given its burning ambitions. And at its core, Zenon is fuelled by its community. It’s a blessing to discover it so early, (or at any time if you ask me!) so I’d encourage you to keep an eye on this one, happy researching!</p><figure></figure><p><strong>Further Reading</strong></p><p>To generally read more, I’d invite you to start with the below 4 links:</p><p><a href="https://zenon.network/" target="_blank">https://zenon.network/</a></p><p><a href="https://docs.zenon.wiki/home/" target="_blank">https://docs.zenon.wiki/home/</a></p><p><a target="_blank" href="https://shazzamazzash.medium.com/zenon-network-an-apes-guide-to-the-galaxy-7aad7dacdfef">https://shazzamazzash.medium.com/zenon-network-an-apes-guide-to-the-galaxy-7aad7dacdfef</a></p><p><a target="_blank" href="https://medium.com/@shaimo/the-zenon-enigma-782f8b293bd6">https://medium.com/@shaimo/the-zenon-enigma-782f8b293bd6</a></p><p>With regards to Zenon’s architecture, if you’re a technical person and would like to see these concepts fleshed out further, see the 3 links below:</p><p><a href="https://zenon.network/download/whitepaper.pdf" target="_blank">https://zenon.network/download/whitepaper.pdf</a></p><p><a href="https://hackernoon.com/how-not-to-fracture-a-layer-1-chain-qgi530g3" target="_blank">https://hackernoon.com/how-not-to-fracture-a-layer-1-chain-qgi530g3</a></p><p><a target="_blank" href="https://medium.com/@georgezgeorgez/a-message-to-humans-an-aliens-guide-to-lightning-network-watchtower-limitations-and-beyond-96138967fa9b">https://medium.com/@georgezgeorgez/a-message-to-humans-an-aliens-guide-to-lightning-network-watchtower-limitations-and-beyond-96138967fa9b</a></p><p><strong>Thank you for reading everybody, WAGMI!</strong></p><p>– Zyler.</p><p>Telegram ID: @zyler9985</p><p>Twitter ID: @zyler9985</p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2022-04-11T07:23:13.936Z",
	"ttr": 449,
	"type": "article"
  }