{
	"url": "https://medium.com/@Zyler9985/how-zenon-mirrors-the-bitcoin-ethos-142300e59e64",
	"title": "How Zenon Mirrors The Bitcoin Ethos",
	"description": "It’s said that history repeats itself. Let’s study and compare Bitcoin and Zenon across their inception, trust-less nature, culture, governance and innovation. Hold onto your seats, there may just be...",
	"links": [
	  "https://medium.com/@Zyler9985/how-zenon-mirrors-the-bitcoin-ethos-142300e59e64"
	],
	"image": "https://miro.medium.com/v2/resize:fit:616/1*Dwde04MJ5v7FTig5Q9G-Bw.png",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----142300e59e64--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>It’s said that history repeats itself. Let’s study and compare Bitcoin and Zenon across their inception, trust-less nature, culture, governance and innovation. Hold onto your seats, there may just be fireworks at the end.</p><p>Disclaimer: This article is not financial advice and may contain speculation.</p><figure></figure><h2 id="aad5">Inception</h2><p>Bitcoin’s origins are steeped in mystery. In 2008, a person or persons of unknown identity, going by the pseudonym Satoshi Nakamoto, leveraged existing ideas within the cryptography space to create something entirely new. A digital currency which allowed for peer to peer transactions without the need to go through a third-party financial institution. It had no VC backing and no paid marketing. On its merits alone, it garnered a small and passionate following. Over time its use, awareness and adoption grew despite encountering strong opposition. FUD which should have killed it, only made it stronger. “They” have called BTC a joke, ponzi, for criminals, banned it … and where are we now? In 2022 those same people/VCs/banks are taking Bitcoin seriously and extolling its virtues. But despite their sudden interest, <strong>Bitcoin is still owned by the people</strong>. The societal implications are being discussed. When it’s all said and done, the journey from magical internet beans to the reserve currency of the world is gonna be quite a story.</p><p>Who created Bitcoin? Well, perhaps the biggest FUD that Bitcoin ever endured was the day Craig Wright claimed to be Satoshi. Crypto veterans shuddered like a cold wind had just chilled them to the bone. Retail panic-sold. The banks stopped suppressing it, happy to take a week off and let the Aussie conman do some damage. Craig Wright has since been locked away in a mental institution, in a safe place where the world is sheltered from his pathological lying. The real answer to the question is who continues Bitcoin? With contributors and users all over the world: <strong>We are all Satoshi.</strong></p><p>Zenon’s origins are also enigmatic. An unknown person or persons going by the pseudonym Professor Z announced a new draft whitepaper. It examined the weaknesses of existing DLTs and proposed a novel architecture which leveraged a 2-ledger system: A block-lattice + meta DAG called the Network of Momentum. A new layer-1 seeking to solve the blockchain trilemma and enable fee-less apps and defi with Bitcoin. It had no VC backing or pre-sale or pre-mine. 80% of the coins were initially distributed via a unique mechanism where investors sent BTC to an address and were given a ZNN node in return. As long as they ran the node reliably, their BTC was returned in full. Since then it has been grassroots marketing to spread awareness by word of mouth and community-ran social media campaigns. This has allowed the coins to be distributed widely before the big money arrives, maximising decentralisation. Instead of owned by VCs, <strong>Zenon is owned by the people</strong>. Ominously, if we follow the same trajectory we may also encounter larger FUD the bigger we get — until we’re so big we can’t be ignored anymore. Arthur Schopenhauer once wrote: “All truth passes through three stages. First, it is ridiculed. Second, it is violently opposed. Third, it is accepted as being self-evident.”</p><p>Who created Zenon? As in the case of Craig Wright, I’d be similarly skeptical of anyone who came forward claiming to be Professor Z. It is early days, but with the same vision of being a fully open-source ecosystem where anyone can contribute, we may soon be able to say: <strong>We are all Professor Z.</strong></p><h2 id="dfdb">Trustless Nature</h2><p>The code for Bitcoin is <strong>fully open-source</strong> — anyone can view and contribute. There is also no need to trust anyone, as the transactions in the network are <strong>fully verifiable</strong> for anyone running their own node.</p><p>Zenon has a stated aim of replicating this ethos of: “Don’t trust, verify.” In late November 2021 the first version of the SYRIUS wallet was released. There was no visible code, and running a node required a bit of computer know-how. Just a few months later in late April 2022, the fifth version of the SYRIUS wallet was released. It is fully open-source and has the node embedded within the wallet, making it as simple as clicking a button (admittedly, my Zenonized grandma may still need help with this). Now anyone can run their own node to make the network <strong>fully verifiable</strong>. It is still early days for Zenon, but so far they have consistently hit every milestone. Currently a grant program is running which allows anyone to submit a project proposal to build on Zenon and receive funding from the DAO. ZIPs (Zenon improvement proposals) may be closer than we think. Only a matter of time until they reach their stated goal of making the <strong>entire project open-source</strong>.</p><figure></figure><h2 id="e7f0">Culture</h2><p>Bitcoin culture has its light-hearted side. In May 22nd 2010, someone exchanged 10 000 bitcoins to pay for a pizza. At today’s prices, that’s about 400 million dollars for a late late-night snack. #BitcoinPizzaDay was born.</p><p>🚨🚨🚨🚨🚨 A whale has just moved 10 000 BTC from an unknown wallet to Domino’s Pizza!</p><p>It’s something <strong>Zenon chose to commemorate</strong>:</p><figure></figure><p>A huge milestone for Bitcoin was the taproot upgrade in Nov 14th, 2021. The improved security, privacy and programability was hotly anticipated in the crypto community at large. New use-cases are now possible, including and especially smart contracts on Bitcoin. The Zenon team took BTC donated from the community to leave a special message in ASCII art on block 709 632. One of Zenon’s only two likes is also for one of the chief architects behind Taproot, Pieter Wuille. It seems <strong>taproot is integral to Zenon’s plans</strong>.</p><figure></figure><figure></figure><p>Another part of Bitcoin culture is <strong>following @halfin</strong>. Hal Finney was the first person to tweet about Bitcoin, and the first recipient of a Bitcoin transaction from Satoshi Nakamoto. Tragically, Halfin was diagnosed with ALS, a fatal disease of the motor neurons which leads to gradual paralysis. But even in the late stages of the disease, when he was bound to a wheel-chair and on life support, he used an interface for his eyes which allowed him to continue working on Bitcoin. His strength and poise all the way to the end is the stuff of legend and makes him a hero in Bitcoin culture.</p><figure></figure><figure></figure><h2 id="57c9">Governance</h2><p>Bitcoin is governed by proof of work, so your stake is scaled by your computing power. The sh*tcoins/VC scamcoins are all proof of stake (pos = proof of sh*tcoin). And if the large centralised entity just sits on a majority of the coins, you can see how it’s a de facto corrupt, brittle dictatorship. <strong>Like Bitcoin, Zenon aims for a fair voting system</strong> — utilising both PoW and PoS. Let me explain.</p><p>The pillars vote on decisions (a pillar is a type of node). Running this node requires locking up an amount of ZNN and burning an amount of QSR. By burning the QSR, they are burning away a large amount of money; this is a filter to deter entities who are solely profit-motivated (even though they will still make a great ROI in the longterm). It’s a way to incentivise pillars to vote for things which will add value to the ecosystem, ie. to ensure they have skin in the game since they have spent QSR they can’t get back.</p><p>Where it gets interesting is that users can delegate their ZNN to pillars who are voting in a way that represents their interests. This way, normal users of the NoM can make their voices heard. And pillars have an incentive to try and maximise their delegation, as if they reach the top 30 pillars by delegation weight they are rewarded with momentums twice as often which means a better ROI for them. At this stage it’s looking like pillars will think for themselves, consider community sentiment and then vote/abstain. The community can then react to how they voted. For example, a positive reaction from a delegator would be for them to shift their weight to pillar(s) who have consistently made agreeable choices. The history being on-chain, this will be verifiable and factor into the relationship pillars build with their community members. <strong>Long-live the Zenocracy! Embrace the Superorganism! Get Zenonized!</strong></p><p>“Zyler? Is that you? Can you please stop shouting at your computer?”</p><p>“Sorry mum, I was in the basement and I didn’t think anyone would hear.”</p><h2 id="8194">Innovation</h2><p>Bitcoin revolutionised … hmm, that’s actually a tough thing to explain in one paragraph, given the far-reaching consequences that will one day be studied and marvelled over in the next century. Consider that beyond the scope of this article. We can all agree though, that <strong>Bitcoin was revolutionary.</strong> Zenon aims to solve the blockchain trilemma, introduce a fee-less paradigm and become the global standard for Apps, NFTs and especially defi with BTC. In the same way, <strong>Zenon aims to be revolutionary.</strong></p><p>How will it achieve these lofty goals? It’s an unbelievable privilege to have a front-row seat to history as it unfolds. Currently an open initiative called “<strong>Hyperspace</strong>” is running from 21/4/2022 to 30/7/2022. It’s 100 days of development where the goal is broadly a cross-chain compatible network:</p><ul><li>cross-chain bridges (with other layer-1 or layer-2 networks)</li><li>atomic swaps and related technologies (HTLCs)**</li><li>other interoperability solutions</li><li>SDK ports for multiple programming languages (Javascript/Typescript, Rust, Go, Java/Kotlin, C/C++, Python, Swift, C#)</li></ul><p>And while speculative for now, a major way <strong>Zenon could improve the LN</strong>: The lightning network makes Bitcoin really cheap and fast … but why not free and fast? And why should we trust the watchtowers to ensure there is no fraud and double-spending — who is watching the watchtowers?</p><ul><li>Zenon could make these transactions free (with its own anti-spam solution). According to team member “Mr Kaine” who communicates with the community mostly via the official Zenon telegram chat: “You need to compute a proof of work link in order to generate Plasma required by transactions on the NoM (Network of Momentum). It may be possible to use PoW links to merge mine Bitcoin; the other way around is to merge-mine ZNN and create plasma for <strong>fee-less Bitcoin transactions</strong>.”</li><li>Trusting the watchtowers in the LN seems a centralised solution. Antithetical to BTC ethos. Perhaps a decentralised network could help with this problem, to provide 24/7 trust-less supervision? Perhaps that solution is Zenon. Below is an article exploring this shortcoming of the LN</li></ul><p>** Note that ‘other interoperability solutions’ are being explored, but if HTLC was used, it would be state-of-the-art according to Mr Kaine. There is a significant difference between using a centralised vs decentralised layer-1 to wrap your Bitcoin. Community sentiment is that the team is going to either achieve interoperability with native Bitcoin or they will get it as close as you can get — either way, many are taking a keen interest in proceedings.</p><p>And <strong>for the builders out there</strong> — currently a program called “<strong>Accelerator Z</strong>” is running. Anyone willing and able to add value to the ecosystem can submit a proposal for funding their contribution. Imagine being in the first wave of #ZNNAliens to get a funding grant from the DAO of DAOs! All devs come aboard, because this ship is taking off soon!</p><h2 id="5b68">Final Thoughts</h2><p>You want to hear something ironic? Most ZNNAliens were initially unaware of their heritage. As the legend goes, one particular ZNNAlien was traipsing along. Not a care in the world, just ape-ing into dog coins, flipping overpriced jpegs and slapping people in the crude, early metaverse. It wasn’t until one day, they heard the sound of running water. Coming closer to it, they found a grand fountain spouting from two sources. Peering over the edge, it was hard to see their reflection, distorted from all the ripples … this was phase 0 of their adventure after all. But then the water flow stopped — phase 1 had arrived. Looking again, in the perfect stillness they saw themselves more clearly than ever before …</p><h2 id="5370">Thanks for reading!</h2><p>– Zyler</p><h2 id="e264">Join The Community</h2><p><a href="https://zenon.network/" target="_blank">Zenon.Network<br /></a><a href="https://twitter.com/Zenon_Network" target="_blank">Twitter/X<br /></a><a href="https://t.me/zenonnetwork" target="_blank">Telegram</a> <br /><a href="https://discord.com/invite/zenonnetwork" target="_blank">Discord</a><br /><strong>Zenon Community Public Key:<br /></strong>npub1msvlamqj6j5azykts7sewtzr062a0km0p4hajw2dmchtm5xpz0aqylw09w</p><h2 id="a70b">The Zyler Reading List</h2><ol><li><a href="https://twitter.com/zyler9985/status/1735373467577663905" target="_blank"><strong>The Zenon Storybook</strong></a> (updated version coming soon)</li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-iii-game-theory-for-progressive-decentralisation-38f94457b03e"><strong>Progressive Decentralisation</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-a-blistering-need-for-speed-ce34246c2f01"><strong>A Blistering Need For Speed</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-viii-alien-plans-for-bitcoin-804e1ba60a3c"><strong>Alien Plans For Bitcoin</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/why-zenon-is-regulation-proof-b696c3a03d0d"><strong>Why Zenon Is Regulation-Proof</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenons-synergy-with-nostr-c36fe2bf955c"><strong>Zenon’s Synergy With Nostr</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-merged-mining-bitcoin-fb7ccf60161e"><strong>Merged Mining Bitcoin</strong></a><strong> </strong>(updated version coming soon)</li><li><a target="_blank" href="https://medium.com/@Zyler9985/how-zenon-mirrors-the-bitcoin-ethos-142300e59e64"><strong>How Zenon Mirrors The Bitcoin Ethos</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/the-zenon-ethos-4e0ab0dff12b"><strong>The Zenon Ethos</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-a-noir-story-a06cc8945439"><strong>Zenon Network: A Noir Story</strong></a></li><li><a href="https://www.slideshare.net/zylert888/the-dream-of-satoshis-ethereumpdf" target="_blank"><strong>The Dream of Satoshi’s Ethereum</strong></a></li><li>Zenostroin (Coming 2024)</li></ol></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2023-12-24T11:31:47.423Z",
	"ttr": 401,
	"type": "article"
  }