{
	"url": "https://medium.com/@Zyler9985/the-power-of-nfts-on-zenon-c1c777c76106",
	"title": "The Power of NFTs on Zenon",
	"description": "To understand the benefits of NFTs on Zenon, you need to first understand a couple of things about NFTs at a technical level. Only then can you fully appreciate the innovations that Zenon brings to the space....",
	"links": [
	  "https://medium.com/@Zyler9985/the-power-of-nfts-on-zenon-c1c777c76106"
	],
	"image": "https://miro.medium.com/v2/resize:fit:1200/0*gPRFBx-cGHX4rFYz.jpg",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----c1c777c76106--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>To understand the benefits of NFTs on Zenon, you need to first understand a couple of things about NFTs at a technical level. Only then can you fully appreciate the innovations that Zenon brings to the space. This article covers:</p><ul><li>What is an NFT for practical purposes</li><li>What is an NFT technically</li><li>3 problems with NFTs, and how Zenon solves them</li></ul><p>Disclaimer: This article is not financial advice and may contain speculation.</p><figure><figcaption>Buy this NFT on Zenon to unlock the hidden truth about his claims. Starting price: 10 LUNA</figcaption></figure><h2 id="1253">What is an NFT for practical purposes?</h2><p>An NFT is a token on the blockchain which is unique and can be used to represent the ownership of the digital file it represents. Being on the blockchain, you can transact with this NFT and therefore change its ownership. The digital file may be art, music, trading cards, land in the metaverse or weapons in a video game.</p><p>As blockchain technology enjoys greater adoption, we may see NFTs being linked to items in the real world. For example, luxury watches could be made with a micro imperfection. You scan the imperfection and mint it as an NFT. Now in the collectibles market, if you’re about to buy a watch you can scan it and refer to the tamper-proof blockchain to determine if it is a genuine watch or a fake replica.</p><h2 id="7014">What is an NFT technically?</h2><p>An NFT can be thought of as having 4 components:</p><p>(1) <strong>The data on the blockchain</strong>. This contains the ownership and transaction history. This can be updated, but any data recorded is as permanent as the chosen blockchain and can’t be tampered with, and also points to where the metadata is stored.</p><p>(2) <strong>The metadata</strong>. Not usually stored on the blockchain. This tells you the NFT’s name, description and points to where the digital file itself is stored.</p><p>(3) <strong>The digital file</strong>. Not usually stored on the blockchain. This is the actual piece of art or music that you can look at or listen to. In the future, this may be a real-world asset or item. For example, the metadata will describe the address for a house.</p><p>(4) <strong>The key stored in your wallet</strong>. This is what you transact with. If someone buys your NFT, the key is transferred into their wallet. The data on the blockchain (1) will update to include this latest transaction and they will be the new owner of the NFT. (2) and (3) don’t change.</p><p>So basically <strong>1</strong> points to <strong>2</strong> points to <strong>3</strong>; and <strong>4</strong> is what is actually in your wallet.</p><h2 id="eec3">Problem #1: Which blockchain to use?</h2><p>When it comes to most NFTs and most people, they want it to last as long as possible. They want it to be like a collectible that can be passed down generations. However, the data on the blockchain <strong>will only last as long as the blockchain lasts</strong>. This is bad news for people who have minted NFTs on blockchains that are centralised garbage like ETH or SOL. Centralised blockchains have a limited lifespan, and building on top of them is like building on a foundation of quicksand. Furthermore, with increasing usage the fees will also increase to become a serious issue, such as what is happening with the Ethereum blockchain.</p><p>Zenon Network is a <strong>truly decentralised</strong> layer 1, and it is expected to enjoy the longevity and security that goes along with achieving this. Good news for those who want their NFTs to last for generations. It is also a <strong>feeless platform </strong>— your computer can do a proof of work calculation or you can utilise an innovative mechanism involving the second coin QSR which does not spend it. See the article below for more about Zenon’s decentralisation:</p><h2 id="8b0b">Problem #2: Where to store the metadata &amp; file?</h2><p>Again, we want both the metadata and the digital file to be stored in a location that guarantees security and longevity. Ideally people want something as close as possible to <strong>permanence</strong>. Is this possible? Technically, <strong>no </strong>(not even talking about the possible heat death of the universe).</p><p>It comes down to this. No matter what you try, <strong>there does not exist a free hard drive with infinite storage</strong>. Someone, somewhere, has to physically host it; and they need an incentive. So you need a system for storage with sound economics, then you also need to consider security and longevity. Let’s talk about a couple of solutions Ethereum and Solana are currently trying.</p><p>Storing the file using <strong>HTTP URL</strong>. This is not a blockchain. Issue is, what if the server goes down or the data is deleted? The NFT will be worthless if the site returns a 404 error, page not found. HTTP is centralised and a point of failure as a person or entity has total control over it.</p><p>Protocol labs created both <strong>IPFS</strong> and <strong>Filecoin</strong>. Storing the file using <strong>IPFS</strong> (interplanetary file system). This is not a blockchain, or a cloud storage system, it is a peer-to-peer network. Admittedly, it does echo the distributed and trustless nature of a blockchain. Issue is, while the ID of your upload is as permanent as IPFS, this is not the case for the actual file. You’re relying on one or more nodes to host it, and they may not over time. Once a node reaches max storage, the garbage collector deletes anything not pinned. So you can pay a service to pin it, but then you’re relying on the pinning service — a point of failure. <strong>Filecoin</strong> is a blockchain built on IPFS, it is the incentive layer for IPFS. It allows for a marketplace for contracts where an amount is paid for the file to be stored for a period of time. Issue is, what happens once that time is elapsed? Back to square one … or you use an auto-renewal service, but now you’re relying on that service. What if the cost goes up significantly? Or what if Filecoin collapses — did they even launch with xStakes and have grassroots marketing? Their tokenomics seem rather centralised if you look into it.</p><p>Storing the file using <strong>Arweave</strong>. This is a blockchain solution where the nodes are incentivised to hold the data for longer than 200 years (they claim), which we can agree is very longterm. There is a one-time payment in AR, the native token to the Arweave blockchain, to keep the nodes happy. How much is that payment? They “factor in price appreciation of AR along with the decreasing cost of storage over time.” Issue is, how can we be sure the payment is appropriate? Relying on price appreciation of AR, that sounds like a ponzi scheme which is fundamentally unsound. Furthermore, at the time of writing its price has collapsed 90% from its all time high 6 months ago … yet they’re talking about a 200 year plan? Let’s not jump the gun. So if you can’t rely on holding AR, they’re selling it the second they receive it? And while the cost of storage is likely to decrease over time, nobody knows what that rate of change is as nobody has a crystal ball that can read the future.</p><p>The reality is that permanence of data storage is impossible to reach, it is rather <strong>an ideal to strive for</strong>. So what we have is a litany of longterm data storage solutions. Which is the best one? If you need something decentralised, secure with sound economics — sounds like Zenon Network? A stated goal of Accelerator-Z is “decentralized storage”. There may be a<strong> </strong>zApp on its way solving for this, and remember that all of the apps built on the NoM <strong>inherit its strength</strong>. In saying that, there could be significant cost and infrastructure hurdles to storing the actual file on chain.</p><h2 id="a3ba">Problem #3: Can’t people just take a screenshot?</h2><p>For a 2-dimensional image with no hidden content inside, someone could take a screen-shot and have a pixel-perfect replica. What’s missing is that this screenshot doesn’t have the same <strong>history attached to it</strong>, for example if the artist has a following and they live-streamed making it and there’s a memory and significance attached to the whole event. With regards to its history, some people understand and value this, some don’t understand this, and others do understand it but don’t value it. It’s a free market, you can buy and sell what you choose to. The knowledge that it is genuine is important to someone with the collector’s mindset, and there is a huge market around luxury items which exists. Aside from the history, there’s also the possibility that a screenshot is <strong>missing hidden content</strong> within the NFT; see the official Zenon article below on the new NFT standard.</p><p>Within the article, it discusses the history of steganography with examples of people conveying messages not obvious to anyone who might be watching. They take this further by suggesting NFTs could contain hidden content, unlockable only if you are the owner of the NFT, ie. if you hold the key. As an example, what if the Bitcoin logo contained the signature of Satoshi Nakamoto inside. This would create extreme buying demand — it’s no longer enough to just take a screenshot and have a pixel-perfect replica. Screenshots are also more difficult if it is in fact a 3-D hologram you can rotate and interact with, and of course a weapon in a video game can’t be screen-shotted.</p><p>So, if someone holding the key allows them to experience additional content — is the key interacting with the file? Does that mean the file is stored on the blockchain, therefore the cryptographic key can interact with it and reveal what is hidden? Probably not due to cost/infrastructure constraints. Possibly a zApp is on its way to both solve for decentralised storage generally and allow for NFTs to be elevated to a new standard involving steganography, but this is just speculation.</p><p>With the huge future ahead of NFTs, definitely keep an eye out for Zenon’s NFT marketplace which may arrive sometime this year in late 2022, likely called Milky Way or something to that effect. Long-lasting, feeless and filled with hidden/premium content — expect a wave of excitement when this long anticipated milestone arrives.</p><h2 id="9910">Further Reading</h2><ul><li><strong>A concise overview of Zenon</strong> (for a brief summary of Zenon that also includes helpful links to learn more and get involved in the ecosystem)</li><li><strong>An ape’s guide to the galaxy redux</strong> (the mother of all articles; this is perfect reading for those wishing to do a deeper dive on the project)</li><li><strong>Zenon.Network, their official website</strong> (definitely check out the links to their official twitter, discord and telegram as well)</li></ul><p><strong>Take care and WAGMI!</strong></p><p>– Zyler</p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2022-06-12T17:42:01.758Z",
	"ttr": 350,
	"type": "article"
  }
  