{
  "url": "https://medium.com/@Zyler9985/why-zenon-is-going-to-zero-1fc2453c3e2a",
  "title": "Why Zenon Is Going To Zero",
  "description": "Bitcoin’s early days were fraught with struggle.It was declared dead many times.How is Zenon going today? People can say things, but if you want to know what they really believe, look at what they do with...",
  "links": [
    "https://medium.com/@Zyler9985/why-zenon-is-going-to-zero-1fc2453c3e2a"
  ],
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*RkTokCJyd5muYWa0n01VgQ.png",
  "content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----1fc2453c3e2a--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>Bitcoin’s early days were fraught with struggle.</p><p>It was declared dead many times.</p><p>How is Zenon going today? People can say things, but if you want to know what they really believe, look at what they do with their capital. You can scream all you want about a project’s fair market value, but that won’t pay the bills and ultimately the market is never wrong.</p><p>In mid-2019, ZNN was $1.50 and Bitcoin was $8000</p><p><em>POV: You jump in a time-machine and emerge five years later.</em></p><p>In mid-2024, ZNN is $1 and Bitcoin is $70 000</p><p>The dollar value of ZNN has decreased by 30% (more if you factor in inflation of the USD) and <strong>its Satoshi value has decreased by 90%</strong> (its value relative to Bitcoin). And while harder to quantify, it is obvious to see that instead of a vibrant, growing community we have something despondent and shrinking. All during a bullrun with BlackRock buying.</p><p>It’s time to put down the cope joose and take off the green-tinted glasses. Something is clearly wrong, so admit it:</p><blockquote><p>Zenon is dead.</p></blockquote><p>Welcome to Zenon’s first obituary.</p><p>A discussion of the network’s chronic problems and systemic dysfunction, along with a few possible solutions.</p><p>Disclaimer: This article is not financial advice and may contain speculation</p><figure></figure><h2 id="ecdf">Problem #1: the community thinks someone is coming to save them</h2><p>As discussed in an earlier article, the demographic for Zenon’s early adopters is not devs or cypherpunks or contributors, but <strong>speculators</strong>. Speculators aren’t inherently bad, but schizzo speculators are problematic.</p><p>Briefly, there’s a conspiracy Vitalik is rebooting a version of Ethereum which actually can scale, is decentralised and will bring smart contracts to Bitcoin. See below his hints about Zenon:</p><figure></figure><p>If Bitcoin reaches a 10T market cap, Satoshi’s Ethereum should probably reach a 1T market cap right? So for early investors, this presents an interesting dilemma: Do you help your investment grow? Or do you stay quiet and accumulate more coins?</p><p>If you believe the Vitalik hires are still here, have got this under control and will single-handedly ensure the project’s success — then the correct strategy is to do nothing. Keep your mouth shut about Zenon, enjoy the cheap period while it lasts and keep accumulating until the inevitable 1000X.</p><p>The truth is nobody is going to pay you as much as what you can just buy yourself. Why try to grow the network and pump the price, if all you manage to do is price yourself out of ever owning a pillar? Nobody, under any circumstances, is going to support paying you 50k ZNN from the AZ fund. It’s a dogfight to get even 5k ZNN (more on this later). Yet right now you can buy yourself 50k ZNN for 50k USD without requiring anyone’s permission, all you have to do is keep quietly stacking zats.</p><p><strong>But are the Vitalik hires coming to save you?</strong></p><p>First of all, the idea that a secret group of devs are going to single-handedly moon Zenon to 100B goes against Zenon’s very ethos as a community project. Apparently a small team can build something huge and world-class with a small treasury worth only 800k USD? That reeks of a centralised entity covertly owning and controlling Zenon, because how did Zenon find and hire the best devs with no marketing and a treasury worth nothing?</p><p>That scenario will make people re-examine xStakes, and wonder who would chuck in their Bitcoin based on a 1-pager of info, which is all they had available at the time. Either wealthy (and therefore reckless) speculators or insiders who enjoyed extreme information asymmetry. Due to the obscene cost of a pillar (more on this later), the majority of pillars to this day are traced back to the lucky participants of 2019's xStakes.</p><p>Serious researchers and analysts will conclude Zenon is likely centralised and therefore not a safe protocol to use as a Bitcoin layer-2. That 1T market cap you were hoping for? Now it never happens. Decentralisation at every level has always been Zenon’s real unique selling point. So if you believe you can keep quietly accumulating because the Vitalik hires will deliver everything on a silver platter — Zenon might 10X, but it will never 1000X because a centralised protocol will never become a dominant BTC L2.</p><p>The founders of Zenon know this. OG Bitcoiners tend to be a hardcore bunch. Sleeping with orange underpants on, reading sermons from the Bitcoin whitepaper every night … out of principle, they are the last people on Earth who would commit their time, skills, energy and life to a centralised project.</p><p>But what about the devs who have been building stuff already? Aren’t they obviously Vitalik hires saving us? I’ll refute this later in the article.</p><p>The only logical conclusion: <strong>We need to build the network ourselves</strong>, which means we need to grow from what we currently are. We need to make it appealing enough that rational actors will join. We need a more valuable treasury and a larger community. Therefore:</p><p><strong>The current situation of the AZ fund paying zero for Hypergrowth is unacceptable</strong>.</p><p>You cannot rely <strong><em>only</em></strong> on altruistic, masochistic contributors — you may go a few steps forwards, but you won’t get far enough. And even if you do get far enough (you won’t) — it will take too long and either fiat will win or a rival BTC L2 will win. Either way, that means Zenon fails. So the entire culture, precedence and organisation of AZ for Hypergrowth needs to change.</p><p>So why have the schizzo at all? You could say it was useful in bootstrapping the community until it got out of hand. Bitcoin had no competitors, while Zenon has thousands of them, so a little steganography is a useful defence against a de facto sybil attack. But people have misinterpreted its purpose — it is not a wink to let you know who is coming to save you. It’s to get you thinking about what was possible.</p><p>When you realise Zenon truly does mirror Bitcoin’s ethos, that kind of vision should inspire you. We should be able to convey that vision in a way that inspires other people too, to help onboard them to the cause. Zenon’s tech has no fundamental flaw in its design; while it remains unbuilt, it at least *can* be built, unlike a blockchain with the wrong tech foundation. Zenon is a decentralised playground, and that should attract cypherpunks who share our values. Zenon’s vision is especially important while the price is low, as it inspires people to work for Zenon despite the opportunity cost.</p><p>So how do we grow Zenon?</p><h2 id="1e14">Problem #2: the community is paying zero for hypergrowth</h2><p>There are two ways to pay for Hypergrowth: via AZ or via donations.</p><p>Using donations to supplement AZ seems legitimate, but it’s problematic when you examine it. Are you helping the contributor? That depends on the context of the donation. If it happens in the current environment, you are actually just enabling the dysfunction of the network by kicking the can further down the road. You’re delaying the discussion which needs to happen to fix the DAO, and fix it soon as in life there’s only ever a window of opportunity for things, and if you miss it it’s gone.</p><p>If you think of the network as the queen ant, who constantly mints honey out of thin air, the worker ants should be constantly working and in return provided honey by the queen. That is how the ant colony remains functional. If that’s not happening, her colony is dysfunctional, and why are you bullish on a dysfunctional honey antwork? Network? I’m lost in this bizarre analogy tangent, but you get my point.</p><p>Hypergrowth needs to be paid for via AZ. So how do we approach assessing this type of work — quantitatively or qualitatively?</p><p><strong>I disagree with advocates for a purely quantitative approach because:</strong></p><ul><li><strong>Growth is not a linear process</strong>. It’s more like barely any growth, then sudden surge, correction, then back to a slow uptrend. You can see this with a Youtuber growing their following, with a coin growing their holders … initially it’s always slow for a long time. So if we only pay based on numbers for the slow portion of the graph, they are paid virtually nothing for 2 years? Even though they could be responsible for onboarding amazing devs and based community members? If you don’t incentivise the slow growth, you miss out on the explosive growth too.</li><li><strong>Numbers cannot measure many things, such as brand power</strong>. Some content onboards new people; other content does not onboard anyone new, but it deepens their understanding and conviction in the project. This leads to more capital allocation, as well as more time &amp; energy &amp; skills dedicated to the project — but what number can measure that?</li><li><strong>It clashes with Zenon’s ethos</strong>. Tracking software violates people’s right to privacy and raises security concerns too. It also relies on deception, where you don’t tell people they can generate their own affiliate links to give themselves a 3% bridging bonus rather than a 1% bonus. So we’re deceiving people, infringing on their privacy and using tracking code?</li><li><strong>The system is gamed easily</strong>. People can leave Zenon via a CEX, avoiding paying the 3% exit tax to the bridge and affiliate marketers are funded via that exit tax. Affiliate marketers also earn nothing from people who buy wZNN without bridging, and that’s the majority of buyers.</li></ul><p><strong>I advocate for a mostly qualitative approach for paying Hypergrowth.</strong></p><p>If a Hypergrowth team can present a plan which makes sense, they should be paid partly for the process, partly for results. If they are doing good work where the process is of an excellent calibre, that deserves pay which is outcome-independent. They should also have bonus pay which is results-dependent. Examples of said work:</p><p><strong>Qualitative success regarding the process</strong>: The community *<strong>agrees*</strong> that Hypergrowth members are making a sustained, consistent multi-month or multi-year effort to raid comments and posts on Twitter (organised via a chat-lock bot in tg), they are joining other community’s Twitter spaces to represent Zenon, they are making high quality and varied content (articles, infographics, AI art, memes and more). Content is being given to paid influencers to help distribute it. And they have a presence across Twitter, Reddit and Youtube and on biz threads. A NOSTR presence is also recommended, as it’s filled with cypherpunks who share our values.</p><p><strong>Qualitative success regarding the results</strong>: The community *<strong>agrees</strong>* they are noticing more buying spikes, more newbies asking questions in Telegram, new people appearing in Discord and on the Forums. More activity and engagement on the Twitter timeline. More holders onchain, more builders applying to AZ, more active community members — and ultimately a higher ZNN price.</p><p>Some quantitative measurements can be used to help support the assessment of results, but a hybrid of qualitative and quantitative is ideal.</p><p>If you only pay based on results, you cannot incentivise the early growth period properly because even if the Hypergrowth team is doing<em> a perfect job, </em>the results *<strong>will</strong>* be slow for a long time. But the slow period is a pre-requisite to reach critical mass and have catalyst events.</p><p>As for how much to pay Hypergrowth? Just like we have altruistic, masochistic devs, we also have passionate cultists as candidates for Hypergrowth. You could compromise on how much to pay them, because the fact the DAO is allocating you capital is a sign of appreciation which is motivating, combined with believing in Zenon’s vision which is also motivating.</p><p>But the problem is cultists alone can’t take us far enough or fast enough. So even if there is debate and tactful negotiation around their pay, it can’t just be what the cultists are willing to accept, because that also sets a precedent for future contributors. That can be off-putting for future hires — or enticing. The DAO seems to only pay handsomely for coding, but Hypergrowth *is* coding when it onboards new devs either directly, or indirectly because a pumped price allows the community to hire new devs.</p><p>But Hypergrowth isn’t the only issue with the fund.</p><h2 id="f9ae">Problem 3: the az fund is being mismanaged for devs too</h2><p>There’s a few interlinked issues to sort through.</p><p><strong>The community has few technical people and can’t assess dev work.</strong></p><p>Someone was paid 70k USD for something relatively simple. This is like paying someone 1k/week for being a telegram admin — a regrettable waste of funds. That was not an isolated case either; the fund has been swindled multiple times and will remain vulnerable if no changes are made.</p><p>The community is apparently an expert at assessing Hypergrowth work in all its forms, so we won’t get into that. But the community needs to hire a set of impartial devs to help assess the dev work being delivered to Zenon. Have them explain what is actually being delivered, how much skill and effort it takes, what a reasonable asking amount would be — that way Pillars can negotiate on the asking amount, or if needed decline them and look for a cheaper alternative who will do it for a reasonable amount.</p><p>Regarding the 70k debacle, it was baffling the community devs didn’t protest loudly against this — perhaps they were glad to see a precedent of generous payment? Or perhaps a sense of idealism prevents strong interference? Due to the mind games, we need to either hire impartial judges or pay an existing dev(s) who has built a reputation of trust.</p><p><strong>People trust the devs way too much, assume everyone is a Vitalik hire and do not demand standards for professional conduct</strong></p><p>Firstly, all code delivered should be reviewed and audited by an external source, otherwise you are telling people new to Zenon <em>hey trust me bro, it’s safu</em>. This is antithetical to the don’t trust, verify ethos. And if we can’t afford an external source at the moment, then the community devs reviewing it should be compensated for their time.</p><p>Secondly, there is a misconception that some people are here to save us and moon us to 100B single-handedly. Let’s get specific:</p><ul><li>Alienc0der. Great dev with a good work ethic, but his ideas around fees and merged mining are controversial and have sparked unresolved arguments. He’s probably not Mr Kaine.</li><li>Sumamu. Mr Kaine said he was impressed with his coding skills. But the amount he took from the AZ fund back in the day was controversial. He’s likely not Mr Kaine.</li><li>George. He said he’s working on some things which I’m sure will be very helpful for Zenon. But he runs the Ignition pillar which votes often, opposed to staying intentionally uninvolved. He’s probably not Kaine.</li><li>Bagwing. His Rafflebot operation and the resulting moon action for $BAG is quite suspicious, but until we see him dumping PP points on our heads and disappearing for a vacation, he’s no Kainu. He’s a maybe.</li></ul><p>The community also doesn’t demand standards for professional conduct from the devs. When there’s so few devs willing to work on this project, you can’t be too demanding. Beggars can’t be choosers (can this be addressed through Hypergrowth?) But a simple way to resolve this is to offer a 10% bonus pay if things are done professionally. Give estimates on the timeline for your deliverables, test the code, write accompanying documentation, suggest a plan for it to be reviewed and audited, give progress reports — because investor confidence matters.</p><p>Regarding the phase 1 roadmap, no one has even asked Vilkris hey, how’s dynamic plasma going? Do you have the resources to complete this milestone? If so, why should we believe you? Where is your work? Are you one person or ten? How about the rest of the phase 1 roadmap — are the existing devs enough to complete it in a timely manner? Do you think Hypergrowth should be zero until phase 1 is completed, or should we be marketing the whole time to recruit the extra manpower necessary to successfully build phase 1 in a timely manner?</p><h2 id="02f8">Problem #4: the existing validator set is ossified</h2><p>The majority of pillars today are traced back to xStakes in 2019 and to qStakes in 2020 … half a decade ago. This statistic gets even worse when you consider all the people airdropped 150k QSR who never utilised it.</p><p>This ossification of the validator set not only harms the decentralisation narrative, but it is also an issue because the DAO is arguably controlled by a small number of people who have already made bad decisions. I could be wrong as it’s only my opinion, but the worst ones:</p><ul><li>Paying Sumamu 100k ZNN and 1M QSR, and not negotiating even a little on the amount. I was at fault too for supporting that.</li><li>Paying 70k USD for something simple, because there are no impartial devs to consult with regarding dev proposals.</li><li>Denying Deeznutz his AZ for the dev updates. These are important for coordination and investor confidence. There is also a larger issue around him being unpaid — Sumamu bridge relied on a lot of work behind the scenes from Deeznutz with coordinating everything and getting the code audited. Do you realise how valuable it is to have someone on your team who gets shit done? He’s a candidate for a vested pillar, as a sign of appreciation and to further cement his continued presence and efforts in Zenon. You don’t only have to pay for specific work, you can also “long people” as part of your strategy. Longing Elon Musk would have worked out very well for example.</li><li>Denying Stark on his AZ. Someone willing to have a doxxed persona, creating videos which is an uncommon skill, passionate about Zenon and establishing a presence in other communities such as Kaspa and Ordinals, such that he can shill them Zenon later? We need content creators, we need brand ambassadors and we are not a billion-dollar company. We are a micro cap project many consider a joke or a scam or we are not even considered at all, because no one knows we exist. We are in the FAFO stage and we should be trying things. A passionate cultist willing to make videos, socialise with other communities, provide performance metrics and more over years for a one-off payment? I’d long that individual.</li><li>Denying Hewwo on his AZ. I can’t remember if he submitted onchain or not. But the idea of giving two vested pillars to people as “advisors” was interesting. They are experts in crypto culture and trends, and are connected to a network of traders with deep pockets — this idea absolutely should be revisited in the future. We need to onboard degens before we get to normies, so we need to consider this. It could be the fresh blood the network needs. Worth the risk in my opinion.</li><li>All that could have been. The precedent of denying valuable work is preventing innovation and stifling the culture. Look at the incentivised Twitter campaign that Hypercore team ran last year. That should have been funded by AZ, and it’s clear people have lots of ideas. We should be having fun and trying everything — instead we are shrinking in active members while the price bleeds out.</li></ul><p>The validator set is ossified partly because of how cost-prohibitive it is to run a pillar. Relative to its market cap, Zenon pillars are obscenely expensive compared to other projects. Why is that? Did the founders intend on a version of merged mining which requires PoW from pillars, therefore they only want rich people to own pillars so they can afford the hardware? Or did they not anticipate people hoarding coins despite slow progress?</p><p>Can we reason with the existing pillars? I’m not sure, as 60 or so pillars are silent anons who ignore all proposals and have never voted even once. Suggesting they stay intentionally uninvolved out of idealism should be considered not only cope, but dangerous thinking as you’re implying the founders own 60 pillars? So you’re saying Zenon is centralised?</p><p>And pillars being unreachable isn’t so bad from a security of consensus point of view, but it is concerning overall. Why would anyone work for or invest in a dysfunctional network? Tesla “had no marketing” but they have Elon Musk who is the most famous man on the planet. Bitcoin “had no marketing” but had free giveaways at conferences, Max Keiser shilling it on national TV at $1, influential writers discussing Bitcoin extensively … we need marketing, and we have the power to incentivise it.</p><p><strong>We need more pillars. But how?</strong></p><p>At the $1 price, 10M market cap, it is still cost-prohibitive. 15k ZNN + 300k QSR is 45k USD. For someone with a high risk appetite, that’s 2–3 years where every single spare dollar is spent on Zenon. For someone with a 5% networth risk appetite, they’d need a networth of 1M USD to comfortably erect a pillar. For someone in a lower GDP country, like most of the world’s population, it is impossible.</p><p><strong>Could you just allow the DAO to continue as it is already going?</strong></p><p>The result of its current policies will mean more ZNN and QSR is minted daily, but with little new utility or buying pressure. The price may continue to bleed out until we hit 10 cents a coin or lower. If so, whoever is left in the community will be hardcore. And if pillars cost 5k each, the active community would be able to afford them and the demographic should shift from predominantly rich, silent anons to include poor hustlers who understand they need to use everything in their power to push the network, which means managing the network properly.</p><p>My critique of this approach is it wastes time we may not have, and it still doesn’t resolve the high pillar cost relative to network market cap. Fiat and rival BTC L2s are the competition. Maybe you could accelerate this process by tinkering with QSR emissions. If someone stakes 15k ZNN, they should after 1 year have 300k QSR — basically enough to erect a pillar. Arbitrary numbers, but the founders of Zenon came up with arbitrary numbers too. Zenon is a complete experiment — you need to assess how the experiment is going and respond accordingly. Why should current emissions be respected? Where’s the rationale? Is a discussion needed?</p><p>There’s also a case to be made for allocating emissions to AZ. The fund being limited in size is creating a scarcity mindset which is contributing to the issue of it not being spent. It’s possible to donate to AZ to replenish it, but in a world of speculators hoarding their coins, how realistic is that mechanism? The AZ fund could mint ZNN and QSR daily.</p><p>The AZ mechanism is also very clunky. Some are only voting no purely due to the asking amount — rather than yes, abstain, no, there should be an option for “negotiate”. They could click that option and include an amount they would support, then a resubmit can be done with minimal friction. You could also set up a mechanism where roadmap milestones or things the network needs are voted on as pre-determined bounties, such that they are already approved and one only needs to do the task to a high standard.</p><p>A massive event for pillar demographics was xStakes and qStakes, which gave us speculators as pillar operators.</p><p>A second massive event for pillar demographics should be AZ, to give us contributors as pillar operators.</p><p>That so far isn’t happening, as only one person has been paid enough to erect a pillar with their payment. Increased QSR emissions could be an intentional policy of the DAO for the next 4 years while we are hustling to achieve a critical mass. Not only could more pillars improve the efficiency and effectiveness of capital allocation and improve our decentralisation selling point, but it would allow people new to Zenon to have a chance at a meaningful say in governance … therefore enticing them to join us.</p><h2 id="239a">Problem #5: we are a crypto project, but we do not act like one</h2><p>When in Rome, do as the Romans do.</p><p>Before we can become a BTC L2, we need investors, users, volume, capital, devs and culture. We need a more valuable treasury and a larger community to be able to build what we need and what we want.</p><p>We need to be more pragmatic in our approach: <strong>Memecoins </strong>and<strong> Alliances.</strong></p><p>What do Blast as an Ethereum layer-2 and Sui as a layer-1 have in common? Their volume is near zero, because no one is using the tech for anything — people want memecoins and they want green candles. Blast has no successful memecoins and neither does Sui. This 2024 bullrun, degens are sticking to Ethereum, Solana and Bitcoin because that’s where memecoins are mooning. The cofounder of Coinbase has acknowledged this; he’s given a presentation about how memecoins can be used to onboard people to Base, their Ethereum layer-2. $BRETT just crossed 1B market cap and the shiny green candles are drawing people into Base, then comes their smart wallet. Check out his presentation below:</p><figure></figure><p>A shiny new memecoin for Zenon could be a legit way to onboard people, or at least to capture attention. It can be a ZTS or a Supernova token.</p><p>I’ve been spending a lot of time around memecoins lately and trying to understand how this space actually works. Promoting a utility coin is not that much different to promoting a memecoin; both approaches require tactics to gain attention and craft a compelling narrative. My content creation skills are getting me invited into various chats within the Meme Economy. I should be able to eventually shill them Zenon, or maybe even get their help with running a successful memecoin for Zenon.</p><p>A successful memecoin requires a number of things. A good UX for where it’s traded, someone to risk initial liquidity, a market-maker to inject green candles to stimulate fomo or scare them to shake out weak hands, a team to be pumping out fun content, a raiding party to spread awareness, influencers to amplify the message … and ideally it would also be a derivative of a meta which is hot. And while controversial, a lot of memecoins have a small group who own the majority of the supply. They initially blacklist wallets so snipers are nerfed (otherwise they will endlessly dump on the project and kill the pump every time). I’m not advocating for such shady practices. An ethical workaround could be to make a memecoin with such culture early holders are less likely to jeet it.</p><p>A Zenon memecoin which is mooning — the green candles would be the ultimate attention-grabber. It draws degens in like moths to a flame.</p><p><strong>And why don’t we pay influencers to distribute our content?</strong></p><p>Building an audience from scratch is very difficult. But influencers already have an established audience. We can and should pay influencers to distribute our content. If you pay, you can essentially rent their reach.</p><p>We could also form alliances. Join other communities you find interesting and enjoyable, and after some time you could share Zenon with them. Maybe collaboration is possible. You could soft-shill them Zenon, or hard-shill it. If they already know you before you shill them, that trust should build your conversion rate.</p><p>In an attention economy, all projects are fighting for the limited attention of the consumer. We should use all tools in our toolbox to spread the good word about the green coin.</p><h2 id="02c4">Conclusion</h2><p>This obituary has declared Zenon dead as per its shrinking community and 90% decrease in Satoshi value. In an attempt to identify what is wrong, 5 perceived problems were discussed. A TLDR of possible solutions:</p><ul><li>Recognise the need for Hypergrowth</li><li>Agree on a way to fund Hypergrowth based on the process, with bonus pay for results as measured by a hybrid of qualitative and quantitative</li><li>Give a 10% bonus pay to devs who conduct themselves to a high standard (giving estimates for deliverables, testing code, documentation, progress reports etc.)</li><li>Hire some devs to help assess dev work which is submitted to AZ</li><li>Increase the emission rate of QSR for 4 years to facilitate an increase in the number of pillars, and allocate a % of emissions to the AZ fund to replenish it and combat the scarcity mindset</li><li>Introduce vested pillars to increase the number of contributors and builders in the demographic of pillar holders</li><li>Modify the AZ mechanism to include a pay negotiation option as well as pre-emptive bounties for agreed upon network needs we can predict</li><li>Months ago, Zashu, Sugoi, Bzed and Tapwoot expressed an interest in joining me on Nostr. Maybe we could revisit that idea to form a Hypergrowth team. But I haven’t spoken to them in a while, I probably shouldn’t even include this in the article without having spoken to them first. I’m also dealing with some things and might be unavailable</li></ul><p>I could be wrong about all this stuff.</p><p>Are the problems I’ve identified in this article legitimate? Are there other problems I’ve missed? Are my suggested solutions useful? Zenon is quite experimental. We can and should be assessing how it is going, and making changes as needed.</p><p>Despite my current absence, I still care about Zenon and always will. It pains me to see the network struggling. I hope the community can turn things around soon, and I believe they will if they come together.</p><p>Thanks for reading.</p><p>– Zyler</p></div>",
  "author": "Zyler9985",
  "favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
  "source": "medium.com",
  "published": "2024-06-09T13:36:44.886Z",
  "ttr": 963,
  "type": "article"
}