{
	"url": "https://medium.com/@Zyler9985/zenon-network-i-the-green-pill-883e608727a",
	"title": "Zenon Network I: The Green Pill",
	"description": "This nine-part article series aims to explain Zenon Network in a way which is simple, digestible and fun. Its premise is that education, learning and understanding are part of the formula for ecosystem growth...",
	"links": [
	  "https://medium.com/@Zyler9985/zenon-network-i-the-green-pill-883e608727a"
	],
	"image": "https://miro.medium.com/v2/resize:fit:959/1*mTkBLgchrCCb1aH8qhwZ6Q.jpeg",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----883e608727a--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>This nine-part article series aims to explain Zenon Network in a way which is simple, digestible and fun. Its premise is that education, learning and understanding are part of the formula for ecosystem growth and adoption for what some are already calling Satoshi’s Ethereum. Let’s get started!</p><p>Disclaimer: This article is not financial advice and may contain speculation</p><figure><figcaption>Enter the rabbit-hole.</figcaption></figure><h2 id="3b07">In 1 Minute …</h2><ul><li>Zenon Network is a <strong>new layer-1</strong> crypto with a mainnet which went live in November of 2021. There are plans for Apps, NFTs as well as interoperability and DeFi with native Bitcoin</li><li><strong>True decentralisation</strong>. Zenon closely adheres to the Bitcoin Ethos and its launch was egalitarian with no presale, premine, VCs or insider allocations. Same conditions for everyone via a public bond</li><li><strong>Unique tech</strong>. Zenon innovates with a dual-ledger. A meta-DAG for the consensus and a block-lattice for storing transactions. It has two native coins to achieve equilibrium. There are plans to implement Narwhal and Tusk for extreme scalability. It is feeless*</li><li><strong>Anon team</strong>. The original core team are anonymous, and they have passed the torch to the community to stay in line with the Bitcoin Ethos. Is there speculation Zenon is backed by OG Bitcoiners? DYOR</li><li>Zenon | <strong>ZNN</strong> | <strong>Governance</strong> | 9M supply, 90M max supply</li><li>Quasar | <strong>QSR</strong> | <strong>Gas*</strong> | 30M supply, 80M max supply</li></ul><h2 id="ff4b">In 5 Minutes …</h2><ul><li>Zenon is feeless on the layer-1 level. Users can do a simple proof of work calculation to send and receive transactions. For higher throughput, they can lock QSR for time to generate “plasma”, and QSR is not spent</li><li>There are devs building two Layer 2s right now. One is EVM compatible for the sake of interoperability; the other is cutting-edge tech for extreme scalability. The smart contracts will be hosted on these layer-2s to keep the base layer minimalist and efficient</li><li>Zenon’s principled adherence to decentralisation via its egalitarian launch and grassroots marketing has been essential to make the network owned and controlled by the people, not institutions</li><li>Zenon has ambitious plans for Bitcoin, partly by leveraging the Taproot upgrade which allows for new use-cases. Further down the road, there are plans for Zenon to integrate with Bitcoin via merged mining as the full realisation of Zenon’s whitepaper is a hybrid of PoS and PoW</li><li>To run a Sentinel you need 5k ZNN &amp; 50k QSR, and to run a Pillar you need 15k ZNN &amp; 150k+ QSR</li></ul><h2 id="9a06">In 60+ Minutes …</h2><p><strong>1: The Green Pill</strong>. The article you are reading now. It serves as an introduction to Zenon with useful links for newcomers at the end.<br /><strong>2: </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-ii-press-start-2p-47847aa68645"><strong>Press Start 2P</strong></a>. A presentation of Zenon’s design for earning rewards through the lens of gamification.<br /><strong>3: </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-iii-game-theory-for-progressive-decentralisation-38f94457b03e"><strong>Game-Theory for Progressive Decentralisation</strong></a>. A deep-dive on Zenon’s decentralisation, its game-theory and why that matters.<br /><strong>4: </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-iv-all-hail-the-zenocracy-f785203d102b"><strong>All Hail The Zenocracy!</strong></a> An intro to governance. How to be informed, the pillar-delegator relationship and case-studies of the DAO in action.<br /><strong>5: </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-v-8-tips-for-delegators-e0fb031d3f4b"><strong>8 Tips For Delegators</strong></a>. Helps with decision-making for who to delegate to, explains pillar metrics and other relevant considerations.<br /><strong>6: </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-vi-welcome-to-the-multiverse-a7c1cbedc94c"><strong>Welcome To The Multiverse</strong></a><strong>.</strong> An overview of the bridge, audit, liquidity program and benefits to the ecosystem.<br /><strong>7: </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-vii-8-exciting-things-coming-to-zenon-ab09b59ac48d"><strong>8 Exciting Things Coming To Zenon</strong></a><strong>. </strong>The title is self-explanatory!<strong><br />8: </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-viii-alien-plans-for-bitcoin-804e1ba60a3c"><strong>Alien Plans For Bitcoin</strong></a><strong>. </strong>A discussion of the roadmap, vision and strategy with specific focus on interoperability &amp; DeFi with native Bitcoin.<strong><br /></strong>9<strong>: A Timeline Piece</strong>. Zenon’s early history as crypto storybook. WIP.<br /><strong>10:</strong> <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-a-blistering-need-for-speed-ce34246c2f01"><strong>A Blistering Need For Speed</strong></a>. A breakdown of how all of Zenon’s characteristics are optimised for ultra scalability.</p><h2 id="a1a8">Parting Thoughts</h2><p>Zenon is a complex project with a rich and nuanced history despite its young age, but it’s well-worth trying to understand it. Pumpable narratives, cute memes and bright casino lights — all of that is great. Going all-in because your favourite influencer is telling you he sees a bull flag if he squints a certain way — fantastic.</p><p>But Zenon is here to remind people that strong fundamentals and actual utility wins in the longrun. Zenon is a sovereign ecosystem, but its plans for DeFi with Bitcoin are a huge point of interest. Very simply, its major goal can be distilled to:</p><blockquote><p><strong><em>BTC + ZNN &gt; BTC</em></strong></p></blockquote><p>Bitcoin needs scaling solutions as well as ways to increase its programmability so it can truly rival and replace tradfi. Or is it just a coincidence that Zenon’s mainnet went live a few days after the Taproot ugprade, and that Zenon’s founders signed the Taproot block 709632 with ASCII art?</p><figure></figure><p>Follow the green rabbit and be prepared to fall down a deep, deep rabbit-hole …</p><p><strong>Thanks for reading. Get Zenonized and WAGMI!</strong></p><h2 id="d469">Useful Links</h2><p><strong>NEXT article in the series </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-ii-press-start-2p-47847aa68645"><strong>HERE</strong></a><strong><br /></strong><a href="https://zenon.network/" target="_blank">The Main Site</a> as well as a <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-how-to-buy-znn-and-store-it-in-the-syrius-wallet-65a8f3ced4db">Buying/SYRIUS Wallet Tutorial</a><br /><a href="https://twitter.com/Zenon_Network" target="_blank">The Official Twitter</a> and a <a href="https://twitter.com/Learn_Zenon" target="_blank">Community Twitter</a><br /><a href="https://discord.com/invite/zenonnetwork" target="_blank">Discord</a> and <a href="https://t.me/zenonnetwork" target="_blank">Telegram</a><br />The Dev Forums <a href="https://forum.zenon.org/" target="_blank">here</a> and <a href="https://forum.hypercore.one/" target="_blank">here</a><br />Are you a dev looking to work for Zenon and get paid? See a community-made landing page <a href="https://forum.zenon.org/t/welcome-new-devs/1540" target="_blank">here</a></p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2023-09-01T11:48:56.747Z",
	"ttr": 158,
	"type": "article"
  }