{
	"url": "https://medium.com/@Zyler9985/zenons-anti-fud-shield-aaa53210eba9",
	"title": "Zenon’s Anti-FUD Shield",
	"description": "The Zhield.Our ancestors lived in a brutal environment. Fear, uncertainty and doubt were the guardian angels perched on their shoulders to protect them. Should I eat those berries? Nah, they might be...",
	"links": [
	  "https://medium.com/@Zyler9985/zenons-anti-fud-shield-aaa53210eba9"
	],
	"image": "https://miro.medium.com/v2/resize:fit:858/1*VXdwis_du7Zfcj8zHFdvDQ.png",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----aaa53210eba9--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><figure><figcaption>The Zhield.</figcaption></figure><p>Our ancestors lived in a brutal environment. Fear, uncertainty and doubt were the guardian angels perched on their shoulders to protect them. <em>Should I eat those berries?</em> Nah, they might be poisonous. <em>Can I climb up high enough to reach those bird eggs?</em> Nah, that’s a long way to fall. <em>Can the three of us scare away that lion to have its kill all for ourselves?</em> Nah, I just traded all my arrows for a non-fungible stone tablet of a bored ape.</p><p>But in the modern game of crypto, bad actors have exploited this inherent vulnerability to FUD for their own gain. One example is so they can keep accumulating at a low price, they will magnify concerns and spread misinformation to scare away competing buyers and make existing holders sell. They will intentionally damage the project for their own gain, which means that yes, often times the ones spreading FUD are actually among those who believe in the project the most.</p><p>FUD has the potential to damage any project, especially a project which is young. It’s a nasty obstacle that runs counter to our goal of maximal growth, and being duplicitous in nature it is unfair to any ZNNAliens who are duped by it. How to stop this tyranny! What if I told you there may be such a remedy …</p><p><strong>Zenon’s Anti-FUD Shield. </strong>(Armour rating 200, Frost resistance 50%, Immunity to fear, Makes peepee 10% larger)</p><p>The 1st Edition of <strong>The Zhield</strong> addresses FUD from pre-2023. It does not claim to be the definitive solution to any particular FUD, nor does it claim to address all of the FUD that has occurred, but it is my hope that it helps out some ZNNAliens anyway. It can be thought of as an amalgamation of many people’s points of view, often times taken from the telegram chats, but feel free to discuss or disagree with anything that doesn’t resonate with you. On the menu for today: Where is the code? Why don’t the devs talk to us? Are the pillars decentralised? Let’s go!</p><h2 id="7633">1. Where is the code? Stop tweeting! This is the slowest soft rug I’ve ever seen! Code exists only in imagination!</h2><p>It’s fun to counter old FUD. The SYRIUS wallet is now fully open-sourced under permissive licensing and many projects submitted to Accelerator-Z have visible code for anyone to see. Other projects are still too early in development to see the code yet, such as the mobile wallet project from Dr Blaze. But he has at least released screenshots for the UX, and boy do they look gorgeous and sleek. The entire project will be open-sourced soon enough, but there are a couple of reasons why that is not the case yet. One is that they need to stress-test the network and purposely try to hack it and break it, as that will be exactly what bad actors will try to do. Everything needs to be air-tight. Two is that any truly cutting-edge tech could be copied by someone else, so it is ideal to time its release such that we have enough momentum that their attempts won’t matter. Why are we waiting so long? Because we’re not just a crappy erc-20 built on ETH. We are our own layer-1 which is completely unique — and true innovation obviously takes more time to develop. It sucks that we have to be patient, but it’s great that we get to be early — I suggest you focus on the latter aspect.</p><h2 id="20bd">2. Why won’t the core team talk to us? They deliver one autistic sentence a month then vanish. Where’s the leadership? I feel so left in the dark!</h2><p>It’s this way because it has to be — let me explain. Giving minimal guidance (and in some cases zero guidance) and relying on the community to deliver crucial developments is an important catalyst for organic growth. Accelerator-Z allows for anyone to use the SYRIUS wallet and pitch an idea to the DAO for funding, making it a de facto decentralised corporate boardroom. If the DAO is interested, and if they can deliver to a high standard, they will then be funded. If they deliver good work but are not funded, this undermines trust in the DAO and discourages future contributors, so the DAO is strongly incentivised to pay from the treasury fund to honour good work that has been done. This process allows completely open participation that bypasses antiquated barriers to contribution such as their country of origin, their uni degree, their disability, their appearance and more (such as criminal history lol).</p><p>This need for the community to deliver important work, combined with the mechanism that allows totally open global participation, provides both the incentives and means for the organic growth of builders in Zenon’s ecosystem. This will decentralise and maximise the number of ZNNAliens who are considered broadly as builders — this includes but is not limited to people involved with tech, sales, marketing and sh*tposting. This organic growth will fuel innovation and productivity in the ecosystem and power our momentum forwards.</p><p>Interestingly, this reliance on the community also affects how we will one day be viewed by regulators. Refer back to <strong>DeeZNNutz</strong> in his article <strong>wen zenon network article? </strong>In America, the Howey Test defines a security as when: “a person invests their money in a common enterprise and is led to expect profits <strong>SOLELY</strong> from the efforts of the promoter or a third party.” With the founding developers walking the talk of passing the torch to the community, progress is literally contingent on community involvement to carry the project. For example the outsourcing of ‘Hyperspace’ goals. Therefore, profits are not expected solely from the efforts of the promoter. Furthermore, all of the communications from the core team via twitter, medium and telegram have been very ideological and mission-focused/tech focused. Nowhere have they ever discussed the price, save for a retweet of a crypto influencer who was being bullish about the ZNN price — but in the Zenon Network Twitter bio they have stated that retweets are not endorsements, and they have indeed retweeted people who were subsequently rejected by the DAO for funding (an unlikely outcome if they were considered to be officially endorsed). So even “expectation of profits” is debatable. Expectation of blockchain technology adoption and positive benefits for society, sure — but profits are not discussed and can be considered incidental if they do occur as a byproduct of the realisation of their vision.</p><p>Not being classed as a security means we avoid pressure and antagonism from the SEC, bestowing safety and prosperity to Zenon’s future. The core team being anonymous also happens to protect them from regulations and legal scrutiny. It also means that they can vanish and re-appear to blend in among us as ordinary community members — or will they f*ck off to an island and get their knobs polished by swedish models? No one will ever know, and that’s the beauty of it.</p><h2 id="0e3b">3. Do we really have a decentralised foundation? xStakes was probably all insiders, it’s centralised af!</h2><p>First of all, it was a public sale (more accurately a public bond). Anyone who saw the post could participate in the launch, so it was clearly not exclusive to insiders. Furthermore, the presence of at least some insiders is unavoidable for any project’s launch — at least our founders are most likely principled OG Bitcoiners. What proportion of pillars are ran by the founders? Due to the penchant for anonymity and privacy, we will never know. But while you can argue about the results of xStakes, ie. did it achieve the intended outcome, can you argue with the design of xStakes? If the design of xStakes is considered to be sound or even perfect, then it almost doesn’t matter the outcome — because there is no other way they could have done it. The only way you could argue this is if you find facts supporting these allegations, or if you find evidence there is centralised control of the DAO that runs counter to the majority’s interests. So far no one has been able to produce any evidence of this.</p><p>Also, from 2019–2021 they sold a placeholder token on the legacy network in an effort to distribute the tokens even before the network was live. If you look at the price chart, the price has been extremely cheap that whole time, which is not exactly a barrier to outsiders gaining a significant position. Clearly, the pillars minting their ZNN have been selling it, and given that the investors tend to be insanely bullish and view Zenon as basically Satoshi’s Ethereum, who has been doing the selling at those prices? Not the investors I’d wager. It’s most likely been the core team, as part of their principled efforts to decentralise it more as the investor’s thesis changes and strengthens over time. They know that the success of the NoM depends on Bitcoiners accepting the protocol, and have thus prioritised decentralised ownership and control consistently for many years.</p><p>Another point not discussed often enough is that xStakes was not a singular event. It had a sequel which I call qStakes — the QSR airdrop which came later on. While xStakes participants may have been likely over-represented in pillar ownership, this is only true for the pillars on the legacy network. As we discussed, this is a network consisting of a placeholder token which was a PIVX fork. The real validators on the actual Zenon Network require both ZNN and QSR. The QSR snapshot and airdrop came 1–2 years after xStakes, allowing a significant amount of time for ZNNAliens to grow in number and decentralisation, be aware of and plan to participate in this. 50k QSR and 150k QSR were given to sentinels and pillars respectively, giving them enough to transition to real nodes and validators on the actual Zenon Network. Furthermore, they were not automatically eligible for this QSR, they had to be reliably running their nodes at certain snapshots, thus qStakes screened for reliability in running infrastructure, not simply ownership of ZNN. Check out the <a target="_blank" href="https://medium.com/@zenon.network/project-quasar-88c3ddf850c3">Project Quasar</a> article from back in the day.</p><p>Anecdotally, myself and some other aliens I know, living on opposite sides of the world, who are just ordinary guys with ordinary jobs, have managed to accumulate for a sentinel or pillar, and that’s despite us being relatively late to the party (not being here at the time of qStakes). This wouldn’t be possible if there was a plot to gate-keep the tokens. If you say to me, but aren’t the early adopters flush with tokens? Yes, but that’s true for Bitcoin as well, as their higher risk entails higher reward so early people tend to own more. True for every asset on Earth. If you say to me, but some pillars go down and up simultaneously, could they be owned by the same person? Yes, some pillars are likely owned by the same entity. That’s also true for Bitcoin in the sense that there are whales who own huge amounts of it. True for every asset on Earth. As long as we don’t have large, coordinated capital (no VC backing or pre-mine goes a long way to mitigating this). There’s also the vested pillar program coming zoon, this will ensure even more validators for the network, specifically ones who add value.</p><h2 id="8e2a">4. Okay, enough mind-games, who is really behind Zenon?</h2><p>Enough with the mind-games? You really have come to the wrong project. But to answer your question; considering the rumours and hints, the motives and incentives at play, as well as their psychological profiles — the best guess we have so far is that the <em>Island Boys</em> are the founding devs.</p><figure><figcaption>Professor Z &amp; Mr Kaine partying hard after dumping on us.</figcaption></figure><h2 id="7375">A wise man once said …</h2><p>The bigger we get, the bigger the FUD will be. I don’t know when that day will come, but if and when it does I draw comfort from the many big brains and voices of reason in our community. Count on them to defeat any fudders in telegram or twitter or wherever those weeds spring up. We owe it to the ZNNAliens both old, new and prospective to keep the discourse free of misinformation and harmful agendas.</p><p>At the same time, of course we’re only human. Sometimes the FUD comes from within. Those dark clouds of fear and doubt will visit us all from time to time. But clouds come and go — meanwhile the pristine blue sky of truth is always there, waiting for you to look up.</p><p><strong>Take care and WAGMI!</strong></p><p>– Zyler</p><h2 id="ae44">Useful Links</h2><ul><li><a href="https://zenon.network/" target="_blank">Zenon Network</a> the main site</li><li><a href="https://forum.zenon.org/" target="_blank">Zenon Network Forum</a> a popular place for community discussion</li><li><a href="https://zenon.tools/overview" target="_blank">Zenon Tools</a> for info about rewards and pillar metrics</li></ul></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2023-01-01T17:20:42.802Z",
	"ttr": 421,
	"type": "article"
  }