{
	"url": "https://medium.com/@Zyler9985/zenon-network-how-to-apply-for-a-funding-grant-e977b7efce0d",
	"title": "Zenon Network: How to apply for a funding grant",
	"description": "To apply for a funding grant from Zenon Network, there are two steps:(1) Informally post your proposal on the Zenon Community Forum in the “Accelerator Z” section to allow for a discussion regarding your...",
	"links": [
	  "https://medium.com/@Zyler9985/zenon-network-how-to-apply-for-a-funding-grant-e977b7efce0d"
	],
	"image": "https://miro.medium.com/v2/resize:fit:928/1*gt5ocj7-sT3u0MbUH8E_lQ.png",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----e977b7efce0d--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>To apply for a funding grant from Zenon Network, there are two steps:</p><p>(1) <strong>Informally</strong> post your proposal on the <strong>Zenon Community Forum</strong> in the “Accelerator Z” section to allow for a discussion regarding your idea, funding requested etc. Try to follow the available template for your submission. This step of engaging with the community is highly recommended, as ultimately the community votes to approve or deny your application.</p><p>(2) <strong>Formally</strong> submit your proposal via the <strong>SYRIUS wallet</strong>. The links for the forum and the official website to download the wallet are immediately below, but see the very end of this article for a tutorial with screenshots.</p><h2 id="0d30">What kind of projects can be submitted?</h2><p>(1) Broadly, anything that adds value to the ecosystem.</p><p>(2) More specifically, there are goals the community has stated that they need and/or would like to see which are a priority. These typically fall under tech, sales or marketing — more in-depth examples can be found in the official medium article on Accelerator Z, which also discusses many other important things. See the link below for the <strong>official article</strong>:</p><h2 id="70f6">Step-by-step tutorial for actually applying</h2><figure></figure><ol><li>Visit the official twitter page for Zenon Network and download the SYRIUS wallet.</li></ol><figure></figure><p>2. Let the SYRIUS wallet update itself. Go to settings gear icon, scroll down, select node, click embedded node, scroll further down click confirm node. May take a few hours for the embedded node to sync.</p><figure></figure><p>3. Go to the “Accelerator Z” tab, it’s the rocket ship icon. Click create project. You will need to spend 1 ZNN on its creation. Include the name, a brief description 1–2 sentences is all that’s needed, and most importantly a link to where your proposal is. Ideally it should be a URL to the post you made on the community forum for your informal submission which follows the template available as a pinned post on the forum in the “Accelerator Z” section.</p><figure></figure><figure></figure><p>4. Now you have a 14-day window where the community will vote on your proposal. The pillars vote and delegators influence their vote — so try to appeal to everybody. Ideally the lobbying is done before you formally submit, but you do have this 14 day window as well once you submit in the wallet.</p><ul><li>green bar is yes votes, red bar is no votes (pillars that voted the “abstain” option is not shown here)</li><li>blue is total number of votes (including yes, no and abstain) while the yellow bar is how many votes needed to reach the quorum (1/3 of pillars)</li></ul><figure></figure><p>5. If the project is accepted, congratulations — this is a show of good faith by the community that if you can do a good job on delivering, these funds will be released to you. Next you need to create the phases for your project; only by successfully completing each phase can a portion of the funds get released. Note that there is no time limit on phase voting — but you can still be denied if you fail to reach the majority of yes votes.</p><ul><li>Click on your approved project, which brings you to a new page where you can click create phase. (You can’t create all of the phases at once because this will constitute spam, <strong>can only create one phase at a time</strong> and offer it for review — unless it is a single phase project).</li><li>In your proposal, you can say you will do 3 phases, but there is no way to say this inside the actual SYRIUS wallet. It is only understood by <strong>how you break up the funds</strong>. So if you split your funds 3 ways, that’s 3 phases. Doesn’t have to be three equal portions either. Ideally, the exact breakdown of the total funds for each phase should already be stated and agreed upon in your proposal to the forum.</li></ul><figure></figure><figure></figure><h2 id="2988">Community-made articles on Accelerator Z</h2><p>For further reading on Accelerator Z check out the articles below!</p><ul><li><strong>Web3 is dead. Long-live Accelerator Z</strong>. A big-brained community member’s thoughts on Accelerator Z; worth a read by anyone. Also gives insight which is very valuable for a non-technical person, for example when he is discussing SDKs (amongst other things), done by George.</li><li><strong>Simple Guideline for AZ Proposals</strong>. Mainly covers how to trust who is submitting and are they asking for too much?</li><li><strong>Budgeting in 5d Hyperspace</strong>. Some nice infographics and thoughts about price volatility and strategy for budgeting our AZ fund over time, done by Ztark.</li></ul><p><strong>Take care and WAGMI!</strong></p><p>– Zyler</p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2022-06-01T05:41:28.739Z",
	"ttr": 146,
	"type": "article"
  }