{
  "url": "https://medium.com/@Zyler9985/zenons-synergy-with-nostr-c36fe2bf955c",
  "title": "Zenon’s Synergy With Nostr",
  "description": "Open-source protocols are among the most important inventions in modern history. Unfortunately they are not well understood by many, despite their potential for being our salvation from a dystopian future....",
  "links": [
    "https://medium.com/@Zyler9985/zenons-synergy-with-nostr-c36fe2bf955c"
  ],
  "image": "https://miro.medium.com/v2/resize:fit:949/1*Dn-IGSUiy1EMBw1GpVAkRg.jpeg",
  "content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----c36fe2bf955c--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>Open-source protocols are among the most important inventions in modern history. Unfortunately they are not well understood by many, despite their potential for being our salvation from a dystopian future. This article explores the synergy between two young but promising open-source protocols: Zenon and Nostr.</p><h2 id="ba72">We are going to cover:</h2><p>1. What is Nostr?<br />2. Why is Nostr good for humanity?<br />3. How can Zenon achieve synergy with Nostr?<br />4. What is an actionable gameplan for ZNNAliens?</p><p>Disclaimer: This article is not financial advice and may contain speculation</p><figure><figcaption>Zashu riding a Nostrich to work in Saudi Arabia.</figcaption></figure><h2 id="2dc4">1. What is Nostr?</h2><p>Before discussing how Nostr can help humanity, it’s useful to understand what it actually is first. Technical concepts will be made beginner-friendly, because if Nostr is for everybody to enjoy censorship-resistant communication — then its education should be for everybody too.</p><p><strong>Nostr acronym</strong>: “Notes and Other Stuff Transmitted by Relay.”</p><p>Your “<strong>public key</strong>” is your username and your “<strong>private key</strong>” is your password. Share your public key with friends so they can find you. It’s a long series of numbers &amp; letters, but it’s easy to copy-paste.</p><p>A “<strong>Relay</strong>” is referring to a Nostr server. It’s called a server because it’s providing a service to other people — in this context enabling people to send and receive data. This is what the Nostr protocol does; but there is more. The idea is to use that protocol as a foundation to build ontop of, such that you can build what looks like a new social network, but under the hood its infrastructure is Nostr. For example the Damus app allows users to message each other and share posts, and it does this by interacting with the underlying Nostr protocol. So “<strong>Notes</strong>” is referring to the messages and posts exchanged between Nostr users.</p><p>The term “<strong>Clients</strong>” is just referring to the different apps built ontop of Nostr to facilitate users. Damus is good for iOS, Amethyst for Android and so on. Check out “<a href="https://nostr.com/clients" target="_blank">favourites</a>” which has a list of recommended clients.</p><p>So why is Nostr so exciting? How does it challenge the status quo?</p><p><strong>Because anyone can run their own relay</strong>.</p><p>Why is that so powerful? Read on …</p><p>Most clients will broadcast your data simultaneously to multiple relays, but for the sake of understanding let’s assume the client only broadcasts to one relay. Most people join existing relays because that’s the easy thing to do. And if you become censored by that relay, simply hop to another one. If the new one also censors you, of course you can continue changing relays. But you also have an unstoppable play: <strong>Run your own relay</strong>. Some hardware with the right software and boom — you are running your own relay. ‘They’ obviously can’t deplatform you from your own relay, and ‘they’ can’t stop others from opting-in to listen to you if they choose to do so.</p><p><strong>TLDR</strong>: <strong>Nostr facilitates a social network which is censorship-resistant</strong>.</p><p>And a “computer” is a magic box which feeds off “electricity”. Sorry that was kinda rude. Please don’t call local law enforcement.</p><h2 id="8df1">2. Why is Nostr good for humanity?</h2><p>Open-source protocols are the foundation for a brighter future because they facilitate a more just power balance than what is typical of legacy systems. They take power away from a small number of owners and redistribute it to a large number of users. For example:</p><ul><li>The owners of legacy finance can freeze your account and inflate away your wealth. <strong>With Bitcoin</strong>, users are protected from both attacks. Worst-case scenario (Bitcoin is compromised), <strong>users can migrate to a better fork of BTC or start their own.</strong></li><li>The owners of legacy communication can censor you or people you want to listen to. <strong>With Nostr</strong>, users are protected from censorship which fosters a free-market of speech &amp; ideas; a net-positive for everyone. Worst-case scenario, <strong>they can migrate to better relays or run their own.</strong></li><li>The owners of legacy developer platforms can corrupt and gate-keep what is built. <strong>With Zenon</strong>, users unlock a new dimension of programmability while aligned with Bitcoin’s ethos. Worst-case scenario, <strong>users can migrate to a better fork or start their own.</strong></li></ul><p>The above three examples illustrate why open-source protocols are empowering to everyday people:</p><p><strong>Users can opt into what they want, and opt out of what they don’t want.</strong></p><p>And crucially, users don’t need to abandon the protocol to do so, which means such mini power-plays are not only effective, <strong>but they are also practical</strong> and easy to actually do. Great ideas are of limited value if they can’t be easily put into practice, but in the above examples it is <strong>literally as easy as a few clicks</strong> and the users have opted into a better relay or fork. Obviously, there is great effort required from the builders creating the alternatives; but from a user-perspective hopping over is easy, as it should be to keep the power of their choice practical and viable.</p><p>The protocol can be thought of as a dancing snake. No one owns or controls it, but it responds to the magical notes of the flute played by users. The protocol being a kind of living entity responsive to the demands of its users clearly presents a check and balance against a potentially abusive central operator. In the context of Nostr, rather than silence a bad actor the users can argue with them or choose to ignore them. <strong>The key is that it’s their decision to make, and no one is making it for them</strong>.</p><p>It might seem cynical and paranoid to assume central entities will abuse their power. But often their incentives “rig the game” such that bad outcomes are predictable.<strong> But open-source protocols are not changing human behaviour by changing human nature; they are changing human behaviour by changing “the rules of the game”</strong> such that better outcomes become predictable. Accepting that human nature is fallible is a sad thing, but it also paves the way towards engineering trustless setups such that you don’t need to trust anybody to “act right”. It instead becomes in their interest to do so; otherwise their users will leave them.</p><p>Examples of censorship will be discussed in the next section, but first we should illustrate an example of a common power struggle. Relatable examples are important because they foster understanding on an emotional level. True story. A place I worked at had a boss who was so cheap and stingy he refused to put the aircon on in the middle of an Australian summer, and a pregnant employee was having issues with that. She tried to talk to him about it, and he lost his temper. Raised his voice, told her to get used to it or work somewhere else. She locked herself in the bathroom and cried for 2 hours. Being a small town, it’s hard to find another job, and about to have a new baby enter her life she needed financial stability. The boss refusing to compromise an inch, his cruelty with treating her like a slave without rights — this is enabled by him having all the power. The rules of the game allow him to be like this if he wants to be. But imagine this was the city? She could more easily find another job. Imagine her husband was rich? She wouldn’t even need the job. Imagine she was dealing with a manager and not the owner, so the owner could put the manager in his place? Imagine she was a popular person in the town such that she could publicly shame him and negatively impact his business … can you see how differently she would be treated if she had more power? That is what this whole revolution is about: <strong>Giving power back to people so they can be treated better and enjoy better outcomes</strong>.</p><figure><figcaption>An ancient struggle. The many vs the few.</figcaption></figure><h2 id="0919">What are some examples of censorship?</h2><p>Censorship can be done in different ways:</p><ul><li><strong>Directly</strong>. De-platforming someone, eg. banning them.</li><li><strong>De Facto</strong>. Coercion, eg. threatening to pull advertising.</li></ul><p>It’s essentially a refusal to counter speech with speech, instead using force to silence opposition. This robs the audience of their right to decide &amp; respond, so instead of a free-market for speech &amp; ideas you have a dictatorship plagued with conflicts of interest. There are laws against monopolies, as anti-competitive practices ultimately hurt the consumer. A regime of censorship in effect has a monopoly on speech and therefore ideas, and thus ultimately hurts its own people.</p><p>For a recent case study, look into why Elon Musk purchased Twitter/X for an exorbitant price. A champion of free-speech, he took a stand against a censorship machine going haywire. The relentless pushing of boundaries, the worse and worse behaviour (a sitting US president democratically elected was deplatformed) finally led to pushback. It could well be that his play will provide Nostr the time it needs to mature and reach a critical mass of users — that way if Elon later sells the company or steps down it won’t matter, since Nostr will be a dominant and lasting force for free-speech by then. There is thus a window of opportunity to funnel users from Twitter/X into Nostr, as right now Nostr can be freely discussed and promoted to an audience of millions. For other examples of censorship, you can obviously open any history book and find tyrant after tyrant who censored the critics of their appalling regimes.</p><figure><figcaption>Unironically one of the most important historical moments of our time.</figcaption></figure><h2 id="f325">3. How can Zenon achieve synergy with Nostr?</h2><p>As two young but promising open-source protocols, Zenon and Nostr can enjoy a symbiotic relationship. Let’s discuss Growth and Tech.</p><h2 id="4a4d">Growth</h2><p>Users of Zenon and Nostr have one major thing in common: They understand the value of open-source protocols. As such, <strong>the technical and philosophical barriers to understanding each other are lower than anywhere else</strong>. With the right educational content, both parties should be able to understand the value proposition the other brings. Having an active Zenon presence on Nostr will also help with this cross-pollination.</p><p>And of course, Nostr empowers ZNNAliens in the same way it does anyone else: Their communication with the broader world will become immune to censorship. Clearly that can only be a good thing for momentum.</p><h2 id="7d58">Tech</h2><p>If successful, Zenon will eventually be scalable, have smart contracts and be interoperable with native Bitcoin. This can benefit Nostr in multiple ways. We have already seen clients support BTC payments, so how could Zenon be used in the future?</p><p><strong>Incentivising relays</strong>. Zenon could establish an economic model for this. Specific relays could tokenise their ownership to decentralise decision-making, or a Nostr ZTS token could be created for an association of people running relays, complete with voting rights and revenue share.</p><p><strong>Tipping service</strong>. This could be done with ZTS tokens feelessly as per Zenon’s plasma paradigm. It could even be done with zBTC — backed by native BTC inside Zenon’s shared-custody TSS vault.</p><p><strong>Enabling a data marketplace</strong>. There could be buying &amp; selling data packages from Nostr for various purposes. Or it could be related to storing data longterm to reduce reliance on relays, similar to what Arweave does.</p><figure><figcaption>A song of cultural significance addressing the institutional racism they were subjected to. Exercising their freedom of speech to help the cause. “Our art is a reflection of our reality.” — NWA.</figcaption></figure><h2 id="82cb">4. What is an actionable gameplan for ZNNAliens?</h2><p>ZNNAliens are currently limited in terms of resources, but to start with a small group could commit to establishing a Nostr presence. This doesn’t necessarily mean shilling Zenon — it means being active in the space, and being there because you want to be.</p><p>It will take some effort at first, double-posting content between Nostr and Twitter/X. <strong>But you have to be the change you wish to see in the world. How can you expect to move anyone else, if you can’t first move yourself?</strong> A Zenon presence on Nostr grants visibility and exposure; the precipitants of an eventual merging of two like-minded communities.</p><p>The content itself can be Zenon-based, but it can also be more broadly about the tech and philosophy which underpins Zenon. Likely more appropriate, since our Bitcoin stuff is still a while away. It can also be just chilling and vibing, which would help with making the activity sustainable over time. It’s not realistic to have a banger piece of content every single day, even if you have a booty as thicc as Chadassa’s. Use Zenon and Bitcoin hashtags and comment under other people’s posts to avoid being trapped in yet another Zenon bubble. When this article is posted on Twitter/X, please drop your Nostr public key in comments or DMs if you are interested and we can iterate from there how to kickstart a Nostr presence.</p><figure></figure><h2 id="d788">Parting Thoughts</h2><p>There’s been different governance models throughout history. From ancient tribes to cyber DAOs. But one thing has always been the case: An asymmetry of power between the few and the many. But there is a great danger in assuming these things ebb and flow like a pendulum perpetually swinging. As birth, life, dying and death mimic spring, summer, autumn and winter; one can arrogantly and recklessly assume that over-policing thought and under-policing it will also oscillate back and forth; correcting as is the way of things.</p><p><strong>Wrong</strong>.</p><p>We are at a point in history where tech advancements are so powerful <strong>they are a pandora’s box</strong>. Once open, what comes out changes things forever. For better or for worse. In ancient times, a serious war could mean a hundred people dead. Today? A serious war could mean humanity ends overnight. ‘History repeating itself’ is simply not the case when you consider the pandora’s box element.</p><p>For worse—<strong>a dystopian future enabled by technology</strong>. Cameras with facial recognition technology, programmable fiat with zero sovereignty and zero privacy. Soulless robots tasked with bullying the underclass of humans, exploiting them to the maximum. All dissent squashed. 1984 basically.</p><p>For better—<strong>a just future enabled by open-source protocols</strong>. Money which can’t be stopped, communication which can’t be stopped, and programming which can’t be stopped. Bitcoin, Nostr and Zenon respectively. Entities which empower people and provide a protection against future subjugation. A libertarian dream essentially.</p><p>Important cultural figures are already advocating for Nostr and Bitcoin, but they can’t do it alone. As these protocols help you, you must help these protocols. So use them and spread the word. Persist until a critical mass is achieved and a new cultural paradigm ushered in— a global society of sovereign individuals who are able to collaborate in peace and freedom. Through them we are our own salvation.</p><p>And as mentioned earlier: Giving power back to people is what this revolution is about. So they can be treated better and enjoy better outcomes. So while greed has its place in drawing in new users for the sake of reaching critical mass, it is not the core of the machine. It’s wanting the best for other people. The great engine turns from love, not war and is therefore our highest selves brought to soar.</p><figure><figcaption>“Zenostroin.”</figcaption></figure><h2 id="cc6e">Thanks for reading!</h2><p>– Zyler</p><h2 id="e264">Join The Community</h2><p><a href="https://zenon.network/" target="_blank">Zenon.Network<br /></a><a href="https://twitter.com/Zenon_Network" target="_blank">Twitter/X<br /></a><a href="https://t.me/zenonnetwork" target="_blank">Telegram</a> <br /><a href="https://discord.com/invite/zenonnetwork" target="_blank">Discord</a><br /><strong>Zenon Community Public Key:<br /></strong>npub1msvlamqj6j5azykts7sewtzr062a0km0p4hajw2dmchtm5xpz0aqylw09w<br /><strong>My Public Key:<br /></strong>npub1jxryf2n8vypl9nppjlwnnwzmkh6tpzsnh34u9h6mux9h40p839dsuj6trv</p><h2 id="4c8b">Sources</h2><p><a href="https://nostr.com/" target="_blank">Nostr Website<br /></a><a href="https://nostr.com/clients" target="_blank">List of Suggested Nostr Clients</a></p><h2 id="a70b">The Zyler Reading List</h2><ol><li><a href="https://twitter.com/zyler9985/status/1735373467577663905" target="_blank"><strong>The Zenon Storybook</strong></a> (updated version coming soon)</li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-iii-game-theory-for-progressive-decentralisation-38f94457b03e"><strong>Progressive Decentralisation</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-a-blistering-need-for-speed-ce34246c2f01"><strong>A Blistering Need For Speed</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-viii-alien-plans-for-bitcoin-804e1ba60a3c"><strong>Alien Plans For Bitcoin</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/why-zenon-is-regulation-proof-b696c3a03d0d"><strong>Why Zenon Is Regulation-Proof</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenons-synergy-with-nostr-c36fe2bf955c"><strong>Zenon’s Synergy With Nostr</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-merged-mining-bitcoin-fb7ccf60161e"><strong>Merged Mining Bitcoin</strong></a><strong> </strong>(updated version coming soon)</li><li><a target="_blank" href="https://medium.com/@Zyler9985/how-zenon-mirrors-the-bitcoin-ethos-142300e59e64"><strong>How Zenon Mirrors The Bitcoin Ethos</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/the-zenon-ethos-4e0ab0dff12b"><strong>The Zenon Ethos</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-a-noir-story-a06cc8945439"><strong>Zenon Network: A Noir Story</strong></a></li><li><a href="https://www.slideshare.net/zylert888/the-dream-of-satoshis-ethereumpdf" target="_blank"><strong>The Dream of Satoshi’s Ethereum</strong></a></li><li>Zenostroin. An educational novella coming in 2024 or 2025. It won’t be “spicy” like Mr Kaine’s Tempest (sorry). But for spice fiends, there is also a sequel for Tempest called The Alien Phantasm coming 2024 or 2025.</li></ol></div>",
  "author": "Zyler9985",
  "favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
  "source": "medium.com",
  "published": "2023-12-24T16:16:38.417Z",
  "ttr": 511,
  "type": "article"
}