{
	"url": "https://medium.com/@Zyler9985/zenon-network-ii-press-start-2p-47847aa68645",
	"title": "Zenon Network II: Press Start 2P",
	"description": "Voltaire once wrote that work spares us from three great evils: Boredom, vice and need. Clearly this wig-donning, frog-leg-soup-guzzling workaholic had never even heard of a PS4! It’s not his fault, he was...",
	"links": [
	  "https://medium.com/@Zyler9985/zenon-network-ii-press-start-2p-47847aa68645"
	],
	"image": "https://miro.medium.com/v2/resize:fit:949/1*-fE7P9TrjWtha7GHeTL5dQ.jpeg",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----47847aa68645--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>Voltaire once wrote that work spares us from three great evils: Boredom, vice and need. Clearly this wig-donning, frog-leg-soup-guzzling workaholic had never even heard of a PS4! It’s not his fault, he was from a different era. These days, video games have come a long way. Their immense popularity has even led to the phenomena of Gamification — the art of designing systems such that participants feel like they are hustling in a video game rather than working hard. If successfully executed, this subtle psychological shift can be a blessing in someone’s life as they now find themselves being productive in a way that is also fun and motivating.</p><p>This article aims to present <a href="https://zenon.network/" target="_blank">Zenon Network’s</a> design through the lens of Gamification; the basic thesis being that participating in the network and contributing to the ecosystem is akin to playing a video game. The difference being of course that the rewards are tangible in the form of the native utility tokens of Zenon Network which are $ZNN (governance) and $QSR (gas).</p><p>Disclaimer: This article is not financial advice and may contain speculation</p><figure><figcaption>Grand Theft Hales: Degen City</figcaption></figure><h2 id="2f2e">Researching the game before you get it</h2><p>For those of you who don’t know, Zenon Network is a new layer-1 crypto with a mainnet which went live in November of 2021. The egalitarian launch of the project and its initial distribution of coins are just one of the many ways Zenon closely adheres to the Bitcoin ethos — this is for the sake of achieving true decentralisation. You can read more about that <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-game-theory-for-progressive-decentralisation-97dd65b417a9">here</a>.</p><p>Zenon Network innovates by have a dual-ledger architecture; this allows for a unique approach to the blockchain trilemma. Zenon is working on an implementation of Narwhal and Tusk which is theorised to bring extreme scalability. Zenon is feeless at the protocol level with a novel anti-spam mechanism utilising the second coin. Zenon aims to leverage the taproot upgrade to bring both interoperability and defi with native Bitcoin. Layer-2s are currently being built which will host the smart contracts; keeping the base-layer minimalist and efficient.</p><h2 id="cb83">Starting a new game</h2><ol><li>You will need to <a href="https://github.com/zenon-network/syrius/releases/tag/v0.0.6-alphanet" target="_blank">download the SYRIUS wallet</a> from the main site zenon.network and follow the instructions to sync the embedded node (recommended) or connect to a public node to sync instantly.</li><li>You can buy wZNN or wQSR through the <a href="https://app.uniswap.org/#/swap?inputCurrency=ETH&amp;outputCurrency=0xb2e96a63479c2edd2fd62b382c89d5ca79f572d3" target="_blank">DEX Uniswap</a>. Then you can use the <a href="https://bridge.mainnet.zenon.community/" target="_blank">NoM Multichain Portal</a> (a bridge) to send those coins into the SYRIUS wallet where they will become native ZNN and QSR.</li><li>Another way to initially get your coins is by finding work in the ecosystem. ‘Accelerator Z’ is an on-chain funding mechanism where all you need is creativity. See this landing page <a href="https://forum.zenon.org/t/welcome-new-devs/1540/3" target="_blank">here</a> for new devs and workers to orient yourself with what jobs there are and examples of how to make a proposal to get funded. Applicants apply through the SYRIUS wallet to be funded in ZNN &amp; QSR as per a voting decision made by the DAO.</li></ol><h2 id="cdec">Levelling up your character</h2><p>There are six levels of participation in Zenon. We will cover what they are, how it helps the network (which ties into why they are incentivised with rewards) and conclude with a suggested pathway to let you rise through the rankings and make your character as OP as a Skyrim character with 100 smithing AND 100 enchanting!</p><p><strong>LEVEL ONE</strong>: As a <strong>No-coiner</strong>, the advantage of joining Zenon is the ultra-low entry barrier due to its feeless design. Even if you don’t have any QSR, for basic transactions you can do a proof of work calculation — meaning if you send 1 ZNN, the other person receives 1 ZNN. Even bridging from wZNN to ZNN is feeless. With the risk of being left behind in the wake of hyperinflation of fiat and the corresponding hyperbitcoinisation trend, it is not recommended to stay as a no-coiner! Visit <a href="https://zenon.tools/overview" target="_blank">Zenon Tools</a> and play around with the calculator section to see the possible yields.</p><p><strong>LEVEL TWO</strong>: As a <strong>Delegator</strong>, you only need ZNN and it can be in any amount. Your rewards are in ZNN. You choose which pillar/validator to delegate to. Your ZNN is not locked or transferred. This adds weight to that pillar, influencing its ranking and how often it receives rewards. In turn, it can share rewards with you. Delegating helps the network because it incentivises good behaviour from validators so they can be seen as worthy candidates to delegate to. See this <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-8-tips-for-delegators-a45d223b5eb5">article</a> for 8 tips for delegators.</p><p><strong>LEVEL</strong> <strong>THREE</strong>: As a <strong>Staker</strong>, you only need ZNN and it can be in any amount. Your rewards are in QSR. You lock your ZNN in multiples of 1 month, up to a maximum of 12 months. Locking for a longer period of time applies a multiplier effect to your rewards, up to a maximum of a 2X. Staking helps the network because it locks up liquidity, minimising the capacity for a centralised actor to buy large amounts in times of market volatility/ a price crash.</p><p><strong>LEVEL FOUR</strong>: As a <strong>Liquidity Provider</strong>, you currently need ETH-wZNN or ETH-wQSR to be able to join the liquidity pools and start earning. Rewards are in both ZNN &amp; QSR regardless of which token you choose to LP for. LPing helps the network by facilitating the smooth in-flow and out-flow of capital as part of a dynamic ecosystem. Zenon Network is unique in the crypto space because its liquidity program is supplied directly by protocol emissions; meaning it will last as long as the network itself does. See <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-building-bridges-draft-article-for-feedback-4bb2ef8af7eb">this article</a> for more about the bridge &amp; liquidity program.</p><p><strong>LEVEL FIVE</strong>: To run a <strong>Sentinel</strong>, you need 5k ZNN and 50k QSR which get locked as collateral, with a 3-day unlocking period available every month. They earn both ZNN and QSR. Sentinels help the network by playing a role in the consensus through adding proof of work links.</p><p><strong>LEVEL SIX</strong>: To run a <strong>Pillar</strong>, you need 15k ZNN and at least 150k QSR. The QSR gets burned. The amount of QSR required increases by 10k for each new pillar erected; at time of writing it requires approx 290k QSR to be burned. Pillars earn ZNN only, and they can cast votes in the DAO. Pillars help the network by validating transactions and by voting/governing the network. They can also sponsor activities and host sub-communities. Because Pillars only earn ZNN, this mitigates the tendency for validators to centralise over time. See <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-game-theory-for-progressive-decentralisation-97dd65b417a9">this article</a> for a more indepth discussion of how the dual-coin tokenomics promotes progressive decentralisation.</p><p><strong>WALKTHROUGH</strong>: Here is a suggested pathway for your character’s ascension through the hierarchy. You begin by attaining ZNN — either buy it outright or earn it from doing valuable work in the ecosystem. Now you have some ZNN, delegate it to earn even more ZNN. Once you have enough ZNN, stake some or all of it to earn QSR. Later, once you have both ZNN and QSR, provide liquidity to earn both ZNN and QSR. Now you are earning from delegating, staking and LPing. Later, if and when you get to 5k ZNN and 50k QSR, you can run a sentinel to earn both ZNN and QSR. Much later on, if and when you attain the 15k ZNN and 150k+ QSR required, you can finally spawn a pillar and be among the ranks of Zenon royalty.</p><p>As a side note, while beating the game is very hard to do and surely immensely satisfying, ‘victory’ is really defined by goals appropriate for you. For many people their target is level 4 or 5. As long as you make the most of the hand you were dealt, you’re doing well.</p><h2 id="3669">Alien Rankings:</h2><figure></figure><h2 id="fade">Parting Thoughts</h2><p>Levelling up your character and unlocking new and powerful levels of participation is undoubtedly fun and addictive. But Zenon’s gamification goes beyond that. This emerging ecosystem has plans for NFTs, Apps and more. With crypto gaming you will have the potential to monetise your time by playing to earn. Furthermore, reading this <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-a-noir-story-a06cc8945439">short story/article</a> hybrid about Zenon’s origins raises some interesting questions about the anonymous founders. At first glance Zenon is a straight-forward RPG … or does it have an unlockable puzzle game? DYOR!</p><p>Regardless, there’s a saying which is play stupid games, win stupid prizes. So put away that playstation! You’ve had enough fake XP points for one day, it’s time to make your parents proud by earning real ZNN &amp; QSR. Follow the green rabbit and you may yet find out just how deep the rabbit-hole goes …</p><p><strong>Thanks for reading. Get Zenonized and WAGMI!</strong></p><h2 id="56e4">Useful Links</h2><p><strong>NEXT article in the series </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-iii-game-theory-for-progressive-decentralisation-38f94457b03e"><strong>HERE</strong></a><br />First article in the series <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-i-the-green-pill-883e608727a">here</a> <a href="https://zenon.network/" target="_blank"><br />The Main Site</a> as well as a <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-how-to-buy-znn-and-store-it-in-the-syrius-wallet-65a8f3ced4db">Buying/SYRIUS Wallet Tutorial</a><br /><a href="https://twitter.com/Zenon_Network" target="_blank">The Official Twitter</a> and a <a href="https://twitter.com/Learn_Zenon" target="_blank">Community Twitter</a><br /><a href="https://discord.com/invite/zenonnetwork" target="_blank">Discord</a> and <a href="https://t.me/zenonnetwork" target="_blank">Telegram</a><br />The Dev Forums <a href="https://forum.zenon.org/" target="_blank">here</a> and <a href="https://forum.hypercore.one/" target="_blank">here</a><br />Are you a dev looking to work for Zenon and get paid? See a community-made landing page <a href="https://forum.zenon.org/t/welcome-new-devs/1540" target="_blank">here</a></p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2023-07-13T15:38:01.116Z",
	"ttr": 291,
	"type": "article"
  }