{
	"url": "https://medium.com/@Zyler9985/zenon-network-vi-welcome-to-the-multiverse-a7c1cbedc94c",
	"title": "Zenon Network VI: Welcome To The Multiverse",
	"description": "The future is multi-chain, and ZNNAliens are here to deliver this. A significant milestone in Zenon Network’s ecosystem was reached with the release of an audited bridge to Ethereum, complete with a program...",
	"links": [
	  "https://medium.com/@Zyler9985/zenon-network-vi-welcome-to-the-multiverse-a7c1cbedc94c"
	],
	"image": "https://miro.medium.com/v2/resize:fit:949/1*e8ccVRVECxdmTtgyngvXRA.jpeg",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----a7c1cbedc94c--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>The future is multi-chain, and ZNNAliens are here to deliver this. A significant milestone in <a href="https://zenon.network/" target="_blank">Zenon Network’s</a> ecosystem was reached with the release of an audited bridge to Ethereum, complete with a program to incentivise liquidity providers. This article discusses the bridge, the audit, the liquidity program and the benefits this brings to the ecosystem.</p><p>Disclaimer: This article is not financial advice and may contain speculation</p><figure><figcaption>A multiverse is still a universe of one.</figcaption></figure><h2 id="3eed">The Bridge &amp; Audit</h2><p>The decentralised bridge to Ethereum which has been released is actually a subset of the NoM Multichain Technology. This infrastructure facilitates interoperability with other networks such as Ethereum (already supported), BNB Chain and later Bitcoin. You can learn more about the plans for Bitcoin interoperability <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-alien-plans-for-bitcoin-draft-for-feedback-3bc7e4ac2f84"><strong>here</strong></a>. Because it involves innovative solutions such as the use of TSS technology, some of these future developments wouldn’t strictly classify as a bridge which is why the nomenclature for ‘Portals’ to other networks has been adopted by the Zenon Community.</p><p>Despite wide agreement on the value of interoperability, there exists concerns about the security of cross-chain bridges in the crypto space. This is understandable given the spate of exploits which have occurred; some of them high-profile. This is why the bridge was built with security being the core focus alongside its function.</p><p>The bridge was designed with multiple layers of security that utilise innovative mechanisms to achieve a synergistic effect. For example if abnormal activity is detected, this triggers a novel delay mechanism — this creates time for other security measures to take effect. These additional measures are partly automated, partly manual and fully designed to neutralise malicious actors. In the case of a running exploit, the final layer of security is a full halting of the bridge, followed by a disaster-recovery protocol facilitated by guardians elected by the DAO. These guardians are technically savvy, have been in Zenon for a long time and are running validator nodes (the QSR burn required to spawn a validator incentivises a longterm view of network prosperity).</p><p>Obviously some things can sound good in theory, but are they practical and sound in execution? To this end the ~3k lines of code which comprise the bridge have been exhaustively tested by a comprehensive battery of assessments probing for vulnerabilities. There have been unit-tests, static analysis, fuzzing/property-based testing, mutation testing, internal audits, community audits, manual testing and an external professional audit.</p><p>Chainsafe.io was officially contracted to audit the bridge. Community member Sumamu and his team should be proud of the results, because no vulnerabilities were identified. The executive summary explains there were zero issues found of a critical, major or minor nature. The only points of discussion were 16 informational/optimization issues of a benign nature.</p><h2 id="ee12">The Liquidity Program</h2><p>The Orbital Liquidity Program was created to incentivise liquidity pools to form between Zenon and other blockchains. Because of Zenon Network’s unique dual-ledger architecture, there are two tokens which power the network. They are:</p><ol><li><strong>Zenon | ZNN</strong> | Governance &amp; Running infrastructure</li></ol><p>2. <strong>Quasar | QSR</strong> | Gas &amp; Running infrastructure</p><p>The wrapped versions of ZNN and QSR will be available on Ethereum to trade with other erc-20 tokens. Swapping from Ethereum to Zenon will be feeless, because Zenon Network is a feeless layer-1 (QSR is not burnt for gas, but is locked for time to generate ‘plasma’ to manage transaction throughput &amp; complexity).</p><p>So going from wZNN to ZNN, or from wQSR to QSR, is feeless. But going from ZNN to wZNN, or from QSR to wQSR, does incur an X% fee. The X% fee supports an affiliate marketing system. The current upper limit for this fee is 3%, but it is expected to decrease over time pending the DAO’s decision which takes into account multiple factors. The benefit is that marketers can be given both an incentive to grow Zenon as well as the means to measure their performance in a way which directly relates to price, liquidity and volume — hard and sound metrics to make sure the value added can justify the spend.</p><p>To give an example of how this works: Each time a person leaves Zenon’s ecosystem, the 3% fee becomes embedded into the bridge contract. When someone else enters Zenon’s ecosystem via an affiliate link a marketer has generated, the buyer receives a 1% bonus and the marketer receives the other 2%. The 1% and 2% bonuses are supplied 1:1 by the 3% fee, making this a self-sustaining mechanism which also scales infinitely with price.</p><p>The Orbital Liquidity Program was designed to mitigate risk and provide ample rewards for liquidity providers. It does that in a number of ways which are explained below, but one of the key takeaways is that this is Protocol Level Liquidity — so LP rewards come directly from network emissions. This means the Liquidity Program is governed by the DAO and has the capacity to be readily replenished if need be. Longterm sustainability is therefore a core feature of this Liquidity Program.</p><p>The rewards are in both ZNN and QSR, which come from protocol-level emissions at a baseline of 561.6 ZNN/day and 1250 QSR/day. On top of this, there are Bootstrap Rewards to incentivise early participants. Finally, there is also a liquidity multiplier to reward longterm commitment. This begins at 1 month (for a 1X multiplier) and increases in monthly increments up to a maximum of 12 months (for a 12X multiplier).</p><h2 id="336b">Benefits to the Ecosystem</h2><p>The NoM Multichain Bridge and the Orbital Liquidity Program provide the foundation for Zenon’s interoperability and growth. A number of exciting milestones are upcoming in Zenon’s roadmap, and if this leads to increased interest in Zenon then a reliable DEX solution is essential to facilitate the smooth inflow of capital — and with it builders, marketers and users.</p><p>Because it is still a work-in-progress, you may need to browse the <a href="https://forum.zenon.org/latest" target="_blank">forum</a> to learn about this in-depth. But the NoM Multichain Bridge is more than just a bridge — it is a foundation for further important tech developments.</p><p>For example, there are plans for a Layer-2 implementation to bring EVM/WASM compatibility to Zenon Network. The rational for this is so the base layer can remain feeless, simple and efficient; heavy work and transaction bloating will be kept in a separate execution domain. There is discussion of bridging ZNN to this extension chain where gas fees will be used.</p><p>Furthermore, cornerstones of the NoM Multichain tech are MPC (multi-party computation) and TSS (threshold signature schemes). TSS allows a threshold of T participants from a total of N to jointly compute some data. Basically, a specified majority can provide a signature to approve the spending of assets. Thanks to the taproot upgrade to Bitcoin, there are plans to use TSS technology to control native Bitcoin. To learn more about these plans for Bitcoin interoperability with Zenon, read the next article in the series.</p><p><strong>Thanks for reading. Get Zenonized and WAGMI!</strong></p><h2 id="56e4">Useful Links</h2><p><strong>NEXT article in the series </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-vii-8-exciting-things-coming-to-zenon-ab09b59ac48d"><strong>HERE</strong></a><strong><br />FIRST</strong> article in the series see <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-i-the-green-pill-883e608727a">here</a><br /><a href="https://zenon.network/" target="_blank">The Main Site</a> as well as a <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-how-to-buy-znn-and-store-it-in-the-syrius-wallet-65a8f3ced4db">Buying/SYRIUS Wallet Tutorial</a><br /><a href="https://twitter.com/Zenon_Network" target="_blank">The Official Twitter</a> and a <a href="https://twitter.com/Learn_Zenon" target="_blank">Community Twitter</a><br /><a href="https://discord.com/invite/zenonnetwork" target="_blank">Discord</a> and <a href="https://t.me/zenonnetwork" target="_blank">Telegram</a><br />The Dev Forums <a href="https://forum.zenon.org/" target="_blank">here</a> and <a href="https://forum.hypercore.one/" target="_blank">here</a><br />Are you a dev looking to work for Zenon and get paid? See a community-made landing page <a href="https://forum.zenon.org/t/welcome-new-devs/1540" target="_blank">here</a></p><h2 id="ae9a">Additional Links</h2><p><a href="https://hypercore-team.github.io/" target="_blank">The NoM Multi-chain Infrastructure documentation</a><br /><a href="https://forum.zenon.org/t/welcome-to-the-multiverse-bridging-the-zenon-ecosystem/932" target="_blank">Introductory post on the Zenon Community Forum</a><br /><a href="https://www.zenon.info/zenon-network-trustless-bridge-ama/" target="_blank">The Community AMA</a><br /><a href="https://www.zenon.info/liquidity-bootstrap-provisioning-campaign/" target="_blank">The Liquidity Program Article</a><br /><a href="https://www.zenon.info/chainsafe-zenon-network-bridge-audit/" target="_blank">The Chainsafe Audit Article</a></p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2023-07-13T15:13:54.943Z",
	"ttr": 240,
	"type": "article"
  }