{
	"url": "https://medium.com/@Zyler9985/zenon-forum-nom-101-569e0dac4f8a",
	"title": "Zenon Forum: NoM 101",
	"description": "This article is hopefully quick and easy to read for a beginner. It covers:What is the Network of Momentum?What makes ZNN different?How the fair launch of Zenon was a game changerFeeless transactions and dual...",
	"links": [
	  "https://medium.com/@Zyler9985/zenon-forum-nom-101-569e0dac4f8a"
	],
	"image": "",
	"content": "<article><div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----569e0dac4f8a--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>This article is hopefully quick and easy to read for a beginner. It covers:</p><ul><li>What is the Network of Momentum?</li><li>What makes ZNN different?</li><li>How the fair launch of Zenon was a game changer</li><li>Feeless transactions and dual coin mechanics</li></ul><h2 id="4e60">What is the Network of Momentum?</h2><ul><li>Zenon, also known as the Network of Momentum, is a layer 1 crypto. Other layer 1s are Ethereum, Cardano, Solana, Avax — any network which functions independently of others. Zenon aims to become the global standard for defi with Bitcoin, now possible thanks to the taproot upgrade. Also aims to be the leading platform for NFTs and apps (defi, gamefi, IoT, storage, general web3 etc.)</li><li>The above mentioned layer 1s are all single-ledger technology. For example, Ethereum has $ETH and Cardano has $ADA. Zenon is unique in the crypto space as it pioneers dual-ledger technology. The Network of Momentum has Zenon $ZNN and Quasar $QSR. The dual-ledger is theorised to solve the blockchain trilemma of security, scalability and decentralisation.</li><li>The above mentioned layer 1s are all launched with pre-mines/pre-sales/ICOs/backed by VCs and are also proof of stake. They’re playing a rigged game where the network is owned and controlled by centralised entities. Zenon is unique in the crypto space because it was fairly launched. An innovative mechanism named xStakes was used to recruit Bitcoiners for the launch. Only grassroots marketing for the first 3 years to spread awareness and ownership in a low-key manner such that Zenon is fully decentralised and owned by the people. It is PoW and PoS.</li><li>The above mentioned layer 1s all have fees which are sometimes very high. Zenon does things differently — it is a completely feeless platform. Users can do a transaction via their computer doing a proof of work calculation. Users can also utilise the second coin $QSR. If they lock their $QSR, they generate ‘plasma’ to allow for greater throughput and more complexity.</li><li>Both coins are used for setting up nodes. Apart from infrastructure, $ZNN is used in governance. Delegators can shift their $ZNN weight to pillars who vote and behave in a way that represents their interests. And pillars are incentivised to maximise their weight through clever game-theory. $QSR provides ‘gas’ to users without being spent, allowing for faster or more complex transactions.</li><li>Emission rates for both $ZNN and $QSR are decreasing, but ways you can earn yield are through the SYRIUS wallet by running nodes (sentinel or pillar), delegating, staking or providing cross-chain liquidity. Every SYRIUS wallet has its own node embedded within, allowing everyone privacy and security while they verify every transaction.</li></ul><p><strong>Take care and WAGMI!</strong></p><p>– Zyler</p></div></article>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2022-05-27T17:18:52.044Z",
	"ttr": 85,
	"type": "article"
  }