{
	"url": "https://medium.com/@Zyler9985/zenon-network-vii-8-exciting-things-coming-to-zenon-ab09b59ac48d",
	"title": "Zenon Network VII: 8 Exciting Things Coming To Zenon",
	"description": "The purpose of this article is to briefly discuss 8 exciting things that are coming soon to Zenon’s ecosystem. Being a decentralised community-run project is a double-edged sword. On the one hand, we are a...",
	"links": [
	  "https://medium.com/@Zyler9985/zenon-network-vii-8-exciting-things-coming-to-zenon-ab09b59ac48d"
	],
	"image": "https://miro.medium.com/v2/resize:fit:949/1*C-xo4O2Q6GK_cTaz5T6CCA.jpeg",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----ab09b59ac48d--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>The purpose of this article is to briefly discuss 8 exciting things that are coming soon to Zenon’s ecosystem. Being a decentralised community-run project is a double-edged sword. On the one hand, we are a hive-mind of global contributors which acquires talent regardless of antiquated barriers such as country of origin, university degree, appearance, age, criminal history etc. (that last one was just for lols). On the other hand, being leaderless our stuff is all over the place! This is just the bittersweet hallmark of a nascent ecosystem.</p><p>So until we mature, here is a summary of the things our chad developers are working on or at least talking about. Even when this article is updated, it still cannot be considered a complete list of everything that is happening, it’s just a selection of what potential investors may find the most interesting.</p><p>Disclaimer: This article is not financial advice and may contain speculation</p><figure><figcaption>The best way to predict the future is to create it.</figcaption></figure><h2 id="1374">Foreword:</h2><p>This article is basically a slightly longer and cleaner version of the hardcore forum post <a href="https://forum.zenon.org/t/exciting-things-are-coming-to-zenon/1541" target="_blank">here</a>. The forum post is more likely to be updated.</p><h2 id="0ea4">1. A Layer-2 which is EVM Compatible</h2><p>The current philosophy is to keep the layer-1 minimal and efficient, and leverage layer-2s for the smart contracts. Aliencoder is working on a L2 which is EVM compatible. Its gas will be supplied by a wrapped version of ZNN and its purpose is to facilitate interoperability and adoption with the wider crypto ecosystem. Expect some NFTs and games to follow soon!</p><p>It is considered to be an extension chain, slated to be finished by the end of this year! (End Q4 of 2023). Check out the following links relating to it:<br /><a href="https://forum.zenon.org/t/extension-chains-smart-contracts-for-nom/1512" target="_blank">https://forum.zenon.org/t/extension-chains-smart-contracts-for-nom/1512</a><br /><a href="https://forum.zenon.org/t/evm-compatible-l2-under-works-by-sumamu/1393" target="_blank">https://forum.zenon.org/t/evm-compatible-l2-under-works-by-sumamu/1393</a></p><h2 id="dcc5">2. A Layer-2 which is very fast/highly scalable</h2><p>As said above, the current philosophy is to keep the layer-1 minimal and efficient, and leverage layer-2s for the smart contracts. Sumamu is working on a L2 which is very fast/highly scalable. It is a turing-complete zero-knowledge general computation scaling solution. The programming language is a new one called Cairo, and the smart contracts are called Starknet Contracts. There is research ongoing, but it may leverage unikernals (their simplicity could enable superior speed and security) and leverage Bitcoin as a data-availability layer.</p><p>I suspect this won’t be finished for a while, but anticipation is huge for this epic milestone. Check out the link below:<br /><a href="https://forum.zenon.org/t/side-chain-l2-scaling-solution/1438" target="_blank">https://forum.zenon.org/t/side-chain-l2-scaling-solution/1438</a></p><h2 id="b901">3. A Mobile Wallet With An Embedded Node</h2><p>There is a mobile wallet with an embedded node being worked on by DrBlaze. A first in the crypto space?! The community is very pumped about this. See the below link which contains a lot of gems if you sift through it, such as the screenshots for the designs for the user interface, as well as more recently links for people wanting to test out the alpha release on android (IOS/iphone testing coming zoon!) Do NOT use real funds just yet, still testing!! Check it out below:<br /><a href="https://forum.zenon.org/t/syrius-wallet-mobile-app/659/75" target="_blank">https://forum.zenon.org/t/syrius-wallet-mobile-app/659/75</a></p><h2 id="20b7">4. A Multichain Bridge+</h2><p>The “NoM Multichain Tech” looks like just an ETH bridge, but actually the code base is rich, and potent and has plans to later develop such interoperability solutions with Bitcoin and with BNB later on. We are calling them portals, hop on board the fancy wording train! It also has some code embedded to facilitate a link with the layer-2s being worked on, and it also supports an affiliate marketing system. Jeez, can it also make mochas with whipped cream on top? See below, it’s become a mega thread but well-worth powering through it!<br /><a href="https://forum.zenon.org/t/welcome-to-the-multiverse-bridging-the-zenon-ecosystem/932" target="_blank">https://forum.zenon.org/t/welcome-to-the-multiverse-bridging-the-zenon-ecosystem/932</a></p><h2 id="ed9e">5. The P2P Revolution Is Here!</h2><p>Hypercore Team are working on delivering peer-to-peer atomic swaps, leveraging HTLC/PTLC. There are also plans for a P2P marketplace. Using technology to eliminate trust is a core principle of the crypto movement. A CEX requires a level of trust and risk, so does a DEX but to a lesser extent. OTC trades requires trusting an escrow. The future is P2P and we are here to create trends, not follow them.<br /><a href="https://forum.hypercore.one/t/the-p2p-revolution-p2p-swaps-in-syrius/108" target="_blank">https://forum.hypercore.one/t/the-p2p-revolution-p2p-swaps-in-syrius/108</a></p><h2 id="0910">6. Network Upgrades!</h2><p>Almost all community devs are somewhat discussing and planning on working on network upgrades. To make the layer-1 very scalable we need to deliver dynamic plasma (the transaction throughput management mechanism of the NoM):<br /><a href="https://forum.hypercore.one/t/dynamic-plasma-discussions/62" target="_blank">https://forum.hypercore.one/t/dynamic-plasma-discussions/62</a></p><p>Later on the roadmap, people are also talking about consensus upgrades which will lead to the full realisation of the whitepapers vision (making sentinels an active player in the consensus). Since the NoM is DAG-based technology, there are plans to look at implementing Narwhal and Tusk for extreme scalability &gt;100k tps. This will be when clark kent takes his glasses off and becomes superman so stay tuned savvy degens!</p><h2 id="c939">7. Bitcoin Interoperability &amp; DeFi with Native Bitcoin</h2><p>There are some plans for Bitcoin interoperability, but likely the network needs more upgrades first before they can be implemented. We need the dynamic plasma and consensus/scalability to be fully built out as envisioned in the whitepaper. The <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-viii-alien-plans-for-bitcoin-804e1ba60a3c">next article</a> in this series explores the ideas in more detail for native Bitcoin interoperability.</p><h2 id="f6fa">8. You!</h2><p>Zenon Network is by and for the people. We are always looking for new devs, so we will briefly discuss how you can find work and get paid in the ecosystem. Alternatively you can see this forum post <a href="https://forum.zenon.org/t/welcome-new-devs/1540" target="_blank">here</a>.</p><p><strong>There are generally 4 ways you can help:<br />1 </strong>– You can join an existing team’s efforts<br /><strong>2 </strong>– You can work on a network need/job listing no one is working on yet<br /><strong>3 </strong>– You can create a proposal for a unique idea you have<br /><strong>4 </strong>– Don’t be afraid to post on discord, telegram or the forum if you are a bit confused and would like to talk directly to the dev community about how you can get involved</p><p><strong>There are generally 2 ways to get paid:<br />a)</strong> Apply to “Accelerator Z” this is the name for our on-chain funding system. You use the SYRIUS wallet to submit a proposal, and the DAO votes to accept it or not. It costs 1 ZNN to submit a proposal, and some may be willing to donate this if your idea is compelling enough. It is recommended to post on the forum first about your idea and to follow the suggested template for submitting a proposal<br /><strong>b)</strong> Your team leader pays you or a Pillar/Validator chooses to sponsor you privately from their own funds.</p><p>To see what has already been funded by Accelerator-Z, see <a href="https://zenon.tools/accelerator" target="_blank">here</a> and <a href="https://zenonhub.io/accelerator-z" target="_blank">here</a>.<br />To see job listings/network needs, see <a href="https://forum.zenon.org/t/exciting-things-are-coming-to-zenon/1541" target="_blank">here</a> and <a href="https://www.zenon.org/funding/programs/accelerator-z?_gl=1*ze2lwc*_ga*MzQ0OTU3Njk3LjE2NTA3MDcyMzk.*_ga_M2F8KJ59YQ*MTY4OTA1MTQ1NS4xNTc1LjEuMTY4OTA1MTYxNy4wLjAuMA.." target="_blank">here</a>.<br />To see how to make your own proposal, see <a href="https://www.zenon.org/funding/process?_gl=1*gq3ie9*_ga*MzQ0OTU3Njk3LjE2NTA3MDcyMzk.*_ga_M2F8KJ59YQ*MTY4OTA1MTQ1NS4xNTc1LjEuMTY4OTA1MTcwMy4wLjAuMA..#learn-zenon" target="_blank">here</a> and <a href="https://forum.zenon.org/t/zenon-network-accelerator-z-proposal-template/228" target="_blank">here</a>.</p><p><strong>Thanks for reading. Get Zenonized and WAGMI!</strong></p><h2 id="56e4">Useful Links</h2><p><strong>NEXT article in the series </strong><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-viii-alien-plans-for-bitcoin-804e1ba60a3c"><strong>HERE</strong></a><strong><br />FIRST</strong> article in the series <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-i-the-green-pill-883e608727a">here</a><br /><a href="https://zenon.network/" target="_blank">The Main Site</a> as well as a <a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-how-to-buy-znn-and-store-it-in-the-syrius-wallet-65a8f3ced4db">Buying/SYRIUS Wallet Tutorial</a><br /><a href="https://twitter.com/Zenon_Network" target="_blank">The Official Twitter</a> and a <a href="https://twitter.com/Learn_Zenon" target="_blank">Community Twitter</a><br /><a href="https://discord.com/invite/zenonnetwork" target="_blank">Discord</a> and <a href="https://t.me/zenonnetwork" target="_blank">Telegram</a><br />The Dev Forums <a href="https://forum.zenon.org/" target="_blank">here</a> and <a href="https://forum.hypercore.one/" target="_blank">here</a><br />Are you a dev looking to work for Zenon and get paid? See a community-made landing page <a href="https://forum.zenon.org/t/welcome-new-devs/1540" target="_blank">here</a></p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2023-07-11T08:03:34.135Z",
	"ttr": 223,
	"type": "article"
  }