{
	"url": "https://medium.com/@Zyler9985/zenon-network-an-introduction-to-governance-953aec64fda",
	"title": "Zenon Network: An Introduction to Governance",
	"description": "This article serves as an introduction to the governance of Zenon Network. We’re going to focus on how to empower ZNNAliens with education, the pillar-delegator relationship and some case studies of the DAO...",
	"links": [
	  "https://medium.com/@Zyler9985/zenon-network-an-introduction-to-governance-953aec64fda"
	],
	"image": "https://miro.medium.com/v2/resize:fit:676/1*zGl9Qua5t-8S4HVUY-3drg.png",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----953aec64fda--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>This article serves as an introduction to the governance of Zenon Network. We’re going to focus on how to empower ZNNAliens with education, the pillar-delegator relationship and some case studies of the DAO in action.</p><figure></figure><h2 id="5e6b">Education</h2><p>(1):<strong> Why participate in the governance of Zenon Network?</strong></p><p>All ZNNAliens have the power to influence or even swing the decision-making of the DAO. From a financial perspective, if you hold $ZNN you are invested in the network and should therefore care about its present and future. From a philosophical perspective, if you believe in the importance of Zenon’s mission you should therefore care about its present and future.</p><p>Exerting the power you have is the natural extension of caring for the NoM — not caring goes hand-in-hand with doing nothing. It doesn’t matter if you’re a mere delegator or a mighty pillar holder — the NoM is designed for inclusive participation by everyone.</p><p><em>I’m sure enough other people are paying attention, why should I bother?</em> This is the wrong attitude, because if everyone thought this way the network would be in dire trouble. You must be the change you wish to see in the world, and never underestimate the butterfly effect of one individual’s actions. Your participation matters.</p><p>(2):<strong> How can I make informed decisions?</strong></p><p>ZNNAliens are encouraged to first educate themselves before participating in the affairs of governance — otherwise they may not be helping despite having good intentions. At minimum, being Zenon-literate will help ZNNAliens to make an informed decision when they choose to engage or abstain from the various governing decisions.</p><p>To tell a brief parable: Socrates hated democracy. He likened it to being lost at sea, with dangerous rocks, and believed the experienced captain should steer the ship to safety, not the illiterate sailors who had never been in a storm before. But like Churchill said: “Democracy is the worst form of government — except for all the others that have been tried.”</p><p>The solution is to allow wide participation but encourage education. Be sure to finish this eight-part article series and also check out <a href="https://www.zenon.info/" target="_blank">Zenon Info</a> where you can find more articles and soon a wiki to empower yourself with knowledge. It is also a good idea to frequent the forums <a href="https://forum.zenon.org/" target="_blank">here</a> and <a href="https://forum.hypercore.one/" target="_blank">here</a> to read and partake in much of the important discussions being had.</p><h2 id="64e9">The Pillar-Delegator Relationship</h2><p>The relationship between delegators and pillars is multi-faceted, so we will break it down for the sake of simplicity and understanding.</p><p>(1):<strong> What is the incentive system?</strong></p><ul><li>Pillars are ranked by their weight, which is the total amount of ZNN delegated to them (which includes ZNN that has been self-delegated).</li><li>The weight of a pillar can change at any time if someone chooses to delegate to them, increasing their weight, or if they choose to un-delegate from them, decreasing their weight. Or maybe they remain delegated to them, but ZNN is added or removed from their address.</li><li>If a pillar is in the top 30, it will receive a much higher APY. At the time of writing, zenon.tools shows it will earn twice as much. As you can see, it can actually more profitable to share some of your rewards to delegators if it means entering the top 30.</li><li>Pillars are therefore incentivised to vote and act in a way that is agreeable to the majority of ZNNAliens, as this will increase the chances of gaining delegation weight and therefore entering/staying in the top 30. Consistently voting in an unpopular manner or behaving badly may result in losing delegation weight, therefore increasing their chances of leaving/staying outside of the top 30.</li><li>However, Pillars are also incentivised by virtue of ‘having skin in the game’. Because setting up a pillar burns a large amount QSR (they can’t ever get this back), there is a steep cost to spawning a pillar. The ROI comes from running their pillar for a long time, which incentivises them to make wise decisions for the longterm health and prosperity of the network.</li></ul><p>(2):<strong> What does each party typically do in the DAO?</strong></p><ul><li>Pillars are the only entities who can vote on-chain. They are the nodes which vote on everything DAO-related such as managing the treasury fund for grants, to assessing worker performance and passing or denying Zenon Improvement Proposals. Outside of these roles, pillars can also be active in the ecosystem — more on this in the case studies section.</li><li>Zenon Tools is an essential destination for every delegator. Once there, delegators can see a pillar’s voting history. They can search for a given issue and see who voted for what, or they can search for a specific pillar and see its entire voting history. Delegators can delegate or un-delegate to a pillar at any time with no locking period. Delegators can also split their ZNN across multiple addresses if they want to delegate to multiple pillars to support more than one entity. Zenon Tools also provides links to each pillar’s activities such as their social media, GitHub, website and more. Check out the link to Zenon Tools below:</li></ul><h2 id="1d3c">Case Studies</h2><p>Let’s cover a couple of examples of the DAO in action, with a focus on the decision-making from delegators. The scenarios cover Economic Delegation, Accelerator-Z Related Delegation, ZIP Related Delegation and Socials Related Delegation.</p><p><strong>Economic Delegation</strong></p><p><strong>Scenario</strong>: A relatively unknown pillar which seldom votes and has no links to its socials increases its rewards from 20/100 to 50/100.</p><p>Delegator A thinks it is only logical to switch delegation to this pillar to chase a slightly higher APY. They may not realise that this strategy can actually backfire in multiple ways:</p><ul><li>If the pillar is unreliable with its uptime, the delegator can check it a week later and find no rewards because if it’s not producing momentums, it is not going to have any rewards to share with its delegators.</li><li>If the pillar suddenly changes its reward sharing scheme without notice, that’s a precedent for them to do it again, and the delegator may check back in a week to see that it is back to 0/0.</li><li>By chasing a slightly higher APY, they are not supporting pillars doing good things for the ecosystem and by the end of the year, they may have an extra 1% yield, but the value of their bags may be 5–10% less because too many people chose to be short-sighted yield-chasers.</li></ul><p>Delegator B has recently updated their knowledge from both Zenon Info and Zenon Tools. They’ve found someone who shares some yield and does good things for the ecosystem — by helping them stay in the top 30, they are in a way paying them to continue working for them. Out of loyalty they stick with their chosen pillar — or pillars if they send ZNN to a second or third address.</p><p><strong>Accelerator-Z Related Delegation</strong></p><p><strong>Scenario</strong>: An AZ applicant submits a proposal for a project is which very technical and hard to understand, and they ask for the max allocation.</p><p>Pillar A engages with them <strong>on the forum</strong>, asking for their prior experience, more details on their proposal, and does the value added to the ecosystem justify the spend. As it turns out, the technicality of the proposal is challenging to implement at this point in time and for the amount of hours it would actually take to do, they are asking for an exorbitant reward.</p><p>Delegator A thinks that Pillar A did a good job of explaining to the community what the technical jargon was roughly referring to. Even non-technical people can now understand the main thrust of what the proposal was relating to. With that understanding, they can now also see that they were asking for too much funds — Pillar A unfortunately “had to be the bad guy”, but someone has to protect the AZ fund which is precious and limited, and it is to everyone’s benefit that it is rationed wisely where the value justifies the spend.</p><p>Delegator A decides to delegate a third of their ZNN to Pillar A, who is already in the top 30 but they want to play their part in ensuring they stay there.</p><p><strong>ZIP Related Delegation</strong></p><p><strong>Scenario</strong>: A ZIP is presented to the DAO, which seeks to disrupt the status quo of only pillars being the on-chain voting entities.</p><p>Delegator A argues that many pillars are not bothering to vote consistently, and expresses doubts about the incentive system working. They support the ZIP which is creating the ability for delegators to vote directly with their ZNN.</p><p>Delegator B argues that not only have all key decisions been handled well so far with the current model, but pillar participation has also been improving over time organically. Furthermore, changing the design may introduce unforeseen issues. Very large holders of ZNN could easily and disproportionately influence the vote — an issue with PoS networks, but remember that Zenon was intentionally designed to be PoS + PoW which mitigates some of these issues. There are also consensus metrics issues with this, which could be addressed by a 1:1 governance token, but that creates more problems such as multiple wallets/addresses, proof not a bot etc.</p><p>This discussion on the telegram chat <strong>moved to the forum</strong> so it could be an accessible &amp; structured debate <strong>easily referred back to</strong>. When it came time to vote — the people went to Zenon Tools. They went to search via the issue so they could see who voted for what, as it’s all verifiable on-chain.</p><p>The majority of pillars voted against the ZIP, but a handful voted for it. Delegator B saw that the pillar they were delegating to voted for the proposal, which is contrary to their position. While they’d had a good relationship up until this point, ultimately Delegator B decided to un-delegate from this pillar. It was a hard choice, but Delegator B felt the network was in safer hands if they supported one of the pillars who voted against it and therefore chose wisely (or what they believed choosing wisely to mean).</p><p>Delegator B did their due diligence on researching the pillars who voted no, and found two they wanted to support. They sent ZNN to their spare address and then delegated to both of them.</p><p><strong>Socials Related Delegation</strong></p><p><strong>Scenario</strong>: Delegator A is choosing between two similar pillars, Pillar A and Pillar B. Both of them vote consistently, and similarly, and both of them share similar rewards.</p><p>Delegator A goes to Zenon Tools to see an overview of the list of pillars. Pillar A does not have a picture, and does not even have links to a social media account — not much is known about this person.</p><p>Delegator A checks out Pillar B — here are links to their Twitter, their GitHub, their Medium account and a Telegram chat. From their Twitter, they see a history of them sharing Zenon content, supporting other ZNNAliens in various ways and generally them being active in the space. From their GitHub, they can see them contributing code to public and private repositories and providing tutorials for the community. In telegram, one of their Zenon friends tells an anecdote about something very kind that person once did.</p><p>Delegator A decides that Pillar B is someone they have been able to get to know over multiple mediums, and they like what they see — they choose to delegate to Pillar B.</p><h2 id="6867">Conclusion</h2><p><strong>Zenon Info</strong> is an essential destination for ZNNAliens to empower themselves with education. As for gathering information about a pillar’s voting history, their reward-sharing percentages, their outside activity — <strong>Zenon Tools</strong> is the key<strong> </strong>for all of this to be possible. Huge credit to <strong>Vilkris</strong> for taking the initiative to get this community project up and running. And be sure to check out the <strong>Zenon Tool’s donation page </strong>— at time of writing, if you visit the page there is a love-heart “Donate” you can click at the bottom-right of the screen. And finally, the <strong>Zenon Network Forum</strong> is crucial to hosting structured and easily-accessible discussion &amp; debate for various current topics. Credit to <strong>@ZenonORG</strong> (contributed the subdomain), and <strong>@romeo</strong> &amp; <strong>@0x3639</strong> for their efforts getting this cornerstone of the community up and running.</p><p>#TheAliensKnow that a well-informed population who take an active interest in their governance will help lift the ecosystem to greater heights. For many this journey begins in Zenon Info, stops off at Zenon Tools and the Zenon Network Forum and then continues on, exploring the vastness of Zenon’s universe.</p><h2 id="4f61">Important Links</h2><ul><li>Zenon Info, to empower ZNNAliens with education.</li><li>Zenon Tools, to allow ZNNAliens to research the pillars.</li><li>Zenon Network Forum, to allow ZNNAliens access to discussion/debate.</li></ul><p>((<strong>insert link to zenon.info when ready)</strong></p><p><strong>Take care and WAGMI!</strong></p><p>– Zyler</p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2023-06-19T14:02:18.239Z",
	"ttr": 412,
	"type": "article"
  }