{
	"url": "https://medium.com/@Zyler9985/zenon-network-faqs-for-beginners-d0df6d8d7476",
	"title": "Zenon Network: FAQs for Beginners",
	"description": "**FOREWORD**These FAQs are compiled by the community to help beginners and people who may be new to crypto. The language and concepts are at times simplified to promote understanding above all else, and where...",
	"links": [
	  "https://medium.com/@Zyler9985/zenon-network-faqs-for-beginners-d0df6d8d7476"
	],
	"image": "https://miro.medium.com/v2/resize:fit:577/1*_LrrPZCJfbCKmtCqe8OZTw.png",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----d0df6d8d7476--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><figure></figure><p><strong>**FOREWORD**</strong><br />These FAQs are compiled by the community to help beginners and people who may be new to crypto. The language and concepts are at times simplified to promote understanding above all else, and where appropriate will contain links for more comprehensive reading.<br />`<br /><strong>**HOW DO I BUY ZNN?** <br /></strong>Currently you can buy ZNN from pancakeswap or rango exchange. Check out the link below which is a step-by-step tutorial (pics included) for the process of buying ZNN and storing it inside the wallet. Also contains tips and tricks.</p><p>A CEX listing for ZNN on a major exchange is expected to occur at some point in the future.<br /><a href="https://forum.zenon.org/t/buying-how-to-buy-znn-zenon-network-on-pancake-swap/116" target="_blank">https://forum.zenon.org/t/buying-how-to-buy-znn-zenon-network-on-pancake-swap/116</a><br />`<br /><strong>**HOW DO I BUY QSR?**<br /></strong>Currently there is no market for QSR or wQSR, but it is expected to arrive soon.</p><p>In the meantime, you can earn QSR by staking, providing liquidity to the wBNB/wZNN pair or by running a sentinel. There is also an OTC trading channel on telegram, but beware of the risks involved using this method.<br />`<br /><strong>**HOW DO I STORE MY COINS IN THE SYRIUS WALLET?**<br /></strong>You need to use the BSC 2-way bridge to send your wZNN into the SYRIUS wallet where it will become native ZNN. The step-by-step guide below, complete with pics, shows you how to do this, as well as tips/tricks and work-arounds for any bugs.<br /><a href="https://forum.zenon.org/t/buying-how-to-buy-znn-zenon-network-on-pancake-swap/116" target="_blank">https://forum.zenon.org/t/buying-how-to-buy-znn-zenon-network-on-pancake-swap/116</a><br />`<br /><strong>**WHY SHOULD I STORE MY COINS IN THE SYRIUS WALLET?**<br /></strong>There are two reasons:<br />1) The safest place to store your coins is inside the SYRIUS wallet.<br />2) Once the coins are inside the SYRIUS wallet, you can earn rewards by delegating or staking them.</p><p>Check out zenon.tools to see how much APY you can earn. And be aware that the rewards may constitute taxable income depending on the laws of your country, so while you can store the coins inside the wallet without worrying, before actually staking or delegating it is recommended you consult with an accountant and/or lawyer to make sure you can comply with your tax obligations.<br /><a href="https://zenon.tools/overview" target="_blank">https://zenon.tools/overview</a></p><p>`<br /><strong>**WHY SHOULD I INVEST IN ZENON NETWORK?**<br /></strong>Ideally you would first do your due diligence with researching Zenon Network; see the link below for a page which provides easy access to articles, educational content and more. During this process, you may form your own investment thesis for Zenon Network — or you may decide that this project isn’t right for you. <br />&gt;&gt;&gt; link to a page which provides easy access to articles, educational content and more</p><p>`<br /><strong>**I HAVE A QUESTION THAT I CAN’T FIND IN THE FAQS, WHERE CAN I ASK IT?**<br /></strong>First of all, check the Mega FAQs post, which contains an extensive, comprehensive collection of questions and answers. If the answer can’t be found there, or in an article or educational resource — feel free to reach out to the community via the official telegram, discord or forum especially in the questions and help sections.</p><p>`<br /><strong>**ZENON NETWORK’S MISSION**<br /></strong>`<br /><strong>**WHAT IS ZENON NETWORK MAINLY TRYING TO ACHIEVE?**<br /></strong>Zenon as an ecosystem has a vast number of possibilities, but currently there are two main concentrated efforts that are ongoing:</p><p>1) To deliver defi with Bitcoin, now possible since the taproot upgrade in November 2021. The work towards BTC interoperability is ongoing, and may include interoperability with native Bitcoin.</p><p>2) To solve the blockchain trilemma and therefore deliver a new standard for Apps and NFTs. Zenon Network’s properties of being feeless, truly decentralised, extremely secure and ultra scalable will be inherited by anything built on the Network of Momentum.</p><p>`<br /><strong>**WHAT IS DEFI WITH BITCOIN?**<br /></strong>Defi is short for decentralised finance. Essentially, distributed ledger technology provides the foundation on which to build decentralised financial applications. For example, financial applications have been built on Ethereum. Their token is thus an erc-20 token. Zenon aims to have its own applications built, where their tokens will be known as ZTS tokens (which can be created without any coding required). Defi as a movement is challenging the traditional financial system with the short-term goal of running parallel to it. Bitcoin as the separation of money from state is essential to this outcome.</p><p>Currently Bitcoin functions much like digital gold, as a store of value, but smart contracts will open the door for many possibilities that Zenon aims to capitalize on. Pending the success of these efforts, we will sooner or later end up with advanced financial applications for Bitcoin that allow for peer-to-peer lending/borrowing, derivatives, prediction markets and general banking services etc.</p><p>`</p><p><strong>**WHY DOES DEFI WITH BITCOIN MATTER?**<br /></strong>Answering this question requires addressing separately why defi matters and why Bitcoin matters.</p><p>Defi carries a number of inherent advantages over the traditional financial system. To skim the surface, here are some of them: <br />– Superior privacy, as you don’t need to put at risk any personal details, you just connect your digital wallet. <br />– You have custody of your own funds, you don’t need to worry about governments or banks blocking access to your own money (which can happen, read the news). <br />– It is trustless as the protocol executes in a way predictable to the way it was programmed, you do not need to trust a person to act in good faith — and since the protocols are open-source they can be audited and scrutinised by anyone. <br />– Superior speed and cheaper cost for transactions, even for very large amounts of money. <br />– No such thing as “wait until the next business day” as the code is functional 24/7, 365 days a year.</p><p>Many people believe Bitcoin to be the most sound and hard money in history. With superior qualities, game-theory dictates that its adoption is inevitable and early-movers will be given a competitive advantage. That said, there are economic, political and cultural ramifications for Bitcoin that go beyond the scope of this FAQ. We encourage ZNNAliens to do their own research on Bitcoin for the benefit of themselves and others.</p><p>`<br /><strong>**UNDERSTANDING ZENON NETWORK**<br /></strong>`<br /><strong>**WHAT IS ZENON NETWORK? WHAT IS A “LAYER-1”?**<br /></strong>Zenon Network is a layer-1 blockchain. A “layer-1” network is one which can settle its own transactions without the need for outside help. For example, Bitcoin, Ethereum, BNB chain — each of these are layer-1s which process and finalize their transactions independently of other networks.</p><p>Think of a layer-1 as the base blockchain within its ecosystem. It is the main network which provides the foundation for building on.</p><p>`<br /><strong>**WHAT IS THE NATIVE COIN/TOKEN OF ZENON NETWORK?**<br /></strong>Because of its innovative and unique technology, Zenon Network actually has two native coins. They are Zenon ($ZNN) and Quasar ($QSR).</p><p>Most layer-1s (ETH, SOL, AVAX etc.) are single-ledger systems with 1 native coin. Zenon is a dual-ledger system with 2 native coins. This is by design, with the intention of providing a unique solution to solving the “blockchain trilemma” amongst other reasons.</p><p>`<br /><strong>**WHAT ARE THE USE-CASES FOR THE NATIVE TOKEN(S)?**<br /></strong>Both ZNN and QSR are required as collateral for running nodes, the infrastructure to keep the network functioning. In addition to this:</p><p>— ZNN is used in governance. You can choose which pillars to delegate your weight to, and even split your ZNN across multiple addresses to delegate to multiple pillars. Check the zenon.tools page to learn more about the pillars and their voting histories. If you choose to support a pillar by delegating, you increase their weight and once inside the top 30 pillars by weight they get an increased amount of rewards.</p><p>— QSR can be locked for a period of time to generate ‘plasma’. Plasma is the gas for the Network of Momentum, allowing for high transaction throughput and for complex transactions. The QSR is not spent or burned, it is only locked for a period of time as part of the NoM’s feeless paradigm.</p><p>`<br /><strong>**HOW IS ZENON DIFFERENT FROM ITS COMPETITORS? WHO ARE ITS COMPETITORS?**<br /></strong>The main things which distinguish Zenon Network as unique in the crypto space generally, as well as in relation to its competitors:<br />1. The architecture which is a dual-ledger (block-lattice + meta-DAG)<br />2. The fair launch/egalitarian distribution<br />3. The adherence to the Bitcoin ethos from day 1</p><p>It’s hard to find a direct competitor to Zenon, but at the time of writing some projects that are also working on defi with Bitcoin: $STX, $SOV, $RIF<br />`<br /><strong>**NODES**<br /></strong>`<br /><strong>**WHAT IS A NODE? CAN I EARN PASSIVE INCOME FROM IT?**<br /></strong>In the context of the crypto space, a node is when you use your computer to run software that validates and stores the complete transaction history of the network. There are different types of nodes, but all are essential to the security and health of the network.</p><p>It is part of decentralisation — the nodes talk to each other, rather than to a central server. They basically make sure that everyone has the same record in their ledger of transactions, which prevents anyone from cheating/double-spending or reversing transactions etc.</p><p>Because of the importance of certain types of nodes, there is often an incentive provided in the form of rewards for people to run them reliably.<br />`<br /><strong>**WHAT IS A PILLAR?**<br /></strong>Pillars are the most important type of node. Pillars form the foundation for the Network of Momentum. They secure and govern the dual-ledger state through a decentralised consensus protocol. They participate in consensus by validating transactions and updating the state of the ledger.</p><p>Pillars are the only actors which can vote on-chain. This may be in relation to many things such as releasing funds from the treasury or in relation to a ZIP (zenon improvement proposal).</p><p>If you run a pillar node, you earn rewards in ZNN. Pillars require 15 000 ZNN locked and at least 150 000 QSR to be burned (you can get your ZNN back, but you can not get your QSR back if you ever disassemble your pillar). The amount of QSR required increases with each new pillar that is created.<br />`<br /><strong>WHAT IS A SENTINEL?<br /></strong>Sentinels are full archival nodes that store, share, and passively validate the dual-ledger state. It is thought that sentinels, along with sentry nodes, will be oracle nodes for the NoM that will communicate and interact with information outside of the NoM. From the whitepaper: Sentinels are trustless nodes. They does not participate in the consensus algorithm directly; they are observers and cary out the creation of PoW links for transactions.</p><p>If you run a sentinel, you earn rewards in ZNN and QSR. You need to lock 5000 ZNN and 50 000 QSR to spawn a sentinel.<br />`<br /><strong>**WHAT IS A SENTRY?**<br /></strong>While sentinels are full archival nodes, a sentry is more lightweight in the sense that they only store the transaction ledger or a pruned version of it. It mainly monitors traffic for specific accounts allowing minimal network usage and resources. More is to be learned about sentry nodes in phase 1 which begins in late November of 2022.<br />`<br /><strong>**WHAT IS A SYRIUS EMBEDDED NODE?**<br /></strong>The SYRIUS wallet has its own node embedded in it, making it as simple as going to the settings and clicking a button to run your own node. The embedded node does not require collateral and does not earn rewards; it allows you to verify all transactions in the network. In a way it does reward you, because it provides: security, privacy, uptime, censorship resistance and decentralisation.<br />`<br /><strong>**GETTING INVOLVED WITH ZENON**<br /></strong>`<br /><strong>**HOW DO I PARTICIPATE IN THE GOVERNANCE OF ZENON**<br /></strong>Visit zenon.tools to see more information about the pillars such as their voting history, their reward sharing parameters and their activity in the ecosystem — all three things should be factored into your decision on which pillar to support with your delegation weight (which will therefore increase their rewards if it pushes them into the top 30 pillars by weight) or at least contributes to maintaining their position there.</p><p>As a couple of examples that are relevant at the time of writing; the ZenonORG pillars have been key to marketing efforts and early ecosystem development. The Zed pillar and the Tapwoot pillar have both got extremely high participation rates with voting, and have been known to offer funding towards community initiatives. As a delegator, you may want to support those you believe to be good for the ecosystem by delegating your ZNN to those pillars to make sure they stay in the top 30.</p><p>You can also browse the forum and contribute positively to discussions and debates as they occur.</p><p>`</p><p><strong>**HOW DO I WORK FOR ZENON? I HAVE DEVELOPER/MARKETING/SALES SKILLS.**<br /></strong>As a vast ecosystem there are many ways you can contribute. Check out the link below to see how you can offer your skills and be compensated for it:<br />* note, this is a temporary landing page for job listings until zenon.org is ready<br /><a href="https://forum.zenon.org/t/zenon-jobs-getting-started/807" target="_blank">https://forum.zenon.org/t/zenon-jobs-getting-started/807</a></p><p>`</p><p><strong>*HOW DO I MEET PEOPLE AND HANG OUT WITH OTHER ZNNALIENS?**<br /></strong>Currently, the various Zenon telegram chats are the best places to chat and have fun. The forum is more for serious communications, while twitter tends to be something in-between.</p><p>`<br /><strong>**I’D LIKE TO HELP OUT ZENON, BUT I’M NOT A VERY TECHNICAL PERSON. WHAT ARE WAYS I CAN HELP THE MOVEMENT?**<br /></strong>a) Spread the word to people in your network, both in real life and online. Link them reading material for awareness and education. Bonus points if you know builders directly, but you can also reach them indirectly by gathering more investors. More investors means a larger warchest to pay the builders with, and a larger warchest will also attract outside talent to join and add value to the ecosystem.</p><p>b) Make Zenon content yourself on social media, or like and share other people’s Zenon content if you enjoy it and think it is of a high quality.</p><p>c) Make positive contributions to discussions and debates about various things across the various mediums such as telegram, twitter and the forum.</p><p>d) Join the chats, have fun and make new friends in the Zenon social spaces. By strengthening the bonds between aliens, we create a loving and supportive community that will encourage and inspire the ecosystem to greater heights.</p><p>e) Anything else you can think of!</p><p>`</p><p><strong>*MISCELLANEOUS**<br /></strong>`<br /><strong>**HOW WAS ZENON NETWORK LAUNCHED?**<br /></strong>There were was no team pre-mine, no pre-sale rounds, no insider or VC allocations. The initial distribution was 100% public with the same conditions for everyone. Initial BTC contributors were algorithmically refunded their BTC over a timeframe of 18 months (therefore, the initial distro technically wasn’t a sale but more like a bond).</p><p>This unusual but principled launch has positive ramifications for the decentralisation of the network, and therefore its health and longevity. Learn more about this in the link below:<br />(link to the part of the wiki discussing the launch)</p><p>`<br /><strong>**WHERE ARE THE CORE TEAM BASED?**<br /></strong>It’s anyone’s guess, it could be in California or Tanzania for all we know.</p><h2 id="a79c">Take care and WAGMI!</h2><p>– Zyler</p></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2022-07-26T16:54:04.511Z",
	"ttr": 473,
	"type": "article"
  }