{
	"url": "https://medium.com/@Zyler9985/zenon-network-iii-game-theory-for-progressive-decentralisation-38f94457b03e",
	"title": "Zenon Network: Game-Theory For Progressive Decentralisation",
	"description": "In the beginning, the stirring promise of a utopia. In time, this tantalising mirage evaporated. A victim of its own immaturity, the crypto landscape has been marred by greed, terraformed by white-collar...",
	"links": [
	  "https://medium.com/@Zyler9985/zenon-network-iii-game-theory-for-progressive-decentralisation-38f94457b03e"
	],
	"image": "https://miro.medium.com/v2/resize:fit:949/1*dJ-xc5g5rUzgQ029OafUdw.jpeg",
	"content": "<div><div><a target="_blank" href="https://medium.com/@Zyler9985?source=post_page-----38f94457b03e--------------------------------"><div><p><img alt="Zyler9985" src="https://miro.medium.com/v2/resize:fill:88:88/1*KaL4NYzSxXL6fDt1krksEA.png" /></p></div></a></div><p>In the beginning, the stirring promise of a utopia. In time, this tantalising mirage evaporated. A victim of its own immaturity, the crypto landscape has been marred by greed, terraformed by white-collar crime. Fraud of all flavours, not just Ponzi vanilla. Organised pump and dumps, opaque processes with no accountability, bribery of regulators, deception, gaslighting, ‘hacks’ (heists by insiders) …</p><p>It’s enough to make any bleeding-heart idealist go on a wine-drenched rant about the bottomless well of sin in this world. <em>Why can’t we all just be good to each other? Why does the dark hand of corruption have infinite reach?</em></p><p>While ranting and wailing is a natural reaction to all of this, how about the next day we sober up and look for a practical solution?</p><p>You want maximal good, minimal evil? Consider that most actors are rational. Rational actors behave according to their incentives and disincentives. Don’t bother asking anyone to act right — just design a system with intelligent game-theory. In this article we’re going to examine the game-theory of Zenon Network wherever we can find it.</p><p>Disclaimer: This article is not financial advice and may contain speculation. Assumes familiarity with Zenon.</p><figure><figcaption>The pen is mightier than the sword; the keyboard mightier still.</figcaption></figure><h2 id="498b">Tokenomics For Progressive Decentralization</h2><p>What we don’t want is for existing validators to have a sharp advantage in setting up more of their own validators over time, as that concentration of power is clearly a centralising force. Obviously they still need to be incentivised with rewards, which constitutes an advantage, but we want to blunt that advantage.</p><p>A typical single-coin PoS system means that validators can just vegetate on a beanbag, barely lifting a finger to slurp the only thing required for them to spin up more validators — not cool. A dual-coin hybrid PoW-PoS system does not automatically fix this, but the way the NoM approaches it arguably does offer a vector in the decentralised direction to weaken this advantage.</p><p>To set up a new pillar, validators require the second coin, QSR. There are a few barriers/considerations/costs preventing them from frolicking in a magical river of QSR with no effort, thus blunting their advantage:</p><ul><li>Erecting a new pillar <strong>burns a huge amount of QSR, progressively so</strong>. Two things: 1) The burned QSR has just decreased the supply of QSR, and as price is the intersection of supply and demand, this means it will be more expensive and therefore more difficult to get the QSR for an additional pillar. 2) The base amount burned is 150k QSR, and 10k QSR gets added to this cost for every new pillar set up. At time of writing, we are up to 290k QSR, which clearly makes it more difficult.</li><li>QSR has so much damn utility that most of it won’t be freely circulating and easily slurped. It will be fused to generate more plasma for all the services on the NoM, it will be locked up in running pillars, nodes, (sentries too?). With <strong>not much of the supply available</strong> to buy, prices will be steep and the absolute autists with diamond-hands won’t sell easily.</li><li><strong>Staking to get the QSR</strong> takes a long time because you are competing with other actors/non-validators to get a share of the rewards, and the rewards themselves are decreasing over time as per the emissions schedule. And didn’t we cover in the above point that while you are staking for 12 months, what if 3 new pillars appear? That would burn 1M QSR and add 30k to the cost. Taking your time might not be wise. Also, staking locks your funds for time, so loss of liquidity is another issue.</li><li><strong>Being a liquidity provider</strong> is a great way to get more QSR, but it incurs the risk of impermanent loss if/when prices of your asset changes.</li><li><strong>Running a sentinel</strong> does give some QSR, but the rewards are primarily in ZNN. The PoW links that sentinels utilise may require increasingly powerful hardware. Because sentinels don’t burn their QSR collateral, they are an attractive option and the high number of sentinels means the rewards pool is diluted between many actors.</li><li>Pillars must compete with other pillars for a <strong>top 30 spot</strong> if they desire maximal ZNN rewards. As the total number of pillars grows in the future (market-buy one, get a vested one, save up for one via emission rewards) this competition will be even more intense. Why? Because half of the momentum rewards are reserved for top 30 pillars as a group. So for now, half of momentums are for the bottom 60 pillars. What about in ten years time when it becomes the bottom 150 pillars? The price per coin may be much higher, but the competition for emissions will be intense and drive desire to be in the top 30. This can be considered another barrier to spinning up more validators, one which benefits delegators as pillars do their best to attract enough weight.</li></ul><h2 id="57a5">Demographics For Progressive Decentralisation</h2><p>Did you know that Zenon is also ran as a meme company on the S&amp;P 500? In the famous words of our Head of HR: “You get the community you deserve.” Are there layers to this worth exploring? I think so …</p><p>The demographics of the aliens has changed over time, and will continue to do so. Perhaps this is by design to ensure a decentralised foundation. What does a decentralised foundation mean? We don’t want Zenon to be owned and controlled by anyone in particular. We will talk about concentration of wealth later — for now we will talk about control. We don’t want very coordinated, very large capital; that would be centralisation. Given that early adopters tend to have greater ownership (appropriate given their greater risk), we want the early owners to be chaotic, beautiful people rather than cold, coordinated institutions.</p><p>Going by the “you get the community you deserve” maxim, let’s examine what Zenon Network has looked like and thus selected for in its early evolution, shaping it community. We will also project into the future:</p><ul><li>xStakes: The bare minimum was presented. Selected for <strong>core team/OG Bitcoiners, savvy degens</strong>.</li><li>2019–2021: More talk about the proposed tech. Critical thinking based on the execution of xStakes (more on this later). Rumours and steganography (DYOR). Selected for <strong>open-minded technical people</strong>, <strong>crypto veterans, gem hunters, speculators</strong>.</li><li>2022–2023: More code being released, more building taking place out in the open, more tech being completed. Advertising to recruit builders. Selects for <strong>builders, devs, technical people, technophiles</strong>.</li><li>2023–later: Crypto is a small world, and people talk, word spreads. As more cool tech and BTC stuff is either worked on or completed, more people will be able to see what others grasped at an earlier phase: Zenon mirrors the Bitcoin ethos and is going to give Bitcoin wings. Selects for <strong>cypherpunks, libertarians, Bitcoiners, visionaries, thinkers</strong>.</li><li>Later: As the NoM enjoys increasing use and adoption and awareness, the big boys will finally catch on. Selects for <strong>VCs, institutions, financial sharks</strong>.</li><li>Much later: When you see the NoM logo on billboards (or is it already on a billboard in Texas?) That screams global scale and global adoption. Selects for <strong>the masses, retail, the everyday people</strong>.</li></ul><p>You can see how Zenon’s beautiful process is the inverse of a typical sh*tcoin’s path which begins with coordinated VCs, institutions and financial sharks. The sh*tcoin way at best gives the mere illusion of decentralised ownership and control. At worst it’s a VC scamcoin, and likely they will have the price chart and destination to show exactly this if you observe their dumpster-fire for long enough.</p><p>The NoM chose the decentralised path, which is longer and harder. It goes up and down mountains, in wind and rain. The investor’s thesis changes and strengthens over time, selecting for a different community as it evolves in plain sight. The ones with the greatest capital and the greatest coordination will join the latest, thus mitigating their vector in the direction of centralisation. Even when old frens ‘dump’ or ‘take some profits’, many of the OGs will still be running their nodes forever and pass them down through generations. The OG whales will also act as a check and balance for the new whales who will join in time. The decentralised tornado of individuals from all walks of life will remain a shining jewel of Zenon’s ecosystem — a triumphant achievement made possible only by diligently, relentlessly, intelligently playing the long game. The seed of patience is bitter, but its fruit is sweet.</p><p>Now, let’s talk about concentration of wealth. This is natural for every asset in existence — but there is a huge difference between the top 1% owning 99% and the top 20% owning 80%. The Pareto principle is far more natural and thus “fair”. What is the concentration of wealth for Zenon? Due to the penchant for anonymity and privacy, it’s difficult to say exactly even with on-chain analysis. But some things the community has discussed:</p><p>The price chart for years has shown an insane amount of accumulation. A few selling, many buying. Some have suggested there was intentional price suppression for the sake of allowing both everyday people to gain a significant position, as well as for Zenon to build in the shadows until more things were ready. This would match well with the pathway outlined above. This choir of distribution also had a crescendo: ‘the dumpoor’.</p><p>In 2022, ‘the dumpoor’ erected about 4–5 pillars, roasting an ungodly amount of QSR in the inferno of Mount Doom. He ran them all at 100/100. He gave away all of his rewards for months and months. He later deconstructed his pillars and sold all of his ZNN for insanely cheap prices. Well under $10, for anyone reading this in 2030 when each ZNN is worth 100 BTC. His actions were those of a man determined to distribute as many Zennies as far and wide as he could, for the sake of decentralisation. Either that, or we’ve finally found a bigger no-coiner than gold-obsessed Mr Schiff and his parade of imaginary terribles.</p><h2 id="e041">Egalitarian Launch For Progressive Decentralisation</h2><p>This has been discussed extensively already, because it’s extremely important. This is because when critical thinking is applied, it proves that the core team were OG Bitcoiners in ethics and behaviour. This has implications not just for your investor’s thesis for the success of the project, but crucially for their commitment to decentralisation.</p><p>One common piece of FUD which now and then resurfaces is this: Since the launch was anonymous and public, how do we know that VCs weren’t there? Answer: Firstly, they weren’t specifically invited, and have made no mention of Zenon ever. Secondly, were they somehow present at launch anyway? They may have been, they may not have been — that is the whole point of an anonymous egalitarian launch. And there’s no other way the Zenon team could have launched it, so even if you debate the unknowable outcome of the launch, you can’t easily argue with the design of the launch. You’d need to suggest an alternative which is better, and no one has so far managed to do that.</p><p>We’ll give a TLDR here, but also be sure to check out the following OG articles so that you understand the details, nuances and inferences from this important, unique and immaculate conception:</p><ul><li><a target="_blank" href="https://medium.com/@shaimo/the-zenon-enigma-782f8b293bd6"><strong>The Zenon Enigma</strong></a></li><li><a target="_blank" href="https://shazzamazzash.medium.com/zenon-network-an-apes-guide-to-the-galaxy-7aad7dacdfef"><strong>An Ape’s Guide to the Galaxy Redux</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/how-zenon-mirrors-the-bitcoin-ethos-142300e59e64"><strong>How Zenon Mirrors the Bitcoin Ethos</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-a-noir-story-a06cc8945439"><strong>Zenon Network: A Noir Story</strong></a></li></ul><h2 id="1805">TLDR:</h2><p>From day 1 until they pull a Satoshi and vanish, the core team has been absolutely committed to the decentralisation of the NoM in every way possible. You don’t need to trust them on this, because the success of the NoM depends on Bitcoiners accepting the NoM, which they will only do if the NoM is as decentralised as Bitcoin itself. Assuming the worst about them, they are still incentivised to promote decentralisation so they can pump their bags of both ZNN and BTC as they grow together. Assuming the best, these cypherpunks are not going to devote their life’s work to a centralised, authoritarian piece of trash. The community is on track to take over completely when the time is right, and when they do they will be utilising the most sound and fair foundation in crypto.</p><h2 id="55d0">Conclusion</h2><p>We have examined and discussed the game-theory of the tokenomics, the demographics and the egalitarian launch of Zenon Network. All of it is intelligently designed and synergistic for the same desired outcome. Eventually the NoM will be fully built, and yes a competitor could copy our tech — but they can’t copy our decentralisation, they can’t rival our network effect and they certainly can’t handle our momentum. You can’t pick and choose; you simply must embody the Bitcoin Ethos in your DNA.</p><p>Documenting Zenon’s history is important because it allows newcomers to understand Zenon, verify the narrative presented and ultimately to see the truth of its decentralisation for themselves. To this end, some members of the community have backed up a copy of the Legacy Zenon chain, chat history (Bitcoin forum threads, Telegram chats), old websites, community-made articles and more. See <a href="https://forum.zenon.org/t/preserving-zenons-genesis/1344" target="_blank">here</a> for that discussion. Currently it is being preserved in multiple locations including the IPFS.</p><p>There is one final thing to consider:</p><p><em>“The bamboo that bends is stronger than the oak that resists.” — Japanese proverb.</em></p><p>To this end, we have the ZIPs which allow Zenon to adapt and evolve over time. The actors voting on the ZIPs are incentivised to care because they have burnt their QSR to erect their pillar; to make up for this loss of money, they need to run their pillar for a long time, and therefore they need to make wise decisions for the longterm health of the network. The ZIPs themselves are also an innovation beyond Bitcoin’s BIPs. Rather than a centralised editor, the ZIPs decentralise this authority by having a system of Pillar sponsorships for ZIPs.</p><p>Perhaps it was the irony of going through a centralised editor to bring changes that align with progressive decentralisation. Perhaps it was the advantage of killing a design-weakness and yet again increasing our robustness. All I know is that the list of things Zenon does differently with unique features, innovations and ideas just seems to grow by the day.</p><p>It reminds me of the way super-genius Elon Musk runs his businesses. <em>“Why does he work here? All he does is take long coffee breaks and never actually delivers anything, let’s fire him. Why is this done like that? That’s stupid, let’s change it.”</em> The man is a faucet of pro-gamer moves, a wrecking ball for archaic stupidity and a revered harbringer of innovation. Anyone perceptive can feel this same energy for creativity and progressiveness in Zenon’s ecosystem. It begs the tantalising question: What’s next?</p><p>Stick around and find out. But if you have the skills, why not join in? In Zenon, everyone’s participation and efforts are welcome, we are by and for the people. Besides, nothing beats writing the story you wish to read …</p><h2 id="7fdd">Thanks for reading!</h2><p>– Zyler</p><h2 id="e264">Join The Community</h2><p><a href="https://zenon.network/" target="_blank">Zenon.Network<br /></a><a href="https://twitter.com/Zenon_Network" target="_blank">Twitter/X<br /></a><a href="https://t.me/zenonnetwork" target="_blank">Telegram</a> <br /><a href="https://discord.com/invite/zenonnetwork" target="_blank">Discord</a><br /><strong>Zenon Community Public Key:<br /></strong>npub1msvlamqj6j5azykts7sewtzr062a0km0p4hajw2dmchtm5xpz0aqylw09w</p><h2 id="a70b">The Zyler Reading List</h2><ol><li><a href="https://twitter.com/zyler9985/status/1735373467577663905" target="_blank"><strong>The Zenon Storybook</strong></a> (updated version coming soon)</li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-iii-game-theory-for-progressive-decentralisation-38f94457b03e"><strong>Progressive Decentralisation</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-a-blistering-need-for-speed-ce34246c2f01"><strong>A Blistering Need For Speed</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-viii-alien-plans-for-bitcoin-804e1ba60a3c"><strong>Alien Plans For Bitcoin</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/why-zenon-is-regulation-proof-b696c3a03d0d"><strong>Why Zenon Is Regulation-Proof</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenons-synergy-with-nostr-c36fe2bf955c"><strong>Zenon’s Synergy With Nostr</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-merged-mining-bitcoin-fb7ccf60161e"><strong>Merged Mining Bitcoin</strong></a><strong> </strong>(updated version coming soon)</li><li><a target="_blank" href="https://medium.com/@Zyler9985/how-zenon-mirrors-the-bitcoin-ethos-142300e59e64"><strong>How Zenon Mirrors The Bitcoin Ethos</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/the-zenon-ethos-4e0ab0dff12b"><strong>The Zenon Ethos</strong></a></li><li><a target="_blank" href="https://medium.com/@Zyler9985/zenon-network-a-noir-story-a06cc8945439"><strong>Zenon Network: A Noir Story</strong></a></li><li><a href="https://www.slideshare.net/zylert888/the-dream-of-satoshis-ethereumpdf" target="_blank"><strong>The Dream of Satoshi’s Ethereum</strong></a></li><li>Zenostroin (Coming 2024)</li></ol></div>",
	"author": "Zyler9985",
	"favicon": "https://miro.medium.com/v2/1*m-R_BkNf1Qjr1YbyOIJY2w.png",
	"source": "medium.com",
	"published": "2023-12-24T11:25:08.573Z",
	"ttr": 503,
	"type": "article"
  }