{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2019-12-05T20:21:40.553Z",
  "title": "Awareness Initiative, the final chapter.",
  "content": "The Awareness Initiative was a success in bringing new Network Participants and building a stronger, more active community. The time comes to put an end to it, but not before the final step which hopefully will be another success.\n\nDue to the fact that no participant has been eligible for Tiers 1 and 2, rewards will be reported for a last “Awareness Campaign” and a “Trading competition” organized by STEX Exchange.\n\n1. “Awareness campaign”\n\nRewards a total of 9,000 ZNN and the rules are:\n\n- Write a Medium/STEEMIT article about Zenon Network.\n- Top 3 articles selected by Zenon team will receive equal rewards (3,000 ZNN).\n- The campaign will last until block 385920 when Pillar Lock-in phase ends.\n\n- Everyone is eligible to participate no matter how many followers or likes they have.\n- Originality and creativity can boost your article one step closer to the podium.\n- At the end of the article sign with your telegram ID used to join Zenon channel.\n- Share your article and tag Zenon page on Twitter. (@Zenon_Network).\n\n2. STEX Exchange “Trading competition” rules\n\nTrading competition rewards a total of: 14,250 ZNN split between 10 places.\n\nTop trader: 4,000 ZNN\n2nd trader: 3,000 ZNN\n3rd trader: 2,000 ZNN\n4–10 places: 750 ZNN\n\n- Trading competition will last 2 weeks starting from 06.12 until 20.12.\n- Users will be ranked from 1st to 10th based on their total net purchase of ZNN on STEX Exchange during the trading competition period.\n\nMinimum amount to participate in the trading competition is 1,000 ZNN by buying and holding it until the competition ends.\n\nThank you for being a participant in the “Awareness Initiative” and for more questions join our community: https://t.me/zenonnetwork or follow @Zenon_Network on Twitter for future updates.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*Cc9-gqLNJWzlovvfJflElw.png",
  "url": "https://medium.com/@zenon.network/awareness-initiative-the-final-chapter-7fd187ca2cb",
  "links": [
    "https://medium.com/@zenon.network/awareness-initiative-the-final-chapter-7fd187ca2cb"
  ]
}
