{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2020-10-23T12:40:28.576Z",
	"title": "Building bridges",
	"content": "Introduction:\n\nSince the inception, we have centered our focus on building a foundation for our network participants as we believe a sustainable ecosystem should not skip any growth cycle on its way to maturity. Now, as we approach a new epoch, it’s time to accelerate the growth of the Zenon Ecosystem.\n\nEstablishing connections:\n\nThe Zenon Fabric team has been communicating with leaders in the cryptocurrency space, building bridges, aiming to connect technologies, and merge communities in preparation for the next phase of Zenon and the transition to the Network of Momentum — Alphanet. For the first part of the Zenon Fabric program, we have reserved 10 vested Pillar slots for key industry players. Being in the testing phase, we will be introducing them one by one, keeping close contact, aiming towards a secure and smooth transition to Alphanet for our network participants. For this first chapter, we decided to start integrating acknowledged Validator teams, having the most experience managing networks of nodes making both the communication and transition easy for both parties.\n\nVested Pillar specifications:\n\nThe vested Pillar contract will contain a locked amount of 15,000ZNN. The Validators can unlock the coins in 4 stages (25% per stage) by reaching a preset voting power. If they don’t reach the voting power needed for unlocking the coins, they will still receive rewards based on their Pillar position in the ranking system. It is up to the Validators to attract as much voting power (stakers) as they can, based on their value and reputation to unlock segments of the Pillar. This system has been designed to incentivize both Validators to market their Pillars by seeking voting power while also helping the Zenon Ecosystem gain greater traction.\n\nWhat’s on the horizon:\n\nZenon will always remain development-oriented, as strong product evolution is a critical factor for success, but the time to establish a strategic marketing framework has never been more optimal. Starting with the launch of the Network of Momentum — Alphanet, the focus will be to create an interrelationship between product development and external connections, increasing accessibility for developers, and strengthening the foundation around the Network of Momentum.\n\nTelegram: [https://t.me/joinchat/MLyPehLIbJj1nw1XOOOltg](https://t.me/joinchat/MLyPehLIbJj1nw1XOOOltg)\n\nTwitter: [https://twitter.com/Zenon_Network](https://twitter.com/Zenon_Network)\n\nZenon Fabric: [https://medium.com/@zenon.network/zenon-fabric-f6fbe908e63f](https://medium.com/@zenon.network/zenon-fabric-f6fbe908e63f)\n\nPartnership inquiries: portal@zenon.network.",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*JVcQEHt55myxt35EFJEahw.jpeg",
	"url": "https://medium.com/@zenon.network/building-bridges-4ed4eb6988a",
	"links": [
		"https://medium.com/@zenon.network/building-bridges-4ed4eb6988a"
	]
}
