{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2022-02-12T16:53:16.335Z",
  "title": "Zenon. Building bridges. 2-way BSC Bridge",
  "content": "Updated February 11th, 2022\nZenon aims to be the perfect environment for each individual to experiment with decentralization at any level. Based on a decentralized, scalable, and secure protocol, the Network of Momentum is not only the place where everyone can build on top of it, but also an ecosystem governed entirely by its community.\n\nOne more step towards decentralization is being taken by providing experimental support for the wrapped ZNN (wZNN) initially via the BSC (Binance Smart Chain) 2-way Bridge.\n\nBenefits: the possibility to store wZNN in any Web3-compatible wallet, interoperability with the BSC ecosystem, and an alternative to the decentralized transition mechanism from the legacy network to Alphanet.\n\nIt also serves as a benchmark and a playground to test the limits of different interoperability solutions, highlighting the trade-offs and benefits of current bridging protocols.\n\nHow to swap ZNN to wZNN?\n\n1. Open syrius v.0.0.2 or later and go to the Bridge tab\n2. Enter the ZNN amount you wish to swap to wZNN and the BSC address allowed to redeem the wZNN.\n\nNote: Make sure you have enough BNB on the BSC address in order to cover the gas fees and complete the swap.\n\n3. Click Swap, read the confirmation message and continue if everything looks good.\n4. Click Redeem in order to claim the wZNN or navigate to https://bridge.zenon.network/\n\nNote: The wZNN will become redeemable in 5 to 10 minutes after the swap transaction has been sent.\n\n5. Connect using a Web3-compatible wallet (e.g. Metamask). Make sure the wallet is connected to the BSC mainnet and that you have added the wZNN token contract address.\n6. Select Swap ZNN to wZNN.\n7. Confirm or change the address you wish to query and click redeem\n8. Once you’ve identified the transaction, click the redeem button next to it.\n\nNote: If a transaction is missing, it may take longer to be confirmed. Make sure you have enough BNB on the connected BSC address in order to cover the gas fees and complete the swap.\n\nOther considerations:\n\n1. A swap fee of 1% + 0.1 ZNN is automatically deducted from the wZNN and it is not refundable.\n2. Do not send ZNN from a non-custodial wallet. You will not be able to redeem the wZNN and you will lose the funds.\n3. Do not attempt to send ZNN directly to the bridge address. You will not be able to redeem the wZNN and you will lose the funds.\n4. The wZNN bridge is experimental. Always have backups of your wallets and do not put large funds at risk. Bookmark ‘bridge.zenon.network’ and beware of scams. Make sure you understand the risks involved with cryptocurrency transactions and do your own due diligence before interacting with the bridge.\n\nBridge specifications:\n\nBridge ZNN address: z1qzlytaqdahg5t02nz5096frflfv7dm3y7yxmg7\nSwap fee: 1% + 0.1 ZNN\nWaiting time: after 101 or more confirmations\n\nHow to swap wZNN to ZNN?\n\n1. Navigate to https://bridge.zenon.network/\nConnect using a Web3 compatible wallet (e.g. Metamask). Make sure the wallet is connected to the BSC mainnet and that you have added the wZNN token contract address.\n2. Enter the wZNN amount and the syrius address where you want to receive the ZNN.\n3. Click Swap and confirm the transaction using the Web3 wallet.\n4. The ZNN will be sent to the specified ZNN address automatically once it has 1001 or more confirmations on the BSC mainnet.\n\nNote: When swapping wZNN to ZNN, the swap fee is 0.\n\nBridge specifications:\n\nToken BSC address: 0x84b174628911896a3b87fa6980d05dbc2ee74836\nSwap fee: 0\nWaiting time: 1001 or more confirmations\n\nPlease keep in mind this is an experimental setup that does not guarantee risk-free security.\nThe community is encouraged to review and audit the Solidity code.\n\nSyrius v0.0.2\nhttps://github.com/zenon-network/syrius/releases/tag/v0.0.2-alphanet\n\nWebsite: https://zenon.network/\nTwitter: https://twitter.com/Zenon_Network\nTelegram: https://t.me/zenonnetwork",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*tiiyMiM4erRep9EdY4eFHQ.png",
  "url": "https://medium.com/@zenon.network/zenon-building-bridges-272538cde1a7",
  "links": [
    "https://medium.com/@zenon.network/zenon-building-bridges-272538cde1a7"
  ]
}
