{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2019-05-02T14:21:39.332Z",
	"title": "Community update May 2nd",
	"content": "March marked the month of Zenon’s Network launch. After the distribution successfully concluded, it is time to fully focus on development and academic research but also on building a loyal and vibrant community which is without a doubt, one of the greatest assets a cryptocurrency project can possess.\n\nCommunities which grow extremely fast are often deficient on fundamental essentials, leaving them vulnerable in the long-term to competition. A constant and steady growth makes for a powerful foundation to build upon; Build a strong base, and the community will follow.\n\nBefore we dive into technical details about what this article is really about, let's see what happened since the network has started, a bit over a month ago, in no particular order:\n\n1. A community portal where people can apply to contribute to NoM’s creation — https://zenon.network/portal\n2. A progress tracker — https://zenon.network/tracker\n3. Dozens of applications from developers, graphic designers, and community managers that are currently under review.\n4. The cryptogram\n5. Exchange listing on CryptoBridge https://wallet.crypto-bridge.org/market/BRIDGE.ZNN_BRIDGE.BTC\n\nOfficial articles + various website listings:\nProof of Review: https://www.proofofreview.com/wp-content/uploads/2019/04/Review-Zenon.pdf\nCoingecko: https://www.coingecko.com/en/coins/zenon\nMasternodes.pro: https://masternodes.pro/stats/znn/\nMasternodes.online: https://masternodes.online/currencies/ZNN/\n\nAnd what is about to happen in the next few weeks:\n\n1. Major stability and security wallet update\n2. First xStake distribution to eligible members\n3. First distribution of the “stability fund” to network participants.\n4. Reward decrease from 10 ZNN to 7 ZNN per block\n\nZenon Numbers recap:\nActive nodes: 190\nBlocks: 61000+\nCoin Supply: 2,350,000 ZNN\nAverage weekly trading volume: $1,150,000 / 180BTC\n\nOne of Zenon’s first major goals was to make the launch as fair as possible, prioritizing decentralization while still maintaining an overall different approach of a cryptocurrency project. In order to make Zenon’s launch even more fair, starting from May, “the stability fund” will be equally distributed among all active nodes.\n\nNETWORK STABILITY FUND DISTRIBUTION\n\nWhen Zenon’s network was created, a total of 70,001 ZNN were generated in order to sustain the network for a limited period of time, until it was able to support itself. Now, Zenon’s network is expanding every day as new nodes are constantly joining the network.\n\nIn order to express gratitude to the network participants in a fun and captivating way, a cryptogram was created with the first part of the “stability fund” using 10,500 ZNN split in 5 private keys that were unlocked by our determined community members.\n\nCryptogram: https://twitter.com/Zenon_Network/status/1110937503811493889\n\nThe distribution was successfully completed, the network is now self-sustainable, and now, we are ready to start our second reward phase of the remaining stability fund.\n\nIn a decentralized network, every participant is essential to the well-being of the project. Starting from block 84960, all node owners will be the main users which will benefit from the “stability fund”, for a total period of 12 months. Each month 4,958 ZNN will be equally distributed among all active Zenon Nodes at a specific block (multiple of 43200).\n\n59500 / 12 / number of total nodes active at the specified block\n\n* Rewards can vary according to the number of active Nodes at the moment of distribution\n* All Nodes are eligible if they are active at the moment of distribution.\n\nAs a project that is meant to be fully decentralized, its community is not only a major component, but the key and heart of the project. Because no living entity can exist without a heart, we want to hear you out, as creative ideas and feedback are always appreciated and taken into consideration.\n\nJoin Zenon’s Telegram or apply to the community portal if you believe you could be an important addition to the project and want to participate in the creation of the new hybrid space for decentralized applications, the Network of Momentum.\n\nTelegram: https://t.me/zenonnetwork\nPortal: https://zenon.network/portal",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*oPQExut61hRwgQ54pGjw1Q.png",
	"url": "https://medium.com/@zenon.network/community-update-may-2nd-a1c62b3c784",
	"links": [
		"https://medium.com/@zenon.network/community-update-may-2nd-a1c62b3c784"
	]
}
