{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2022-01-22T16:50:45.732Z",
	"title": "Full Node Invasion — Network of Momentum Phase 0",
	"content": "Blockchains are going to run the world by providing mechanisms for scaling social and economic cooperation to unprecedented levels. However, most of the existing layer-1 projects provide only a shallow decentralization.\n\nA blockchain network where users are unable to run their own nodes is not essentially trust-less, but relies on centralized entities to feed them data.\n\nOne of the key fundamentals of blockchain decentralization is enabling users to run full nodes and validate transaction history without reliance on third parties. We’re uncovering better ways to enrich genuine decentralization by invading the space with more nodes and helping others to do it as well.\n\nRunning a Zenon node on the NoM protocol offers by far the best security and privacy guarantees while ensuring that the dual-ledger data is secure, valid, and accessible.\n\nThis article will explain what is a node, why you should run one, how to do it, and future development insights.\n\nWhat is a node?\n\nA node can be basically any device that runs the node daemon. It is communicating via a peer-to-peer network with other devices that run the NoM software client to enable the following functions:\n• Storing & validating the dual-ledger transaction data\n• Relaying proper information to other nodes\n• Following and enforcing the NoM protocol\n\nWhy run a node?\n\n“Trusted third parties are security holes” — Nick Szabo.\n\nThe saying “not your keys, not your coins” also extends to blockchain consensus as “not your nodes, not your rules”. Running a full node guarantees that you can self-verify transactions and enforce protocol rules, so you can’t be deceived #UASF.\n\nHere are the top extensive benefits for running your own Zenon node:\n\n• Security: Even a third party that is established and relatively trustworthy can still be compromised by malicious entities. By running and using a full node to validate transactions, users can protect themselves against a wide range of attacks. More exotic attack vectors inherent to p2p networks like eclipse attacks might occur with low probability, but can be mitigated as well. Besides, an honest node that follows the protocol will always relay properly validated data.\n\n• Privacy: Full nodes offer the most comprehensive privacy guarantees. When you’re using a third party node, you’re exposing sensitive data (IP address and other metadata) to a centralized entity that can be used to fingerprint you. By using a full node, the transactions are directly relayed to other nodes and it is harder to associate a transaction with you besides the available on-chain data.\n\n• Decentralization: More full nodes translate into enhanced connectivity for users across the world, so better geographical distribution. In order to further strengthen decentralization, it is recommended to be your own ISP avoiding certain types of network filtering and deploying off-grid connectivity systems (Starlink, goTenna, Helium).\n\n• Censorship resistance: Your transactions will never get dropped or censored.\n\n• No downtime: Not depending on third party nodes, you’re controlling the full node and using it whenever you need.\n\nHow to set up and use a full node?\n\n1. Build a node binary from the source. The codebase is written in Go, so it is targeting a wide variety of CPU architectures and operating systems. It is designed to even run on low-end or power-constrained devices such as Raspberry Pi.\n\n2. Set up the node. Some operating systems may require additional permissions to allow the execution of the node. Go through the necessary steps if that’s the case.\n\n3. Use it alongside the S y r i u s wallet. Connect the S y r i u s wallet to your full node from the node management widget in the settings panel.\n\nFuture developments in Q1 2022\n\n• S y r i u s will feature an embedded node, so that even non-technical users will benefit from the same security and privacy guarantees as pro users.\n\n• Node optimizations that will improve overall resource efficiency.\n\nMore in-depth guidelines can be found here: https://github.com/zenon-network/znn-bundle\n\nFor support and additional questions, please reach out to the community:\nWebsite: https://zenon.network/\nTwitter: https://twitter.com/Zenon_Network\nTelegram: https://t.me/zenonnetwork",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*8XicJzz3JeHst1r57dw0qg.png",
	"url": "https://medium.com/@zenon.network/full-node-invasion-network-of-momentum-phase-0-ba5aaf99fa5e",
	"links": [
		"https://medium.com/@zenon.network/full-node-invasion-network-of-momentum-phase-0-ba5aaf99fa5e"
	]
}
