{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2022-04-21T13:48:17.610Z",
  "title": "Hyperspace x Accelerator-Z: towards a DAO of DAOs",
  "content": "Network of Momentum’s mission is to increase the economic freedom in the world through the ZNN & QSR dual-coin economy. To achieve this, it is essential to develop a common infrastructure that is transparent, safe, feeless, and above all benefits its participants. In the current decentralized landscape, most blockchain projects develop their own isolated ecosystems without addressing other networks or communities, thus lacking connectivity, accessibility, and scalability. Zenon aims to change the status quo, so this article will approach a subject greatly sought by our community: the full-on decentralization throughout the Hyperspace Program and Accelerator-Z. First, let’s start with some clarifications Accelerator-Z is an on-chain venture framework that is supporting a wide variety of products or services relevant to the Network of Momentum’s ecosystem expansion. The fund at stake is represented by Zenon Fabric that has over 900k ZNN and 8,4M QSR opened for any interested entities that are capable and eager to develop on NoM’s feeless, rapid, secure and decentralized network. Hyperspace Program represents the inception of Accelerator-Z, but with an augmented focus on initiatives that fulfill the vision of a cross-chain compatible network. The Hyperfund required for the Hyperspace Program will be deducted from the Orbital Program. The Hyperfund will be worth 130k ZNN and 700k QSR. Invest in Growth — Let’s find you in! Both the Accelerator-Z and the Hyperspace Program aggregates entrepreneurs, strategists, developers and crypto-enthusiasts into a collaborative framework that supports the new wave of blockchain & Web3 products and services with funds and a powerful infrastructure. These are open initiatives that support diversity at its core, both the diversity of participants and their skills. One can classify the teams structure into three main categories that are equally important for a booming ecosystem: Sales, Tech & Marketing. Sales Teams Develop a vibrant ecosystem based on mutually beneficial partnerships and open new markets: blockchain networks, products and services crypto organizations, centralized and decentralized exchanges. Participants: ▪ Strategy drivers ▪ Business developers ▪ Recruiters Marketing Teams Drive massive awareness and exponential growth of the ecosystem by systematically conducting and experimenting marketing strategies of content-driven marketing, social-media, paid ads, and product marketing. Participants: ▪ Copywriters or Technical writers ▪ Graphic designers ▪ Performance marketing specialists (paid ads) ▪ Social media specialists ▪ PR ▪ Influencers ▪ Brand ambassadors Tech Teams Build on a robust architecture and drive new innovation in the blockchain space. Participants: ▪ Software engineers ▪ QA engineers ▪ Web developers ▪ Data analysts ▪ Data scientists ▪ AI/ML engineers ▪ Project managers ▪ White hat hackers ▪ Mobile developers Hybrid teams For complex products that require a mix of sales, tech and marketing teams. Develop a full-fledged product designed and deployed on Network of Momentum that requires a multi-skilled team. Onboarding Next version of the syrius wallet will incorporate Accelerator-Z where anyone can submit a proposal or donate funds. Here is a step by step tutorial of the entire application process: Step 1: Creating a Proposal This first action will require 1 ZNN that will be directed into the Accelerator fund. The owner of the proposal must submit the following information: project name, description and URL. After the proposal is created, Pillars will asses the viability of the project, based on the description, cost and the extra information provided in the link. The decision making process will be done by Pillars in a fully transparent manner. The proposals will be approved to enter the next stage only if they meet the quorum majority (>33% of Pillars vote & >50% of the votes are yes). Each proposal has a 14 days period in which they must convince the Pillars in order to advance to the next stage. Each Pillar has only one vote per proposal, regardless of its weight. If a proposal passes, the owner can proceed to request funds by creating phases for the project. The fact that a proposal passes implies that the Pillars are interested in the idea and they will release funds for the owner only if the phase is successfully completed. Step 2: Development stage Hyperspace will be focused on two main types of projects: Building cross-chain solutions: • Cross-chain bridges (with other layer-1 or layer-2 networks) • Atomic swaps and related technologies (HTLCs) • Other interoperability solutions SDK ports for the following programming languages: • Javascript/Typescript • Rust • Go • Java/Kotlin • C/C++ • Python • Swift • C# Accelerator-Z will support a much wider category of projects such as: • Web3 solutions (e.g. web wallet/browser extension) • GameFi (gaming) • NFT platforms • Internet of Things (IoT) solutions • Blockchain based Artificial Intelligence (AI) • Payment solutions • Decentralized Identifiers (DID) • Decentralized Storage • Decentralized Social Networks (DeSo) • Decentralized Exchanges (DEX) • Automated Market Making (AMM) The development of a project can be split into several distinct phases. It is the owner’s duty to manage the project and its resources. Example 1: Sales team Partnership with a CEX (centralized exchange): 1. Find the decisions makers & create personalized targeted messages 2. Demonstrate a form of interest from the prospect 3. Seal the deal & exchange listing announcement Example 2: Tech team SDK port project: 1. Create an open source repository and implement core functionalities 2. Showcase working demo and implement the remaining functionalities 3. Code coverage (unit tests) for the functionality & showcase final product Example 3: Marketing team Social media advertising campaign: 1. Create the ads content & define the target and objectives 2. Run a successful ad-campaign sample 3. Show the metrics of your running ad campaign & further optimizations across it Example 4: Marketing team Conduct a collaboration between a publishing company/influencers: 1. Demonstrate the discussion with a journalist/account manager/influencer 2. Show the final version of the article/content material 3. Show the published article/YouTube video Example 5: Hybrid team for complex products NFT Platform (sales + tech + marketing): 1. Define the main technical features, use-cases, user-persona, value-propositions through a presentation/Medium article 2. Showcase MVP (minimum viable product) 3. Pre-launch marketing campaign 4. Public launch (release) with initial features 5. Post-launch marketing campaign 6. Add more features based on community feedback These phases should be outlined in the initial proposal. It may be the case that some will vote yes/no based on this schema. The fact that the Pillars voted yes for the project means that there is interest in developing it. The owner must successfully complete each phase before unlocking funds. If at any point, the phase respects the conditions from first point (quorum reached and >50% voted yes), the phase is considered successfully completed and the owner will receive the requested funds. Pillars will vote yes/no based on their own reasoning: Example project voting: * Vote no, requests too many funds * Vote no, vision is not aligned (e.g. developing a centralized solution) * Vote no, unreasonable objectives * Vote no, project timeline unrealistic * Vote yes, the project will add value for the ecosystem (short and long term) Example phase voting: * Vote no, requires too many funds * Vote no, prototype/feature is not working/does not exist * Vote no, slow progress * Vote no, poor quality * Vote no, deadline exceeded * Vote yes, everything is delivered on time Step 3: Feedback The owner can gather feedback from the community when creating phases for the project. It’s possible for the owner to update the status of the last phase (all fields can be modified). If this happens, all the votes will reset and Pillars will have to re-cast their votes accordingly. This is useful if the community expected more from the current phase, or if the owner requested too many funds. Restrictions Each proposal is limited to a maximum amount of 5000 ZNN and 50000 QSR, meaning that the sum of the funds from all phases cannot exceed this amount. However, there might be very complex projects that will need more than 5000 ZNN to successfully launch. In a situation like that, it’s important to cluster the bigger project into smaller sub-projects for which you will request a maximum amount of 5000 ZNN. Final Notes Zenon is designed to avoid single points of failures from its very core. The development process will continue from a community standpoint and this new emerging DAO will rely on memberships and participation, as well as on reputation that can be obtained by relentlessly contributing and delivering quality projects on time. Accelerator-Z will represent the first layer for the DAO of DAOs framework, acting as an autonomous powerhouse for enabling ecosystem growth. It is the network scale DAO that supports all other DAOs created within the ecosystem. The second layer of the network DAO is represented by the Pillars that can act as mini-DAOs that independently propose projects, while their delegators support them with votes or external resources. The third layer is represented by Sentinels that can form micro-DAOs, while stakers or delegators can create nano-DAOs to influence Pillars and the network as a whole by voting and actively engaging with the community. This entire network will evolve into a DAO of DAOs, a cyber-society with rules written in code that empowers individuals to contribute and share resources for the greater good. As new projects will embark on this ecosystem, the collaborations will increase. The Accelerator-Z, the Hyperspace Program and the Vesting Pillar mechanism stand to become the foundation of growth and the fulcrum of cooperation. When projects will deliver, we will see a substantial increase in innovation, business process efficiency and higher level interoperability. It will be that point when sooner or later this domino effect will enable a boom in interest and participation in the Zenon ecosystem. We look forward to hearing from the future pioneers of Network of Momentum and wish you all the best. The future is encrypted. Only you can decrypt it! Website: https://zenon.network/ Twitter: https://twitter.com/Zenon_Network Telegram: https://t.me/zenonnetwork Bridge: https://bridge.zenon.network",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*U-99EmvfXx86FIWst8x-8A.png",
  "url": "https://medium.com/@zenon.network/hyperspace-x-accelerator-z-towards-a-dao-of-daos-38dfad496365",
  "links": [
    "https://medium.com/@zenon.network/hyperspace-x-accelerator-z-towards-a-dao-of-daos-38dfad496365"
  ]
}
