{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2019-03-26T12:44:58.034Z",
	"title": "Intro",
	"content": "Today we are at the dawn of the new, open and decentralized Internet. A sentiment of massive distrust in centralized services is starting to take shape and the world needs new and powerful solutions to overcome existing limitations that are inherent with centralized systems. Nowadays, current decentralized solutions are constrained by blockchain’s fundamental limitations: scalability and active participation.\n\nzApps\n\nThis first article stands as a brief introduction on zApps and why the Network of Momentum will be the quintessential environment where decentralized applications are developed, coexist and thrive without compromising on essential necessities.\n\nThe idea behind zApps is to empower every developer to build and deploy powerful dApps on a network based on a decentralized, scalable and secure protocol — the Network of Momentum.\n\nCurrent available solutions to create and maintain decentralized applications are ineffective in terms of:\n- computing resources (slow and inefficient storing and processing)\n- time (steep learning curve for new programming languages like Solidity)\n- exposure (user adoption is a known barrier for dApp devs that want to earn for a living)\n\nThe main purpose of zApps is to create an open ecosystem that will enable every developer to build from scratch or convert any existing application, whether it’s web, mobile or desktop to the Momentum Network’s decentralized infrastructure and unlock a new dimension of possibilities: greater flexibility, scalability and performance, new ways of monetization, cost minimisations and new channels for user acquisition.\n\nZenon use-cases\n\nGeneral examples of technologies that will be able to benefit from the NoM protocol:\n\n- Digital Assets\n- Decentralized storage solutions\n- Artificial Intelligence (A.I) systems\n- Digital Identity services\n- Internet of Things (IoT)\n- Distributed Computing platforms\n\nIndependent and passion driven, Zenon’s purpose is to redefine the status quo of dApps platforms by letting it thrive to an ecosystem of itself, built by a passionate community of developers and establishing the Network of Momentum as the ground level of a new decentralized Internet.\n\nJoin our social media channels:\n\nTelegram: https://t.me/zenonnetwork\n\nDiscord: https://discord.gg/XDDjECy\n\nTwitter: https://twitter.com/Zenon_Network",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*FRGiqUrEz5g2FMenMEViWQ.png",
	"url": "https://medium.com/@zenon.network/intro-6b3c9e4e6900",
	"links": [
		"https://medium.com/@zenon.network/intro-6b3c9e4e6900"
	]
}
