{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2022-02-26T18:56:55.537Z",
	"title": "Mission 2022 — Network of Momentum — Atomic Era Roadmap",
	"content": "As it evolves, the Network of Momentum’s universe passes through distinct eras of R&D to create the ideal conditions for decentralization, expansion, and interoperability.\n\nAs the Stabilization Period has successfully concluded, we have entered into a new era of innovation and prosperity: the Atomic Era.\n\nIn this article, we will share the roadmap of the Atomic Era which will focus solely on two main directions that will be pursued in parallel: creating new paths towards greater decentralization and introducing the atomic upgrades.\n\n**Full decentralization pathways**\n\nIf you look at the arc of the cryptocurrency world, it started as fully decentralized in the perfection that is Bitcoin, but has over time moved towards centralization. This is a natural process of people wanting to make things and putting themselves directly in positions of power and wealth as a reward for performing the creation act.\n\nIn order to achieve a holistic vision of decentralization, there are two main parts that need to be addressed: technical decentralization and governance (social) decentralization. The first is already achieved, while the latter is harder to accomplish due to human nature.\n\nIn the next period of time, the main focus will be to gather development resources from both internal and external entities through Accelerator-Z and put the community at the helm of this process.\n\nIn this way, the community will have all the necessary tools and will be responsible for the future of the ecosystem.\n\nThis means that the network’s lifespan will only rely on its market success and not on the whims of any third parties. Bitcoin demonstrated this continuously over the years, on another level: “you can’t regulate what you can’t stop”.\n\n**Here is the status for the two levels of decentralization:**\n\n**1. Technical decentralization:** the full node code is fully open-source under permissive licensing, so that everyone can contribute by developing and running their own node, being highly encouraged to do so.\n\n**2. Governance decentralization:** the entire network is prepping a collective governance and decision-making framework driven by the Pillars vote and influenced by the delegators' voice. This governance framework is at the core of Accelerator-Z that will represent the powerhouse for ecosystem expansion.\n\nNetwork of Momentum can be viewed as a DAO of DAOs, meaning that countless people can be rewarded for contributing in any sort.\n\n**Atomic Roadmap**\n\nThe upcoming upgrade of the Network of Momentum is the Atomic upgrade which will power up the network with a series of network enhancements and releases:\n\n- **Syrius & znnd v0.0.2** have been released to bring massive improvements in terms of stability, efficiency, and security ➞ Live\n\n- **2-way bridge** with BNB Chain ➞ Live\n\n- **Syrius v0.0.3** will feature an embedded full node that will enable everyone to be part of the network without relying on third parties ➞ Live\n\n- **HYPERSPACE:** A dedicated hackathon for decentralized cross-chain solutions under the umbrella of Accelerator-Z & Orbital Program ➞ Launch in March\n\n- **Accelerator-Z:** the key that unlocks the Zenon Fabric (772.136 $ZNN & 7.721.360 $QSR). Any organization, company, or independent individuals (developers, marketers, entrepreneurs, content creators) can apply and access funds for building products and delivering services desirable for ecosystem expansion ➞ Launch in March\n\n- **A new NFT standard:** the standard will be published and explained in a future dedicated article. Submissions for the implementation will be funded through Accelerator-Z ➞ Launch date: TBA\n\n- **Vested Pillars integration** is designed to expand the ecosystem with key-industry players who will be granted Vested Pillars in return for advocating the mass adoption of Network of Momentum technologies ➞ Launch date: TBA\n\nThe work for each of these features is happening in parallel, with research, prototyping, development, and testing. Starting with the launch of Accelerator-Z, all future developments will be in the hands of the community, driven by the ethos of Network of Momentum.\n\nJoin the social media channels and start building for a bright future:\n\nWebsite: https://zenon.network/\n\nTwitter: https://twitter.com/Zenon_Network\n\nTelegram: https://t.me/zenonnetwork",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*XmMhXtGeOPJdETF9jq3qLQ.png",
	"url": "https://medium.com/@zenon.network/mission-2022-network-of-momentum-atomic-era-roadmap-f0208898e058",
	"links": [
		"https://medium.com/@zenon.network/mission-2022-network-of-momentum-atomic-era-roadmap-f0208898e058"
	]
}
