{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2022-05-01T20:49:42.384Z",
	"title": "The New NFT Standard: when cryptography meets steganography",
	"content": "The hype of 2021 continues uninterrupted and is posed to disrupt many more industries as the technology matures. Companies and individuals alike are investing considerable amounts of money into NFT projects, and many startups are racing to capitalize on this opportunity. Non-fungible tokens allow anyone to hold ownership of unique digital items and keep track of the ownership via transactions stored on the blockchain. Through this article, we’ll share the new NFT standard and some of its use-cases, while providing some guidance and direction for ecosystem participants to contribute towards turning this pursuit quicker into reality. Pairing the current cryptography stack of the Network of Momentum with digital steganography will set the benchmark for the NFT industry: the Virtual Hologram — more on this later in the article. First of all, let’s start by defining the two concepts underlying the new NFT standard: cryptography and steganography. Both fields of study predate our modern society by at least 2,500 years. Cryptography is the practice and study of techniques that enable authentication, confidentiality, data integrity, and non-repudiation. Cryptography is at the core of our digital world, cryptocurrencies included. Steganography on the other hand is the practice and study of techniques that enable one to conceal a message within another message and communicate without the knowledge of any third parties. However, this lesser-known subject is starting to gain traction in the digital space and deserves a dedicated section to better understand how it evolved over time. History of steganography From its inception, the goal of steganography remained the same: to enable one party to communicate with another party without other parties being aware that the communication is even occurring. A brief history of steganography shows its ancestral roots and how it evolved throughout the centuries: 440 BC — One of the first recorded uses of steganography comes from ancient Greece, where it was weaponized to accomplish military objectives: a ruler called Histiaeus shaved and tattooed the scalp of a slave with a secret message for its ally; when the hair grew back, he sent him through enemy territory to safely deliver the message. 1503 — During the Renaissance epoch, in his famous artwork Mona Lisa, Leonardo DaVinci microscopically painted the letter “L” over the right eye, the letter “S” over the left eye and the number “72” under an arched bridge in the backdrop; a secret message embedded into the painting, remaining undetected over half a millennia. 1887 — In another famous artwork, this time from the post-impressionist era, two Dutch scientists revealed a hidden portrait of a woman using X-rays in Van Gogh’s “Patch of Grass” painting. 1941 — A British army officer imprisoned by the Germans during WW2 painted in its cell German swastikas, American eagles, British lions, and Soviet hammers along with a series of irregular lines and dots — the secret message was written in morse code and translates to “F*ck Hitler”. Digital steganography Nowadays everything converges towards a digital format: from basic things like money and books to entire metaverses. There are several steganographic techniques available today such as LSB and BPCS that are explained below. The first one is simpler and widely used, while the latter is more complex, but has its advantages. LSB: Least Significant Bit Every digital product is essentially a set of bytes; one byte is equivalent to 8 bits. For every type of image file format, one can change the lowest bits to hold message data. An imperceptible change on the visual representation of the image will occur, hiding the contents of the message inside. BPCS: Bit Plane Complexity Segmentation Another more sophisticated method is Bit Plane Complexity Segmentation (BPCS) which stands apart with a very large embedding capacity. In contrast with LSB that can only embed data equivalent to 1/8 of the total size, BPCS uses multiple bit-planes, and so can embed a much higher amount of data, though this is conditional on the individual image. For a ‘normal’ image, roughly 50% of the data might be replaceable with secret data before image degradation becomes noticeable. Combining both cryptography and steganography, the new NFT Standard will provide a next-generation solution to unleash novel use-case and tap into the unexplored potential of NFTs: the Virtual Hologram. Cryptography will be used for encryption and authentication purposes, while steganography will be used to insert it into the NFT. Wrapping it up: the Virtual Hologram Most NFTs are in the form of digital media content such as images, music, or videos. However, the content is not inherently linked to the unique on-chain identity. With the help of digital steganography, the on-chain information can be cryptographically linked and embedded into the actual NFT using the techniques presented earlier. This will change the representation of the NFT in an imperceptible manner, connecting the on-chain data with the off-chain representation. This solution goes even beyond the digital realm: the change in the NFT could transcend into the physical world, similar to Leonardo DaVinci’s code in Mona Lisa. Imagine Satoshi Nakamoto using the Virtual Hologram to embed his signature into the Bitcoin logo he designed back in 2010. Use-case: Embedded Unlockable Content The Virtual Hologram concept can be extended to support a novel use case: embedded unlockable content, while obsoleting counterfeits at the same time. The embedded unlockable content feature will allow creators to extend the utility and value of their NFT beyond a simple blockchain entry and its off-chain media attachment, for example exclusive content and access to premium features. When you create an NFT, you should have the option to add additional content that can only be revealed by the NFT holder. Such content can be anything. High definition content, messages, video content, access to secret communities, discount codes, or even smart contracts, treasures, and easter eggs are all potential candidates for unlockable content. Moreover, adopting the Virtual Hologram will eradicate counterfeiting, the “Save as” method would be useless, as only the NFT holder will be able to authenticate the NFT using its embedded Virtual Hologram. Next steps As the Network of Momentum is up and running with a vibrant community at its helm, a new chapter will begin: the new NFT standard under the ZTS umbrella to enable NFT projects that will inherit NoM’s distinctive properties. It’s worth mentioning that the integration of this new NFT standard will rely on community participation funded through Accelerator-Z grants. For this matter, it’s important to highlight additional components that are needed to fulfill the vision: Virtual Hologram implementation: minting should automatically insert the Virtual Hologram using a steganographic method Spectral Attestation implementation: extract the Virtual Hologram and validate it using on-chain data s y r i u s and other compatible wallets should support registering and transferring NFTs with multiple formats. For example, the s y r i u s wallet should support a simple and intuitive Drag & Drop functionality to mint an NFT or a collection of NFTs Conclusion The NFT market is witnessing an explosive growth. The market is reaching a point of saturation with countless NFT projects with limited utility, largely driven by the whims of only a few platforms such as OpenSea and Rarible that are plagued with high transaction fees. Despite these challenges, there is no denying that the NFT space is projected to grow exponentially in the next few years as new use cases are being discovered and implemented. The Zenon community has the power to change the NFT landscape by implementing the New NFT Standard based on NoM’s feeless, secure, and fast infrastructure. Website: https://zenon.network/ Twitter: https://twitter.com/Zenon_Network Telegram: https://t.me/zenonnetwork Bridge: https://bridge.zenon.network",
	"image": "https://miro.medium.com/v2/resize:fit:1074/1*Td0kgF0iiua19YBKQpjOkg.png",
	"url": "https://medium.com/@zenon.network/the-new-nft-standard-when-cryptography-meets-steganography-9e356007dcaa",
	"links": [
		"https://medium.com/@zenon.network/the-new-nft-standard-when-cryptography-meets-steganography-9e356007dcaa"
	]
}
