{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2021-11-08T22:36:05.967Z",
  "title": "Network of Momentum — The decentralized self-evolving superorganism",
  "content": "In a world where communities contribute without owning or profiting, we’re shifting towards a more meritocratic space where anyone can be incentivized through collaboration. By breaking away from traditional business models centered around benefiting large corporations, Network of Momentum brings the possibility of community-centered economies of scale.\n\nNetwork of Momentum is a self-evolving superorganism that is giving you the tools to grow, develop and govern your own decentralized universe. The collaborative spirit with best-aligned incentives is welcoming every developer, creator, or entrepreneur to monetize their intellectual resources. Same for investors who can provide capital or computing power for staking rewards.\n\nAnd because Alphanet Big Bang’s arrival is right around the corner, this article explains all the levels of NoM participation and how it is designed to support anyone’s progress for enabling a community-governed meritocratic space.\n\nLevel 1: Delegators\n\nDelegation is the process of voting a Pillar to use your ZNN in order to produce momentums. This process increases both the weight and the rank of Pillars in the network, so in exchange for delegating to them, Pillars can set the rewards for their delegators.\n\nThe relationship between the two is symbiotic since the Pillars are looking for more delegations, so they will invariably increase delegators’ rewards and decide according to the delegators’ collective views.\n\nDelegating requires a minimum of 1 ZNN.\nDelegation: APY up to 72%*\n\nLevel 2: Stakers\n\nStaking enables every person to participate in the dual-coin economy by locking ZNN for a pre-defined period of time in order to obtain QSR rewards.\n\nQSR is necessary to create Pillars & Sentinels slots. QSR also can be staked to generate additional rewards like Plasma — the asset used as network gas to confer feeless transactions.\n\nStaking requires at least 1 ZNN.\nStaker: APY up to 24%*\n\nLevel 3: Sentinel\n\nSentinels are full nodes acting as observers for the network’s operations. These are full archival nodes; they store, share and passively validate the ledger.\n\nSpawning a Sentinel requires locking 5000 ZNN and 50000 QSR for the Sentinel slot.\nSentinel: APY up to 60%*\n\nLevel 4: Pillar\n\nPillars are the most valuable asset as they actively participate in the consensus protocol by producing and validating momentums.\n\nThey also represent the backbone of the network, having a governance role by voting community initiatives, Vested Pillars or the projects raising funds through Accelerator-Z.\n\nThey can be seen as governors that have greatly contributed to the network and are the best to represent its delegators’ interests.\n\nRequirements to spawn a Pillar: 15000 ZNN and a minimum of 150000 QSR. Deploying a Pillar slot requires burning the QSR amount.\nPillar: APY up to 80%*\n*APY calculations are based on estimations and may change.\n\nAs you can see, NoM is an autonomous network, harmonizing synergies and collaboration among all participants for a common vision of spreading the network throughout the universe. Moreover, the participants will have the possibility to delegate or stake their ZNN and QSR remotely without needing any additional setup (e.g. keeping an app open on your PC/mobile device) as opposed to spawning a Sentinel or a Pillar node.\n\nThe Alphanet release will devise another striking discovery in the blockchain space: the dual-coin mechanism and the appearance of the new asset, Quasar. The QSR will be the asset powering network operation: faster and feeless transactions & a new way to spawn nodes. This will make it very scarce and essential for NoM’s security, scalability, and deflationary state.\n\nFor those who want to be upfront in these breakthroughs, you can still join until the end of Public Incentivized Testnet. These events are rewarded with Plasma Points, a ZTS convertible to $QSR after Alphanet launch: 1000 $$PP = 1 $QSR.\n\nIncentivized pre-Alphanet events:\n\nLiquidity Pool: Provide liquidity to the $wZNN-BSC pool in exchange for 100.000.000 Plasma Points incentives. The Plasma Points rewards are now multiplied by 3x for new liquidity providers.\n\nSwapDrop: For those who haven’t completed it yet, this procedure represents the transition from the legacy network towards the Public Incentivized Testnet. It will swap legacy wallet assets (without affecting the legacy network balances) to the Zenon Public Incentivized Testnet assets tZNN/tQSR plus a bonus of 100 $PP (Plasma Points) will be credited for every legacy ZNN that was successfully swapped into tZNN.\n\nWarpDrive: represents the incentivized hackathon as the ignition of Accelerator-Z, a decentralized venture connecting and funding early-stage NoM innovators.\n\nEvery living organism is fulfilled when it follows the right path for its own universe.\n\nA new era for Zenon is on the horizon.\n\nTake part in the Z-evolution.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*32RCTZpNzq2e0RxFofJxXQ.png",
  "url": "https://medium.com/@zenon.network/network-of-momentum-the-decentralized-self-evolving-superorganism-fad1de21868",
  "links": [
    "https://medium.com/@zenon.network/network-of-momentum-the-decentralized-self-evolving-superorganism-fad1de21868"
  ]
}
