{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2022-11-24T20:36:26.672Z",
  "title": "Towards NoM Phase 1 — Global Scale, Global Adoption!",
  "content": "It’s no surprise that the whole cryptocurrency world is facing a painful downtrend considering the latest events, with inflation-spraying concerns about a recession, big centralized exchanges collapsing and even a looming depression in sight. However, as with every super-organism, challenging conditions and chaos are either imminent or unavoidable and the way it reacts and adapts will determine its future: the vision should always gravitate towards long-term sustainability and for the cryptocurrency world, this translates into continuous innovation. What are the short & long-term milestones for the Network of Momentum? Most thriving projects will be the ones stepping forward, not just in incremental improvements, but in quantum leaps that will go far beyond the tech status-quo. This article is meant to manifest & lay out some major milestones that will pave the way for NoM Phase 1 Global Scale, Global Adoption. This new and critical phase is not conditioned by any external factors such as time, price, or market conditions, but on the ecosystem’s diversity & value regarding transparency, fairness, and a technical upper hand for this state-of-the-art leaderless network. Since NoM Phase 0 occurred with Alphanet’s Genesis launching its unbreakable, feeless, and scalable dual-ledger, incredible progress has been made by the community in less than a year. Here is just the tip of the iceberg in terms of what was accomplished since Alphanet Genesis: Syrius non-custodial wallet: a cross-platform desktop wallet with embedded full-node that offers by far the best mix of security & privacy for every NoM participant, while strengthening the decentralization of the network. Accelerator-Z: the on-chain funding powerhouse for ecosystem expansion & innovation that enables exponential growth. Hyperspace Program: focused on the tech side to develop SDKs & create interoperability solutions for NoM. NoM Phase 1 is aiming to deliver many disruptive projects that will equip the Aliens for the next big phase portrayed by massive growth at a global scale. To accelerate and gain momentum, there are 3 main directions of research & development that should be the focus during the coming period: Foundational Layer: the core of the network Core upgrades: R&D for the core stack in order to achieve better security, scalability, and decentralization (peer-to-peer connectivity, consensus layer, initial block download, chain verification/validation, transaction processing speedup & increased transaction capacity, dynamic Plasma adjustment mechanism). Governance system: on-chain governance system for seamless network upgrades that are aligned with the ZIP (Zenon Improvement Proposals) framework. Unikernels: R&D for a next-generation computing infrastructure that leverages the unikernel paradigm. Unikernels are self-contained, single-address space machine images derived from the library OS concept with no notion of users, minimal attacks surface, small footprints, and fast boot times. The unikernel implementation can run on top of a hypervisor integrated with a metering mechanism to measure execution time and resource usage. Integrating unikernels within NoM will also require the design of certain deterministic output functions. Smart Contract Virtual Machine: implementing a modern and efficient VM to execute smart contracts on top of the NoM infrastructure. WebAssembly and the multitude of languages that compile to WASM are a good alternatives to EVM, but newer solutions that rely on zero-knowledge proofs such as zkEVM or Zinc also seem very promising to integrate. Security audits: harden the protection of the foundational layer. Accessibility Layer: the gateway for the NoM ecosystem Interoperability solutions: R&D to provide the best interoperability solutions that balance security, ease of use, and decentralization. So far, a cross-chain decentralized bridge based on threshold signature schemes (TSS) is currently under community development and will definitely change how users transfer assets to and from NoM. Also, hashed and point timelock contracts (HTLC and PTLC) are being developed to provide a first glance into basic Bitcoin interoperability. While the Bitcoin Taproot network upgrade was activated over a year ago on mainnet, reaching the next halving with Zenon users being able to use Bitcoin must be one of the main priorities among the interoperability objectives, and some HyperCore nominees are greatly advancing in this direction. User experience: develop and deploy secure and user-friendly mobile wallets & Web3 wallet browser extensions. The goal here is to facilitate effortless access for the next million users. Current work in this direction has already been started by the community: the Syrius mobile apps are under active development, while the Syrius browser extension is already available for testing. DEX & on-ramps: develop and deploy decentralized exchanges, and create on-ramps and digital marketplaces leveraging the NoM infrastructure. Adoption Layer: mainstream adoption comes with solid use-cases and greater visibility within the cryptocurrency space Marketing Framework: develop effective funnels based on a structural & functional master plan for attracting new users to learn, use & develop on NoM. As classic social media channels are restricting advertising for decentralized projects, it becomes imperative that the community should focus on attracting marketing agencies and developing alternative solutions that expand awareness on mainstream social media by using incentivization mechanisms. NFT Standard: innovate and uplift the existing NFT technology to expand the use-cases of non-fungible tokens within Web3. An upgrade for the ZTS framework can be released in order for NoM to support non-fungible assets as well. Institutional adoption framework: develop suitable tools for institutions to access, store and use NoM digital assets (hardware wallet support, custody solutions, etc.). The HyperCore & HyperGrowth teams will obviously play an essential role in developing, testing, deploying, and delivering sustainable projects. However, the need & pursuit for brilliant contributors must never cease as long as Accelerator-Z can be accessed and servers as an open funding mechanism for everyone willing to build within the NoM ecosystem. Network of Momentum’s revolution is just getting started. The development of next-generation blockchain infrastructure, applications, and Web3 use-cases that fulfill the leaderless decentralization principle is imminent. The latest cryptocurrency meltdown should reinforce again the fact that we should only focus on trustless and decentralized technologies, which stand at the core of Zenon. The next wave of opportunity is building real-world use cases to improve the lives of individuals, elevate businesses and disrupt industries with the undisputed capabilities of NoM’s decentralization: transparency, robustness, security & built-in privacy. NoM is blended with real builders, and bear markets represent the best opportunity to step up and create real value. The future is encrypted. Only you can decrypt it! Website: https://zenon.network/ Twitter: https://twitter.com/Zenon_Network Telegram: https://t.me/zenonnetwork",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*CijK7d-oThpf_90sU4ntuw.png",
  "url": "https://medium.com/@zenon.network/towards-nom-phase-1-global-scale-global-adoption-9046ec78218d",
  "links": [
    "https://medium.com/@zenon.network/towards-nom-phase-1-global-scale-global-adoption-9046ec78218d"
  ]
}
