{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2021-11-17T22:39:12.765Z",
	"title": "Orbital Program — Protocol Level Liquidity",
	"content": "Zenon Network — Orbital Program. Protocol Level Liquidity\n\nAlphanet Big Bang is closer than ever. This game-changing development represents a vast universe where anyone can create, store, exchange, and monetize any type of asset in a decentralized, secure, and scalable manner.\n\nThis article approaches the following subjects: the upgraded coin metrics and a glimpse of a new upcoming program turning into reality after the Alphanet is released.\n\nAn important step towards decentralization has been made before the Alphanet launch by providing experimental support for the wrapped ZNN (wZNN) in a one-way BSC (Binance Smart Chain) Bridge.\n\nOne of the features for the Alphanet is protocol-level interoperability and further expansion of the ecosystem by following a multi-chain path. The goal towards true decentralization and coin accessibility can be accomplished by building bridges with other ecosystems.\n\nCoin metrics\n\nNetwork of Momentum was designed with a robust and self-sustainable coin economy where participants can thrive through multiple incentivization systems aligned with the security and decentralization provided by the underlying architecture.\n\nThe Alphanet coin metrics is balancing both inflationary and deflationary forces. To better understand them, let’s dive deeper into NoM’s actors:\n\nPillars: requires both ZNN and QSR (requires Pillar Slot, the QSR is burned) with rewards in ZNN\nSentinels: requires both ZNN and QSR (requires Sentinel Slot, the QSR locked) with rewards in both ZNN & QSR\nDelegators: requires >1 ZNN, rewards in ZNN\nStaking: requires >1 ZNN, rewards in QSR\n\nAn important mention here: Pillar and Sentinel actors represent active participants at the network level, while delegators and staking are passive. Pillars are directly participating in the consensus protocol. Sentinels will play a key role in the network infrastructure, while delegators have a role in determining the rank of the Pillars and staking is entirely virtual from a network perspective.\n\nMoreover, there are also additional deflationary forces spinning around the network. An ever-increasing number of QSR is burned whenever a Pillar Slot is created. Issuing a ZTS token requires burning 1 ZNN.\n\nOrbital Program: Protocol Level Liquidity\n\nIn order to create a more prosperous and inclusive environment for both the network and its participants, we’re introducing Orbital Program: protocol level liquidity.\n\nThis will incentivize current and new participants to provide cross-chain liquidity with dual-rewards. This new incentivization mechanism is designed to keep a fair distribution depending on the value added into the network.\n\nThe Protocol Level Liquidity Program implies that a fraction of all network rewards will be collected and further on can be redistributed by an embedded smart contract in a trustless and censorship-resistant way.\n\nInitially, this fraction will be set at 15% ZNN & 25% QSR of the total dual-coin emission and the chains with the corresponding liquidity pools will be decided by the Pillars.\n\nThe main takeaways from this novel direction are:\n\nEnsuring sustainable liquidity provision for the ecosystem\nIncreasing the ecosystem accessibility\nMerging communities and attracting people from other ecosystems\nExpanding the protocol-level interoperability\n\nDual-coin emission as shown in the figure below:\n\nPillars: 50% of ZNN rewards\nSentinels: 13% of ZNN & 25% of QSR rewards\nDelegators: 24% of ZNN rewards\nStakers: 50% of QSR rewards\nProtocol Level Liquidity: 13% of ZNN & 25% of QSR rewards\n\nStay close for the Alphanet Big Bang!\n\nWebsite: https://zenon.network/\nTwitter: https://twitter.com/Zenon_Network\nTelegram: https://t.me/",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*-Ci8SFzrcn7S4wFsfILxgw.png",
	"url": "https://medium.com/@zenon.network/orbital-program-protocol-level-liquidity-2f9567830105",
	"links": [
		"https://medium.com/@zenon.network/orbital-program-protocol-level-liquidity-2f9567830105"
	]
}
