{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2020-10-07T15:02:42.186Z",
  "title": "Paving the way",
  "content": "Intro\n\nZenon can change the nature of big enterprises and small to medium companies by providing its state-of-the-art infrastructure, integrating and participating in all the newly emerging technologies.\n\nDistributed ledger technology (DLT) is crossing its tipping point, becoming a mature technology that provides multiple advantages over traditional solutions and solves several of their ongoing limitations. It is hard to imagine a sector in which DLT cannot improve or solve existing problems.\n\nIn this article, we will begin to state and analyze some of the domains where Zenon’s Network of Momentum can support and innovate by providing its state-of-the-art, decentralized infrastructure for businesses to build, grow and thrive.\n\nUse-cases\n\nAI & Big Data\n\nAI and Big Data are two buzzwords that everyone heard at least once before. They are genuinely transformative technologies that have nearly unlimited upside potential. The automation of work that began in the early XVIII century with the steam engine’s apparition leads to a massive industrialization trend and advancements that were impossible to achieve since the birth of humanity. This movement sparked an explosion of innovations and discoveries that enabled the human race to conquer space two centuries later.\n\nMachine learning and, more recently, deep learning have the same potential to disrupt and innovate industries beyond our current understanding. We are at the dawn of a new era of our civilization, and the current state of AI can be compared to the first steam engine; it works and does the job but can be improved thousands of times both in scale and efficiency. It can be improved in the same way the rocket engine was the culmination of generations of improvements upon the steam engine helping humankind put a step on the Moon’s soil.\n\nHowever, deep learning algorithms require a lot of raw data and computational power to process and train to achieve better results — the parameters of the networks are adapted dynamically with every new pair of training data and its result. This uncovers one of the secrets of deep learning: data. Data is the new oil. The more data you have, the more precise the results will be. The downside is that big data means immense computational power.\n\nToday, the most widespread neural networks have obtained their parameters by running over vast GPU-powered clusters. We believe the next major movement regarding artificial intelligence and deep learning would be to run deep learning algorithms on a “global supercomputer” by leveraging the DLT to function. It should employ algorithms to evenly distribute those tasks on subsets of nodes that are part of the network and can handle the job (i.e., are equipped with GPUs or specific hardware).\n\nNonetheless, deep learning algorithms have many applications, some that are already mainstream, mainly in the fields of computer vision like autonomous driving, natural language processing like real-time translation, the automation of tasks like RPA, and many more.\n\nDAOs and DACs\n\nDecentralization is a core feature of any cryptocurrency network, and its adopters should be the ones that dictate the path and vision of it in a pseudonymous and decentralized way. Zenon Alphanet release offers the complete infrastructure for users to vote or propose new ideas and upgrade or enhance the network according to their vision. Combining the governance system with the delegation feature where ZNN coins act as votes, Zenon becomes a DAO following its community’s rules. Leveraging smart contracts and the upcoming SDKs, anyone can create, deploy, manage, and interact with DAOs or DACs. Even more, exciting and brand new use-cases can arise if they are further enhanced with AI.\n\nOracles\n\nAny DLT network needs to have the ability to interact with external data. Oracles are designed to supply and feed external information into the network, and they represent the bridge between on-chain smart contracts and off-chain data. Sentinels and sentries will have the possibility to act as oracle nodes for the Zenon ecosystem. They can validate data from various applications and industries such as prediction markets, supply chain management to more complex areas such as DeFi (insurance, loans, stablecoins, etc.).\n\nSecure Data Storage\n\nNetwork nodes process and store transactional data inside a decentralized ledger accessible for everyone, anytime. Any sensitive records, such as financial documents or biometric data, can be safely stored and retrieved. Each record will have a unique hash, and its authenticity can be instantly validated, without having the prospect of modifying the information in any way. Paired with a next-generation protocol like IPFS, it can offer endless possibilities for various domains such as real estate, accounting, notary services, etc.\n\nDecentralized Digital Identity\n\nOne of the main qualities of a DLT is its immutability. A decentralized digital identity service can foresee and prevent digital tampering, replicated identities, and identity theft. Blockchain-based solutions promise to pave a way to reimagine identity services, and Zenon will offer the tools to build such services.\n\nThe digital era has confirmed to be shifting to a more knowledgeable society, taking advantage of the current emerging technologies. Artificial intelligence is influencing the fate of practically every industry and every human being; together with Big Data, IoT, DAOs, and Oracles, DLT will create a solid foundation for any type of IT&C system.\n\nTo summarize, Zenon will attempt to add value and deliver solutions in four primary areas of interest:\n\n1. Trust-less and large-scale computing — the democratization of large-scale computing infrastructure will shift from centralized Cloud providers towards a decentralized Fog, a purely peer-to-peer Edge-based infrastructure.\n\n2. Decentralized data solutions using state-of-the-art cryptographic mechanisms with oracles enable secure data storage and retrieval for many fields that need fast, safe, and reliable data streams such as sensitive data-sets for AI or peer-to-peer communications data of IoT devices.\n\n3. Data monetization and dissemination as centralized providers such as social media giants hold a powerful grip on your data. DAOs and DACs shift the monolithic ad-centric business model to a micro-payments, privacy-preserving model where content will be shared and consumed not only by humans but also by other network peers such as IoT devices.\n\n4. Decentralized Identity services as centralized identity solutions are prone to censorship, hacks, and different types of errors. A decentralized identity solution will enable a true heterogeneous peer-to-peer economy where devices enhanced by AI can securely and freely transact with humans and between themselves without risking censorship or any other form of third-party interference.\n\nConclusion\n\nThis article only scratches the surface about how the Network of Momentum and Zenon will consolidate all the industries willing to digitalize and enhance their businesses using DLT. Above all, the article tried to provide a glance at the current state of DLTs and what problems they aim to solve in various business areas. In contrast, it offered a glimpse of what is coming for the Network of Momentum and its participants.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*F4p6UEZSEOciogujUdhG7Q.jpeg",
  "url": "https://medium.com/@zenon.network/paving-the-way-1332f61a66b2",
  "links": [
    "https://medium.com/@zenon.network/paving-the-way-1332f61a66b2"
  ]
}
