{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2021-10-20T19:03:21.078Z",
	"title": "Plasma: the new fee paradigm for the next-gen decentralized network",
	"content": "Since the beginning of cryptocurrencies, we’ve painted this vision of the future: “Imagine sending money around the world, instantly, with no middlemen or fees!”. Moreover, we’ve protested against traditional financial institutions with their endless chains of middlemen and sky-high fees or greedy credit card companies that charge 3–5% for every transaction. But nowadays, cryptocurrency transactions have managed to accomplish only one of the two core objectives: removing the middleman. Fees are still a problem that is getting worse as more people are transacting using cryptocurrencies. Fees are now way higher compared to their traditional counter-parties.\n\nWe have to admit that it’s not the future we envisioned, and transaction fees are still a big mess in the crypto space. However, this article is anything but promoting the obsolete banking system; it is about understanding the root of this issue and explaining how Network of Momentum is changing the fee paradigm in order to enable everyone to move value instantly around the world, in a simple, secure, and feeless way.\n\nThere are multiple types of fees, that can be further categorized into:\n\n• Network fees: decentralized & on-chain, popularized as “gas” (fees) by Ethereum; set by and paid to the miner/validator that records the transaction into the ledger\n• Layer-2 fees: semi-decentralized & off-chain (usually based on a federation model), transactions on layer-2 protocols like Lightning Network have minimal fees but are prone to censorship or other third-party interference\n• Exchanges fees that can be further divided into:\n— Centralized & off-chain transactions on centralized exchanges like Binance or Coinbase where the fees are usually low, but users have no control over their funds\n— Decentralized & on-chain or other novel layer-2 DEXs; for instance, Uniswap fees are on-chain and for this reason, the trading experience can be disrupted (for example, fees can be bigger than the actual swapped amount)\n\nFees can be explained using a simple analogy: running a real-world car for X miles usually require Y gallons of fuel. This is similar to the blockchain space where you can send X amount of cryptocurrency to an entity paying Y amount as the processing fee. Unlike cars that cannot go faster using more fuel, setting a higher fee amount translates into faster processing times.\n\nThe problems appear when the costs of performing the transaction become highly unpredictable by the laws of demand and supply along with other several factors such as:\n\n• Network congestion: how busy is the network at that moment in time; an overloaded network means prohibitive fees\n• Transaction size: the amount of data that transaction represents; a higher size means higher fees\n\nBasically, the exact fee you end up paying for a cryptocurrency transaction depends on the consensus protocol and the overall traffic at that particular time on that network. To put it into context, the average fee per transaction on the Ethereum network rallied to an all-time high last quarter.\n\nMoreover, the explosion of DeFi and NFTs highlighted Ethereum’s weaknesses as slow and expensive. And if all of this wasn’t enough, there are also multiple cases of accidents where traders’ deposits got mistaken with fees, some ending up paying millions of dollars in fees. It is important to mention that this class of bugs is nonexistent in NoM due to the specific feeless implementation that involves Plasma.\n\nWhile legacy bloated blockchains like Ethereum have very high fees, newer competitors like Solana or Polkadot have lower fees but come at the cost of network security (for example Solana’s recent network halt), while true decentralization remains a valid unknown.\n\nSolving the Fee Paradigm\n\nThe high-fee transaction issue isn’t a new one. This was a problem famous during the 2017 bull run, that was brought into the spotlight by the CryptoKitties dApp which rendered Ethereum almost unusable, and it’s still a problem now.\n\nNetwork of Momentum proposes a new approach aiming to solve the high transaction fees through an unprecedented fee mechanism called Plasma.\n\nSo let’s take it all one by one.\n\nNetwork of Momentum introduces a new dual-coin approach with ZNN and QSR as primary assets working in synergy to power the network. Creating nodes on the network requires both ZNN and QSR.\n\n• ZNN is used as collateral to spawn Pillars (15000 ZNN locked) and Sentinel (5000 ZNN locked) nodes\n• QSR is used to create Pillar (150000 QSR for legacy Pillars and 10000 QSR more for each additional Pillar Slot; the QSR amount required for the Pillar Slot is burned) and Sentinel Slots (50000 QSR locked)\n• QSR can also be fused (staked/locked) to generate Plasma (minimum 10 QSR) that acts as gas for the network\n\nPlasma can be seen as a third-dimension asset similar to the mana concept employed by many popular games (more mana grants you the possibility to cast spells more often and recharges faster if you possess better items).\n\nPlasma is an anti-spam mechanism that acts as the network gas to confer insignificant or no fees at all, suitable for any type of participant or transaction. The concept is simple: the more Plasma you possess, the higher transaction throughput you can achieve. In order to generate Plasma, all you need to do is to fuse (stake/lock) QSR.\n\nYou can already experiment with all of these features inside the Syrius wallet running on the Zenon Public Incentivized Network: https://testnet.znn.space/\n\nThe greater the amount of QSR you fuse (stake/lock), the greater the amount of Plasma you generate for that address, translating into more transactions you’ll be able to perform.\n\nFor example, you are a merchant owning an online shop, and you have lots of daily transactions.\n\n• To accommodate a high volume transactional throughput, all you have to do is fuse a larger amount of QSR that in turn will automatically generate more Plasma. And likewise, Plasma will recharge faster than being consumed, so no need to worry about running out of it if you have enough QSR fused.\n• In the case of low-volume transactional throughput, you don’t necessarily require fusing QSR at all: the network allows you to submit a valid proof-of-work in return for a small quantity of Plasma.\n\nThis can be a game-changer for many people that are using crypto on a daily basis: for example, if you want to move some tokens or NFTs on Ethereum. If the network is congested at that particular time, you’ll need to pay more in gas fees than the transaction itself. This happens regularly, and it’s an obvious obstacle for mass adoption if one needs to pay more in fees than the actual cost of the transaction.\n\nMoreover, this specific proof-of-work has another vital role: it adds weight to the ledger, increasing the overall security of the network in the face of Sybil adversaries.\n\nAnother important aspect of the NoM feeless paradigm is the implementation of the Zenon Token Standard — ZTS allowing anyone to create tokens without writing code, right from the Syrius wallet. These ZTS tokens are native to the protocol level.\n\nWhat does this mean?\n\nWell, it means that ZTS tokens inherit the feeless properties of ZNN and QSR: transferring tokens instantly without fees. Imagine having a DEX implementation like Uniswap, but with ZTS instead of ERC-20: no more outrageous swap fees and a better experience overall.\n\nThrough this unique architecture, Network of Momentum marks a significant milestone in developing a better DLT encompassing greater scalability, low usage cost, fairness of the initial distribution, and full decentralization.\n\nAre you ready?\n\nWebsite: https://zenon.network/\nTwitter: https://twitter.com/Zenon_Network\nTelegram: https://t.me/zenonnetwork",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*BJkjVZpkcVk1x5bmKezH0Q.png",
	"url": "https://medium.com/@zenon.network/plasma-the-new-fee-paradigm-for-the-next-gen-decentralized-network-4ec3f27e4a6b",
	"links": [
		"https://medium.com/@zenon.network/plasma-the-new-fee-paradigm-for-the-next-gen-decentralized-network-4ec3f27e4a6b"
	]
}
