{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2020-07-30T18:14:52.159Z",
  "title": "Project Quasar",
  "content": "Presentation / Use-case / Lock-Drop / S y r i u s\n\nPRESENTATION\n\nSince the beginning, we have been striving to find approaches and ideas to improve the future network protocol while keeping our users incentivized to engage and build on the Zenon ecosystem.\n\nZNN and QSR will be the two coins that will power NoM, each with its purpose, forming a complementary coin mechanism underlying the Network of Momentum’s architecture.\n\nUSE CASE\n\nQSR will function as fuel for the Network of Momentum, powering all services designed on the future Zenon infrastructure, known as zApps. The creation of a dual-coin mechanism will further improve the general coinomics of ZNN, reducing coin exposure and tackling inflation by focusing its vision on a Pillar and Node requirement.\n\nThe network’s main participants are Pillars and Nodes, which have contributed to the network stability in a continuous manner. With a total of 132 active Pillars and 68 active Nodes, Zenon has evolved into a highly decentralized and secure network in the cryptocurrency space.\n\nLOCK-DROP DISTRIBUTION\n\nQuasar (QSR) will be distributed to Pillars and Nodes according to a Lock-drop distribution timeline.\n\nThere will be a total of 4 snapshots during the Lock-drop phase, taken at settled block numbers. To qualify for the Lock-Drop, Pillars and Nodes need to be active when the snapshots occur. The 5K output must be unspent at the block of the snapshot and the node must have received at least 1 reward in the interval of the snapshot block +/- 1440 blocks.\n\nThis action will happen twice a month for two months, as follows:\n\n1st Lock-Drop: block 730,000\n2nd Lock-Drop: block 750,160\n3rd Lock-Drop: block 770,320\n4th Lock-Drop: block 790,480\n\nDistribution structure\n\nQSR will be distributed after the testnet launch at a 1:10 (ZNN:QSR) ratio.\n\n1 Pillar = 150,000 QSR\n1 Node = 50,000 QSR\n\nEach snapshot designates 25% of the total QSR assigned to a participant. Participants will still be eligible for a partial Lock-drop if they do not reach 100%. For example, if they only participate in two of the snapshots, the QSR amount received will only be 50% of the amount that has been designated to a network participant.\n\nRegarding future Pillar creation, when the Network of Momentum launches, users will require 15,000 ZNN and 150,000 QSR to set-up a Pillar. After the QSR has been used to create the Pillar, it will be burned. Nodes will require 5,000 ZNN and 50,000 QSR, but in this case, the QSR will not be burned.\n\nIt has occurred amongst the community that an unfixed number of Pillars will provide more decentralization for the Network of Momentum’s future architecture, and we embraced this viewpoint.\n\nQuasar will be mintable and will act as a primary reward for staking and a secondary reward for Nodes. After the distribution ends, QSR will provide supplementary Pillar slots for the Zenon ecosystem.\n\nPillars will continue to receive ZNN as rewards.\n\nNodes will receive both ZNN and QSR, but less than Pillars.\n\nStakers can choose to stake or delegate in which case they will receive QSR (for staking) or ZNN (for delegating).\n\nQSR Minting structure:\n\nMonth 1–4: 600,000 QSR / month\nMonth 5–7: 450,000 QSR / month\nMonth 7 until new coinomics: 150,000 QSR / month\n\nExcluding the current 136 Pillar slots, each additional Pillar slot will require an extra 10,000 QSR to be burned for creating a slot. For example, when creating a new Pillar, it will require 15K ZNN and 160K QSR, according to the formula: max(0, (number_of_pillars — 136 + 1)) * 10,000 + 150,000\n\nS y r i u s\n\nSyrius will feature the dual coin concept that Quasar enables in an easy and intuitive user interface, providing a comprehensive solution to access and manage assets. Network participants will be able to create Pillar slots, stake ZNN to obtain QSR, and more, directly from the Syrius wallet in an environment where users have complete control over funds.\n\nMore extensive data will be provided while we continue to push into a new era powered by a dual coin architecture. Zenon and Quasar complement each other by forming a structure perfectly balanced for what is intended to be achieved.\n\n— — — \nOne network, two cores, same foundation.",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*wKWARigNbRMGpOslU7fx6w.jpeg",
  "url": "https://medium.com/@zenon.network/project-quasar-88c3ddf850c3",
  "links": [
    "https://medium.com/@zenon.network/project-quasar-88c3ddf850c3"
  ]
}
