{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2021-09-27T16:10:27.472Z",
  "title": "SwapDrop Event — October 1st",
  "content": "The SwapDrop is an incentivized test swap designed specifically for the Zenon Public Incentivized Testnet. The same swap procedure that will be used during the Alphanet Cycles will be tested with a minor change: the decay algorithm will not be present.\n\nThis procedure will swap legacy wallet assets (without affecting the legacy network balances) to Zenon Public Incentivized Testnet assets (tZNN and tQSR) that implements the new Alphanet wallet format. A bonus of 100 PP (Plasma Points) will be credited for every legacy ZNN that was successfully swapped into tZNN. 1000 PP=1QSR\n\nEvery participant will be able to test the swap and migrate their assets from the legacy network to the Zenon Public Incentivized Testnet.\n\nThe swap wallet exported from ZenonCore contains all your legacy addresses and associated private keys in an encrypted format. Be extra careful when dealing with wallet files, beware of scammers and never share any private information with anyone!\n\nSwapDrop tutorial\n\nFirst open the legacy wallet: ZenonCore v1.6.5\nNavigate to File -> Export Swap Wallet in order to export the legacy wallet.dat into the proper swap wallet format (“.swp”)\nEncrypt the swap wallet file with the encryption key of your legacy wallet.dat file; choose a location to save it\nOpen Syrius wallet v4.0.0 or later\nNavigate to Settings -> Wallet Options -> Swap wallet\nRead and accept the SwapDrop notice in order to proceed with the swap\nImport the “.swp” wallet file that you’ve exported earlier; it must have the proper extension: “.swp”\nDecrypt the “.swp” wallet file with the key from step 3\nSwap the legacy funds by selecting the testnet addresses\nCheck your tZNN, tQSR and Plasma Points balances on the Zenon Public Incentivized Testnet\n\nThe legacy assets (ZNN and QSR, if applicable) will be swapped into testnet coins (tZNN and tQSR, if applicable) without affecting the legacy network balances.\n\nIf you participated in the Quasar Lockdrop and there are any issues, please reach out on the community channels for support.\n\nBefore initiating the swap procedure, make sure you have a backup for the Public Incentivized Testnet wallet.\n\nStay updated by joining the social media channels:\nTwitter: https://twitter.com/Zenon_Network\nTelegram: https://t.me/zenonnetwork\nDiscord: https://discord.gg/XDDjECy",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*Eqgw2KXDl5-wLlXeiy2TPw.png",
  "url": "https://medium.com/@zenon.network/swapdrop-event-october-1st-bd99964589aa",
  "links": [
    "https://medium.com/@zenon.network/swapdrop-event-october-1st-bd99964589aa"
  ]
}
