{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2021-11-11T22:22:12.417Z",
	"title": "The next chapter: Network of Momentum Phase 0 Decentralized Transition Mechanism",
	"content": "Decentralization is at the core of Zenon. A one-of-a-kind Decentralized Transition Mechanism has been developed to ensure both fair participation and a smooth transition from the legacy network towards NoM Phase 0.\n\nThe DTM features two complementary components: the Zenon Public Incentivized Testnet and the Genesis Convergence, culminating with the Zenon Alphanet Launch, the Big Bang moment for NoM Phase 0.\n\nIntroducing Plasma Points\n\nThe dual coin mechanism that stands at the foundation of NoM Phase 0 is represented by the intrinsic synergy between ZNN and QSR.\n\nAcquiring QSR was only possible during the QSR lockdrop that was live several months ago for a brief period of time. This translated into a very limited number of users that were able to participate and acquire QSR.\n\nConsequently, in order to provide greater decentralization and accessibility of QSR, a new distribution scheme will be available for all Public Incentivized Testnet participants during the Incentivization period, which starts when the Public Incentivized Testnet is live and ends at Alphanet Launch.\n\nPlasma Points is a ZTS token exclusively available during the Incentivization Period that will be converted to QSR at Alphanet Launch at the following ratio: 1000 PP = 1 QSR.\n\nZenon Public Incentivized Testnet\n\nThe Zenon Public Incentivized Testnet represents a release candidate version of the Alphanet. In order to participate, anyone can follow the following steps:\n\n1. Download the latest version of the syrius wallet\n2. Securely backup the Seed Vault\n3. Navigate to the Incentivization tab\n4. Complete quests and accumulate Plasma Points\n5. After Alphanet Launch, import the Seed Vault into the Alphanet syrius wallet\n\nGenesis Convergence\n\nThe community will need to coordinate in a decentralized manner for a successful Alphanet Launch. There are 4 stages for the Genesis Convergence outlined below.\n\nStage 1: Genesis Legacy Snapshot Block\n\nThe Genesis Legacy Snapshot Block will be announced on all public channels prior to Alphanet launch.\n\nThe Pillars that are active on the legacy network at the announced block, will become part of the Public Incentivized Testnet Genesis.\n\nEligible legacy Pillars will then have the opportunity to become Genesis Pillars, participate in the Genesis Assembly and produce the first momentums for the Alphanet.\n\nStage 2: Genesis Pillar & Genesis Incentivized Snapshot Momentum\n\nA second snapshot, the Genesis Incentivized Snapshot Momentum will happen on the last day of the Public Incentivized Testnet.\n\nLegacy Pillar operators will need to download the latest version of the syrius wallet or the command line tool and set up a Genesis Pillar on the Public Incentivized Testnet.\n\nTo become a Genesis Pillar, a legacy Pillar must satisfy the following conditions simultaneously:\n\n1. Active & produced >90% of its target momentums on the Public Incentivized Testnet during the last day\n2. Continue to be active on the legacy network\n\nStage 3: Genesis Assembly\n\nOnce the Public Incentivized Testnet ends, the Genesis of the Alphanet will be generated based upon the states of the legacy network and the Public Incentivized Testnet.\n\nIt will include all eligible Genesis Pillars and updated QSR balances computed from the number of Plasma Points that have been accumulated during the Public Incentivized Testnet.\n\nStage 4: Alphanet Big Bang\n\nThe eligible Genesis Pillars will load the Alphanet Genesis from a decentralized source and wait for the Big Bang singularity.\n\nAt Big Bang, a randomly selected Genesis Pillar will produce the first momentum: a small step for a Genesis Pillar, a huge leap for Zenon.\n\nNetwork of Momentum Phase 0\n\nFrom this point forward, all users will have the possibility to join the Alphanet and start swapping their ZNN and QSR, marking the start of the Alphanet Swap Cycles.\n\nA new era for Zenon is on the horizon.",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*oWTiOJIUlc_fNnPX-bkd5Q.png",
	"url": "https://medium.com/@zenon.network/the-next-chapter-network-of-momentum-phase-0-decentralized-transition-mechanism-7d01ae701d61",
	"links": [
		"https://medium.com/@zenon.network/the-next-chapter-network-of-momentum-phase-0-decentralized-transition-mechanism-7d01ae701d61"
	]
}
