{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2022-01-06T15:14:54.362Z",
  "title": "WarpDrive — The pre-Alphanet Zenon Hackathon",
  "content": "Blockchain is the most exciting and rapidly growing field of tech right now. The fact that we can create a decentralized future through cutting-edge technologies, iterate quickly, and have immediate incentives can be truly game-changing.\n\nThe Zenon team is excited to announce a crucial pre-Alphanet event: WarpDrive.\n\nZenon WarpDrive is the first virtual global hackathon designed to engage the community and accelerate the rapid growth of the ecosystem. It serves as the foundation for the Alphanet Accelerator, where the winning ideas of WarpDrive will have a tremendous opportunity for accessing funds in a decentralized way. The WarpDrive event is incentivized using $QSR.\n\nAlphanet — Network of Momentum Phase 0 is a decentralized, fast, feeless, and censorship-resistant network designed to overcome the limitations of the current blockchain or DAG-based cryptocurrencies through its unique and superior Layer-1 dual coin, dual-ledger architecture.\n\nZenon WarpDrive is here to materialize your most extraordinary ideas, allowing any blockchain enthusiast, developer, or investor to discover and leverage the power of NoM.\n\nWarpDrive focuses on the following categories:\n\n1. Web3 solutions\n2. DeFi\n3. wZNN\n4. Tools & utilities\n5. Gaming\n6. Internet of Things\n7. Payment integrations\n8. Decentralized storage\n9. Community SDKs\n10. Guides & Articles\n\nAlthough there is a pre-defined list of categories that one should focus on, projects that can use and enhance NoM in exciting ways are also eligible (e.g., off-chain solutions, service providers integrations, cross-chain solutions, etc.).\n\nWarpDrive Methodology\n\nParticipants may apply by posting on the Zenon community channels. It is up to the community to select and promote the most promising projects. For example, a participant may apply on Twitter by posting a tweet containing the name, description of the project, a link to a more detailed article, and #WarpDrive hashtag. Similarly, on Telegram or Discord. Using the #WarpDrive hashtag can help boost the project’s visibility throughout the community.\n\nThe judging panel will consist of 7 independent members chosen entirely by the community. They should be reputable members with diverse skill sets. They will review the projects, set the prize amounts, and decide who is worthy to receive the $QSR.\n\nIt’s both an opportunity and a responsibility for the community to self-organize and deliver value to the ecosystem.\n\nThe total amount of the prize pool is 100.000 $QSR.\n\nGet the right equipment from: zenon.network/warp-drive\n\nJoin the community and get engaged!\nTwitter: https://twitter.com/Zenon_Network\nTelegram: https://t.me/zenonnetwork\nDiscord: https://discord.gg/XDDjECy",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*mWgRa3bLFRXdiZi7X0Io1Q.png",
  "url": "https://medium.com/@zenon.network/warpdrive-the-pre-alphanet-zenon-hackathon-adc668a2a1fc",
  "links": [
    "https://medium.com/@zenon.network/warpdrive-the-pre-alphanet-zenon-hackathon-adc668a2a1fc"
  ]
}
