{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2021-12-09T14:31:10.453Z",
  "title": "Wrapped ZNN (wZNN) Liquidity Program",
  "content": "After receiving several requests from the community, we’re thrilled to announce the Wrapped ZNN Liquidity Program featuring a 100.000.000 Plasma Points incentive fund ready to be claimed by liquidity providers.\n\nLiquidity is essential for enabling a healthy and prospering decentralized ecosystem. As so, in this article we are taking you through the details of this Liquidity Program, the importance of obtaining Plasma Points ($PP), and the step-by-step guide on using Zenon BSC Liquidity Pool.\n\nZenon has created the one-way bridge on BSC by providing wrapped Zenon (wZNN) and allowing anyone to provide liquidity to the $wZNN-BSC pool. The LPs (Liquidity Providers) will earn trading fees from the pool and $PP — the only ZTS token convertible to $QSR at Alphanet launch.\n\nBy providing more liquidity, Zenon stands to win more conversions in the market which generates more fees & $PP for LPs.\n\nHow many Plasma Points are allocated for the Liquidity Program?\n\nAs mentioned before, $PP along with $QSR will be a critical and limited asset after Alphanet Launch. One of the few ways to generate $PP that will subsequently generate $QSR is by providing liquidity. You can find below the $PP rewards distribution:\n\nTotal Liquidity incentives: 100.000.000 $PP\nDaily Liquidity incentives: 1.785.715 $PP\nLiquidity Program duration: 56 days\n\nInstructions for the wZNN Liquidity Program\n\nNote: wZNN Liquidity Program starts on September 24th\n\nGet wZNN from PancakeSwap or by swapping ZNN to wZNN at bridge.zenon.network.\nAdd liquidity to the wZNN/WBNB PancakeSwap pair.\nNavigate to bridge.zenon.network and pick wZNN Liquidity Program from the main menu.\nPaste your Zenon Public Incentivized Testnet address and click Submit.\nThe Web3 wallet will ask for permission to sign a message. Confirm the action to continue.\nDone. If everything went well you should see a confirmation message.\n\nConsiderations\n\nMake sure you have the LP tokens in the Web3 wallet address you’re connected to.\nOnce you associate your BSC address with your Zenon Public Incentivized Testnet address, this can’t be changed.\nThe $PP are distributed every 24 hours after 00:00 UTC. Make sure you have added liquidity to the wZNN/WBNB PancakeSwap pair before the next rewards cycle.\n\nCheck out the previous Medium article that covers what wZNN is and how to swap legacy ZNN to wZNN.\n\nPlease keep in mind this is an experimental setup that does not guarantee risk-free security.\n\nStart generating Plasma Points today and get ready for Alphanet Big Bang!",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*dwzhKSG2bEGl7MPYDMkzpw.png",
  "url": "https://medium.com/@zenon.network/wrapped-znn-wznn-liquidity-program-2b50fd0e4758",
  "links": [
    "https://medium.com/@zenon.network/wrapped-znn-wznn-liquidity-program-2b50fd0e4758"
  ]
}
