{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2022-02-15T21:09:09.532Z",
  "title": "Wrapped ZNN (wZNN) Liquidity Program — Alphanet Edition",
  "content": "The 2-way bridge with BSC (BNB Chain) has been released, which means that anyone can swap wZNN to ZNN and vice-versa.\n\nLiquidity is a crucial factor for all operations in DeFi, such as token swaps, lending or borrowing. Low liquidity levels for a specific token may lead to volatility and conversely, high liquidity means that heavy price swings are less likely.\n\nThe wZNN Liquidity Program — Alphanet Edition has started right after the #AlphanetBigBang and is currently live.\n\nAs the Public Incentivized Testnet had 1.800.000 QSR unclaimed, they will be redistributed to LPs on Alphanet, with up to 10x daily rewards multiplier.\n\n**Liquidity providers rewarding system:**\n\nStarting date: November 24th.\n\nTotal Liquidity incentives: 1.800.000 QSR.\n\nDaily Liquidity incentives: Up to 18.000 QSR if the 10x multiplier is achieved.\n\n**Instructions for becoming a liquidity provider:**\n\n1. Get wZNN on PancakeSwap or by swapping ZNN to wZNN at bridge.zenon.network\n\n2. Add liquidity to the wZNN/WBNB PancakeSwap pair.\n\n3. Paste your ZNN address and click Submit.\n\n4. Navigate to bridge.zenon.network and click wZNN Liquidity Program in the main menu.\n\n5. The Web3 wallet (e.g. MetaMask) will ask for permission to sign a message. Confirm the action to continue.\n\n6. Done, you should see a confirmation message.\n\n*Note: Once the BSC (BNB Chain) address is associated with a ZNN address, this can’t be changed.*\n\n**Considerations:**\n\n• Make sure you have the LP tokens in the Web3 wallet address you’re connected to.\n\n• Once you associate your BSC (BNB Chain) address with your ZNN address, this can’t be changed.\n\n• The QSR are distributed every 24 hours after 12:00 UTC. Make sure you have added liquidity to the wZNN/WBNB PancakeSwap pair before the next rewards cycle.\n\nGet your QSR rewards!\n\nWebsite: https://zenon.network/\n\nTwitter: https://twitter.com/Zenon_Network\n\nTelegram: https://t.me/zenonnetwork",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*9w2JvTl2Pgj82E1FiXZh6Q.png",
  "url": "https://medium.com/@zenon.network/wrapped-znn-wznn-liquidity-program-alphanet-edition-e05d7cae7b81",
  "links": [
    "https://medium.com/@zenon.network/wrapped-znn-wznn-liquidity-program-alphanet-edition-e05d7cae7b81"
  ]
}
