{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2021-05-28T21:55:00.691Z",
	"title": "Zenon Public Incentivized Testnet Overview",
	"content": "The Zenon Public Incentivized Testnet, the first component of the Decentralized Transition Mechanism, is just around the corner.\n\nAs one may already know, users will have the possibility to acquire Plasma Points, a new and unique ZTS only available during the Incentivization Period that will be converted into QSR at Alphanet Launch.\n\nIf you missed the QSR Lockdrop window, now it is the time to participate in the Zenon Public Incentivized Testnet and acquire Plasma Points.\n\nMoreover, users that swap their ZNN into tZNN on the Public Incentivized Testnet starting with the Genesis Incentivized Snapshot Momentum will receive Plasma Points proportionally to their swapped balance.\n\nThe swap to tZNN will not affect the balances on the current network. It will simply give users the opportunity to get familiar with the steps that are to be taken following the #AlphanetBigBang.\n\nSteps to acquire Plasma Points (PP) during the Incentivization Period:\n\n1. Download the latest version of the testnet syrius wallet. The wallet version is displayed both in the About widget and the Download section of the testnet website. Also, make sure you follow the steps from the wiki page to check the authenticity of the wallet.\n2. Create a new wallet and securely back it up — the wallet backup is also called a Seed Vault. Navigate to the Settings tab, click on Backup and follow the steps. You will need this backup in order to import it into the syrius wallet after Alphanet Launch to access the QSR.\n3. Navigate to the Incentivization tab. Complete and verify your profile in order to participate.\n4. Complete quests and accumulate Plasma Points. All actions are automatically validated and credited accordingly.\n5. After Alphanet Launch, import the wallet backup — Seed Vault into the Alphanet syrius wallet.\n\nThe purpose of the gamification strategy is to spur community engagement and encourage collaboration.\n\nUsers will be randomly assigned into 4 different alien races:\n\n- Greyz\n- Zygonz\n- Ancientz\n- Zendroidz\n\nUsers will compete to acquire Plasma Points and a dedicated leaderboard will contain the top users with the most Plasma Points accumulated and what alien race they are part of.\n\nThe available quests are grouped into 3 main categories: Wallet Quests, Twitter Quests, Knowledge Quests. Each category has individual quests that users will need to complete in order to receive Plasma Points.\n\nUsers will level up by collecting Plasma Points.\n\nThere are 6 levels in total:\n\n1. Astronaut\n2. Mars Colonialist\n3. Interplanetary Voyager\n4. Interstellar Explorer\n5. Intergalactic Species\n6. Alien\n\nEach level has a multiplier: the higher the level, the greater the multiplier.\n\nThere are also more surprises inside the wallet than the eye can see. Hidden riddles and Easter eggs are awaiting to be discovered.\n\nStart exploring a new universe.\n\nBe ready for the Zenon Public Incentivized Testnet!",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*OHTkihjxJ9NTPEUkc8thog.png",
	"url": "https://medium.com/@zenon.network/zenon-public-incentivized-testnet-overview-591db5fc9bc9",
	"links": [
		"https://medium.com/@zenon.network/zenon-public-incentivized-testnet-overview-591db5fc9bc9"
	]
}
