{
  "author": "Zenon",
  "source": "medium.com",
  "type": "article",
  "published": "2021-10-28T18:47:59.121Z",
  "title": "Zenon Fabric — Paving the way for mass-scale adoption",
  "content": "Blockchain technology will most certainly shift the control of monetary value and information to disrupt global business processes, the same way the Internet did in the early 2000s. In order to enrich such a vision, it’s time to announce and explain Zenon Fabric which will be released after Alphanet Big Bang — the launch of Network of Momentum.\n\nZenon is a decentralized, scalable, feeless, and community-governed network where anyone can contribute with intellectual, financial, or even processing power in return for capital and freedom.\n\nIn order to accelerate the adoption of the ecosystem, we’re introducing you to the Zenon Fabric fund, the next-generation resource aiming for two primary objectives:\n\n• Expanding the Zenon ecosystem through Accelerator-Z\n• Expanding the Zenon community through Vesting mechanisms\n\nThere is an interdependency between Accelerator-Z and the Vesting mechanism, both impacting ecosystem growth and community expansion. However, Accelerator-Z brings defined value, while the Vested Pillars imply continuous growth for the community and the ecosystem.\n\nThe Zenon Fabric has a current allocation of 772.136 $ZNN (more than $19M at current market prices) accessible for anyone pursuing.\n\n1. Accelerator-Z: from A to Z\n\nZenon Fabric is the key resource for scaling the ecosystem, while Accelerator-Z represents the means of accessing it.\n\nAccelerator-Z empowers developers and entrepreneurs to kickstart innovative and future-ready projects that leverage Network of Momentum’s technology. This means that anyone will have the opportunity to develop, build, and monetize their projects and skills.\n\nThe most significant advantage of using NoM infrastructure is that any decentralized project can benefit from its robust, secure and feeless properties. For instance, most of the dApps on Ethereum or Solana are DeFi projects. NoM’s scalability and feeless mechanism can result in higher margins, real-time profit and loss calculations through cost-effective solutions, and a streamlined experience for DeFi users.\n\nHowever, the Zenon ecosystem will support vast use-cases in addition to DeFi. Other categories of interest are Web3 solutions, Gaming, Internet of Things (IoT), Artificial Intelligence (AI), Payment integrations, Decentralized Storage, Decentralized Social Networks, Decentralized Exchanges (DEX) and even community-generated marketing materials and promotions.\n\nFor example:\n\n• Building an alternative cross-chain solution\n• Developing DeFi applications such as liquidity or farming pools\n• Creating non-profit organizations/foundations that will mediate interactions with 3rd parties between the NoM Decentralized Autonomous Organization and businesses (e.g. institutional adoption, centralized exchanges listings, etc.)\n\nAccelerator-Z is here to fund and emerge the most remarkable ideas and initiatives. Everyone can submit an idea or a project and the funding decision will be taken publicly by the DAO through the vote of the Pillars within the Accelerator-Z.\n\n2. Vested Pillars\n\nAnother important component of Zenon Fabric is the vesting mechanism implemented as Vested Pillars.\n\nThese Vested Pillars aim for community expansion and pursue NoM’s mission to offer limitless innovative solutions by establishing strategic partnerships. Through vesting mechanisms, key industry players can be granted Pillars for acquiring new members, network participants, and merging communities.\n\nPillar nodes represent the backbone of NoM by participating in the consensus protocol and the governance framework. Basically, the more delegators a Pillar has onboarded from its community, the higher the monetary rewards will be for both the Pillar and its community.\n\nIn this way, Zenon Fabric will enable powerful bonds through this state-of-the-art vesting mechanism that facilitates mutually beneficial cooperation between the communities and leading industry players.\n\nVested Pillars can be anyone from institutional entities to key-industry players, crypto funds, top crypto influencers, talented developers or even marketing teams.\n\nFor instance, let’s say you’re a crypto influencer. By operating a Vested Pillar in NoM, you can set higher rewards to your delegators in order to drive higher engagement by incentivizing your community.\n\nAnother example of a potential strategic partnership is institutional players through various integrations (e.g. custody solutions).\n\nThe process for Vested Pillars will be similar to Accelerator-Z as the voting will be determined by Pillars. NoM is providing a transparent system that offers the greatest amount of good for the greatest number of people.\n\nStay close and get ready for the Alphanet BigBang!\n\nJoin Zenon on social media:\nTwitter: https://twitter.com/Zenon_Network\nTelegram: https://t.me/zenonnetwork\nDiscord: https://discord.gg/XDDjECy",
  "image": "https://miro.medium.com/v2/resize:fit:1200/1*UsPAyF84qeKy3FBmgXLqcQ.png",
  "url": "https://medium.com/@zenon.network/zenon-fabric-paving-the-way-for-mass-scale-adoption-12f0ecd5411a",
  "links": [
    "https://medium.com/@zenon.network/zenon-fabric-paving-the-way-for-mass-scale-adoption-12f0ecd5411a"
  ]
}
