{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2020-07-28T11:51:36.726Z",
	"title": "Zenon Fabric.",
	"content": "Paving the way to future alliances.\n\nIntro\n\nEven the most ambitious projects need partnerships and associations as a vital element for growth.\n\nThe most significant advantage of a connection with other ecosystems is integrating its elements in a constant pursuit of technological innovation.\n\nBesides the technological aspect, strategic partnerships offer benefits such as acquiring new members, network participants, and merging communities.\n\nAddressing future partners\n\nStarting alliances with other actors in this space with vast numbers of users or customers is a way to significantly increase the maturity of the Network of Momentum and Zenon.\n\nSince partnerships are based on mutual advantages, to accomplish long-term goals and fulfill the project’s ultimate vision, a global scale decentralized protocol for hybrid applications, the Zenon Structure will receive the equivalent QSR of its ZNN holdings which will be used to vest Pillar slots for future key industry players.\n\nZenon Fabric\n\nAfter the QSR lock drop takes place, the “Zenon Structure” will be upgraded as “Zenon Fabric.”\n\nQSR from the “Zenon Fabric” will be used to ensure a “Pillar Vesting” mechanism and slots for strategic investors. The remaining QSR will be used to elevate the ecosystem of zApps by providing it to applications needing fuel as an initial boost.\n\nIn this way, Zenon Fabric will enable the possibility to attract powerful connections through a state-of-the-art vesting algorithm that will facilitate a mutually beneficial cooperation between the community and leading industry players.\n\nOur main activities momentarily are making sure that the QSR snapshot process passes flawlessly and that we deliver Alphanet along with the “s y r i u s” platform in time.\n\nAfter delivery, the pursuit of Zenon’s ecosystem expansion will represent the main line to follow for the remaining part of the year and going into 2021.",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*pYGjbmBSp0BlUDAqSIg9UQ.png",
	"url": "https://medium.com/@zenon.network/zenon-fabric-f6fbe908e63f",
	"links": [
		"https://medium.com/@zenon.network/zenon-fabric-f6fbe908e63f"
	]
}
