{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2020-02-03T14:50:28.044Z",
	"title": "Zenon Project Incubator",
	"content": "Intro to Byzantium Operations.\n\nIt is an unquestionable fact that a cryptocurrency network generates and harvests its value from the usage and activity of the ecosystem and its number of network participants.\n\nBecause adoption should be taken into consideration even from the early stage of development, we have created “Project Incubator” and “Byzantium Operations”, as a way to set the ground and expand the ecosystem before the launch of the Network of Momentum.\n\n“Byzantium Operations” is a sub-project of Zenon Network which allocates a fixed amount of funds to network participants that want to develop applications or perform tasks within the Zenon ecosystem.\n\nTechnical data:\n\n- A maximum of 50,000 ZNN will be allocated to support early-stage zApp development.\n- Projects will be voted by Pillars through the “Byzantium” section of the Zenon Network wallet.\n- Funds will be unlocked when the project is fully developed and tested.\n- Everyone can participate as a team or as an independent developer.\n\nActions required:\n\nActions required from “Project Initiators” to be eligible for voting:\n\n- Write a project plan on Medium containing the following data: project details, completion time, team qualification, team members, contact details (telegram username).\n- Complete and submit the form on the “Zenon Incubator” page zenon.network/incubator\n\nAdditional info:\n\nUsers can submit any type of project as long as it is achievable and can benefit the network participants and the community.\n\nIf a project has been selected for “Byzantium Voting”, initiators should promote it within the Zenon community and gain at least 51% votes from Pillar operators.\n\nProjects which passed the “Byzantium Voting” will be contacted by a Zenon representative for confirmation.\n\nDuring the building phase, project initiators will be in touch with a Zenon representative for requirements and advice regarding current product development.\n\nAfter the project has been developed, it will be reviewed through the final stage of “Byzantium Operations” and the funds will be unlocked.\n\nFor more information regarding “Zenon Incubator” feel free to contact any of the admins from the Telegram Group or email portal@zenon.network.",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*forMjJiKyMgKA1FvMm_-wQ.png",
	"url": "https://medium.com/@zenon.network/zenon-project-incubator-1bbb221e1d2b",
	"links": [
		"https://medium.com/@zenon.network/zenon-project-incubator-1bbb221e1d2b"
	]
}
