{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2020-09-14T20:14:12.643Z",
	"title": "ZNN x QSR Alphanet specifications",
	"content": "As the Network of Momentum Alphanet is nearing its release, a series of articles will be published to clarify some major aspects, such as use cases and strategic partnerships. This article approaches the following subjects: the refreshed coin metrics, the roles of the network actors, and their importance within the Zenon ecosystem.\n\nPILLARS\n\nDuring Phase 0 of NoM, Pillars participate in the consensus protocol by producing and validating Momentum Intervals (blocks), thus being rewarded for securing the network. As full nodes, they also retain and archive the entire ledger history.\n\nPillars Requirements:\n- 15000 ZNN\n- 150000 QSR for Legacy Pillars\n- 160000 QSR or more for Regular Pillars, the calculation can be exemplified by using the formula: max(0, (number_of_pillars — 136 + 1)) * 10000 + 150000 QSR to create the Pillar slot(*).\n\nRefund:\nIf a Pillar is disassembled, the 15000 ZNNs will be refunded to the original address that deployed it. The QSR amount is burned in order to create the Pillar slot, so it is not refundable.\n\nRevoke window:\n- After the initial registration of a Pillar, a cooldown period of 83 days begins\n- At the end of the cooldown period, there is a window of 7 days during which the Pillar can be revoked and disassembled upon user request.\n- This cycle repeats until the Pillar is revoked.\n\nPillar Categories\n\nA. Legacy Pillars(*)\nPillars that were deployed prior to the Alphanet release can create the slot necessary for the Pillar burning for a fixed amount of 150000 QSR at any time, but only once. If the Legacy Pillar is revoked, it loses the Legacy Pillar status and will need to pay for the slot according to the formula above.\n\nThe Legacy Pillar slot is assigned to the public address used at the swap.\n\nB. Vested Pillars\nGranted to strategic partners.\n\nC. Pillars\nThere can be an unlimited number of Pillars, which will require an additional 10000 QSR for each new Pillar slot in the network.\n\nPillar Rankings\nRankings are calculated based on the amount of ZNN delegated to each Pillar. Its position influences the number of Momentum Intervals a Pillar produces.\n\n30 Pillars are chosen pseudo-randomly to produce the next 30 Momentum Intervals as follows:\n- 15 Pillars out of the top 30.\n- 15 Pillars out of all the Pillars that are not part of the previous lot.\n\nPillar Reward\nThe Pillar rewards are divided into two categories:\n- Momentum Interval rewards, distributed based on the number of Momentums a Pillar produced.\n- Delegating rewards, distributed proportionally to the amount of ZNN that was delegated to each Pillar.\n\n**Note: Pillar rewards are affected by the Pillars uptime. If a Pillar is assigned to produce 10 Momentums, but only produces half, it receives 50% of the rewards.\n\nFor example, assuming there are 100 Pillars in the network, the next results are expected:\n- Each Pillar ranking in the top 30 is expected to produce 169 Momentums daily.\n- Each Pillar ranking in the bottom 31–100 positions is expected to produce 50 Momentums daily.\n\nSTAKERS\n\nDuring Phase 0 of NoM, stakers will cease to participate in the consensus protocol but will still have the possibility to accumulate rewards.\n\nA. Delegating to a Pillar to obtain ZNN\n\n30% of the ZNN amount minted daily will be distributed as voting rewards to Pillars. Each account can delegate its balance to a Pillar, which in turn increases the Pillar’s voting power and the percentage of voting rewards that it will receive. This action neither locks nor transfers the balance of the delegating account.\n\nAny Pillar can distribute a part or all of its rewards to the delegators to attract more votes and increase its ranking. This mechanism creates a free market that encourages engagement and fosters community growth.\n\nB. Staking to obtain QSR\n\nRequirements:\nStaking for QSR requires ZNN which will be locked in a smart contract for a predefined amount of time (multiples of 30 days).\n\nRefund:\nAfter the locking period has ended, the staked amount can be refunded without any costs.\n\nRewards:\nThe daily QSR amount assigned to stakers is distributed based on the staked amount of ZNN and the locking period. The QSR amount for each staker is relative to the network’s conditions, and the daily calculations can be exemplified using the following formula:\nweightedAmount = znnAmount * (1 + (lockingPeriodInMonths — 1) / 12)\n\nFor example, assuming the following conditions:\n- Account A stakes 100 ZNN for a locking period of 1 month\n- Account B stakes 100 ZNN for a locking period of 11 months\n- Daily QSR amount assigned for stakers of 300 QSR\nAt the end of the day, the following results are expected:\n- Account A receives 100 QSR\n- Account B receives 200 QSR\n\nNODES\n\nNodes are also full archival nodes; they store, share and passively validate the ledger. They are rewarded with both ZNN and QSR.\n\nRequirements:\n- 5000 ZNN\n- 50000 QSR\n\nEligibility:\nTo be eligible, a Node must meet the following conditions:\n- Be an up-to-date source of information regarding the network’s current state\n- Have a daily uptime >90%\n\nRefund:\nIf a Node is disassembled, both the ZNN and the QSR will be refunded to the original address used to deploy it.\n\nRevoke window:\n- After registration of a Node, a cooldown period of 27 days commences.\n- At the end of the cooldown period, there is a window of 3 days during which the Node can be revoked upon user request.\n- This cycle repeats until the Node is revoked.\n\nRewards:\n- QSR and ZNN are equally distributed among eligible Nodes daily.\n\nFor example, during the first month, a bulk amount of 1960 ZNN/day will be distributed equally among eligible Nodes. If there are 100 Nodes in the network, at the end of the day, each Node will receive 19.6 ZNN.\n\n**Note that the target Momentum Interval is 10 seconds, but the rewards are displayed per minute.\n\nZenon & Quasar Allocation Pool\n\nQSR rewards structure\n\nConclusion,\n\nWe hope this article clarifies aspects of Network of Momentum and ZNN-QSR coin metrics. This is the first of a series of articles delivered in the following weeks as we proceed to follow the path of developing an ecosystem for decentralized applications to thrive.\n\nWelcome to NoM Phase 0, Zenon Alphanet.",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*X4J_Hmk1sbpJ4Ukl5rOBWg.png",
	"url": "https://medium.com/@zenon.network/znn-x-qsr-alphanet-specifications-83d27c005c09",
	"links": [
		"https://medium.com/@zenon.network/znn-x-qsr-alphanet-specifications-83d27c005c09"
	]
}
