{
	"author": "Zenon",
	"source": "medium.com",
	"type": "article",
	"published": "2022-01-29T19:17:52.613Z",
	"title": "ZNN & QSR rewards specifications: Alphanet update",
	"content": "As Alphanet is live and open for everyone to join, in today’s article we will re-approach the rewards mechanisms and allocations for each actor participating in the Network of Momentum.\n\nThe rewards mechanisms of a blockchain protocol have to be designed in such a way that the incentive structure is perfectly aligned with the protocol’s security and adherence.\n\nAs a result of the Orbital Program, NoM has introduced a new network participant: liquidity providers.\n\nThus, the revitalized NoM actors are:\n\n1. **Pillars:** Active participants in securing the network by producing and validating the momentums.\n   - Requirements for spawning a Pillar: 15000 ZNN and a minimum of 150000 QSR. Deploying a Pillar slot requires burning the QSR amount.\n   - Rewards allocations: 50% of the ZNN amount minted daily will be distributed to Pillars.\n\n2. **Sentinels:** Full archival nodes that store, share, and passively validate the dual-ledger state.\n   - Requirements: 5000 ZNN and 50000 QSR for spawning Sentinel slot.\n   - Rewards allocations: 25% of the QSR amount minted daily will be distributed to Sentinels, and 13% of the ZNN amount minted daily will be distributed to Sentinels.\n\n3. **Stakers:** Passive actors that lock-up ZNN for receiving QSR, the scarce asset needed for spawning Pillars, Sentinels, or fusing Plasma (network gas).\n   - Staking requires a minimum of 1 ZNN.\n   - After the locking period has ended, the staked amount can be refunded without any costs.\n   - The daily QSR amount assigned to stakers is distributed based on the staked amount of ZNN and the locking period (staking multiplier). The QSR amount for each staker is relative to the network’s conditions, and the daily calculations can be exemplified using the following multiplier formula:\n   \n     weightedAmount = ((9 + lockinMonths) * stakedAmount) / 10\n\n     *1 month = 207,360 momentums\n     For example, the staking multiplier for a locking period of 12 months* is 2.1.\n   - Rewards allocations: 50% of the QSR amount minted daily will be distributed to Stakers.\n\n4. **Delegators:** Delegation is the process of voting a Pillar to use your ZNN in order to produce momentums. This process increases both the weight and the rank of Pillars in the network, so in exchange for delegating to them, Pillars can set the rewards for their delegators. The relationship between the two is symbiotic since the Pillars are looking for more delegations, so they will invariably increase delegators’ rewards and decide according to the delegators’ collective views.\n   - Delegating requires a minimum of 1 ZNN.\n   - Rewards allocations: 24% of the ZNN amount minted daily will be distributed as voting rewards to Pillars.\n\n5. **Liquidity providers:** Internal or external participants rewarded for providing cross-chain liquidity through Orbital Program.\n   - The Protocol Level Liquidity Program implies that a fraction of all network rewards will be collected and further on can be redistributed by an embedded smart contract in a trustless and censorship-resistant way.\n   - Rewards allocations: Initially, this fraction will be set at 13% ZNN & 25% QSR of the total dual-coin emission and the chains with the corresponding liquidity pools will be decided by the Pillars.\n\n**ZNN rewards chart:**\n\n**QSR rewards chart:**\n\nNoM is an autonomous network harmonizing synergies and collaboration among multiple stakeholders in ensuring a nourishing expansion and a fair rewards distribution.\n\nStay close as atomic upgrades are getting ready to be launched!\n\nWebsite: https://zenon.network/\nTwitter: https://twitter.com/Zenon_Network\nTelegram: https://t.me/zenonnetwork",
	"image": "https://miro.medium.com/v2/resize:fit:1200/1*LuFP2cyg7hgrVy9O2II6EQ.png",
	"url": "https://medium.com/@zenon.network/znn-qsr-rewards-specifications-alphanet-update-338eac03581e",
	"links": [
		"https://medium.com/@zenon.network/znn-qsr-rewards-specifications-alphanet-update-338eac03581e"
	]
}
